[
{"title": "Solutions Analyst", "company": "GS1 Canada", "descr": "Position:Solutions AnalystReports To:Senior Vice President, IMSTier:StaffDepartment:Industry Managed SolutionsCompany:GS1 CanadaLocation:TorontoStatus:Full timeJob Number: 1437Key RoleThe Industry Managed Solutions team requires a Solutions Analyst to assist in managing the ongoing growth and transformation of the team. The Analyst will play a critical role on the IMS team, helping to consolidate the various streams of data and information from throughout the organization. In addition, the Analyst will help create and maintain a comprehensive set of metrics and reports which will help describe the current state of the business, identify trends and measure key vendor performance. In addition to the data-oriented responsibilities, the Analyst will be required to conduct industry research, perform industry scans, partake in vendor reviews and assist in vendor selection.In addition to these responsibilities, the Analyst will assist in the day-to-day operation of the department which will include managing the departments SharePoint site, assisting in budgeting, resource tracking and overall administration of the team.Duties and ResponsibilitiesDevelop and manage reports to identify trends and opportunities within key business areasCollect, organize and maintain information from various sources throughout the organization (incl. subscriber feedback, business requirements, sector board feedback, etc) and deliver regular status updates regarding progress within various project assignmentsConduct industry research and communicate finding to leadership;Manage departmental communication and document SharePoint site;Act as a conduit between the Industry Managed Solutions team and other key stakeholder in the organizationMaintain key vendor information, and monitor reporting on vendor performance against service level agreements and Key Performance IndicatorsAssist with budgeting, time tracking and general administration of the IMS teamRequired Knowledge, Skills, and ExperienceBachelor s degree in Business, Technology or Engineering2-5 years of experience in a similar roleExperience with developing and managing reports, and conducting analysis to provide insights to team members and senior leadershipStrong analytical and statistical knowledge with an ability to combine quantitative and common-sense problem-solving skillsAbility to read, comprehend, summarize and report on various sources of information such as industry articles, websites, periodicals, etc. and present findings in a succinct and professional mannerExcellent knowledge of Microsoft Office suite of products; must have exceptional Excel skills and working knowledge of MS Access (or other database management system).Understanding of simple programing languages (such as SQL, VBA, Python)Ability to independently gain insight into and develop process / system changes and improvements.Self-starter, able to manage and prioritize multiple complex tasks with minimum supervision and strong attention to detailDesire to learn and succeed in a challenging fast-paced environmentUnderstanding of six sigma tools and methodologies would be an assetStrong organizational, planning and time management skillsStrong work ethic, a high respect for confidentiality and sound professional judgment", "link": "https://www.indeed.ca/viewjob?jk=72f855ddc32d6924&from=serp&vjs=3"},
{"title": "Professor - Data Analytics", "company": "Toronto School of Management", "link": "https://www.indeed.ca/cmp/LSBF-Canada-Inc./jobs/Professor-62bc86789a1d92eb?vjs=3"},
{"title": "Analyst, Public Credit", "company": "CPP Investment Board", "descr": "Job DescriptionThe Public Credit group s focus is on the development and implementation of scalable beta and alpha strategies. The Analyst will be responsible for monitoring generation of portfolio risk and performance analytics, including building out tools and infrastructure to assist in such. The individual will work closely with Portfolio Managers to develop reports and tools that aid in portfolio monitoring, research, and trade strategy generation. They will also assist in hedging of portfolio risks, including recommendations of interest rate and FX positions and trades.Role-Specific AccountabilitiesReporting to the Senior Portfolio Manager   Public Credit, this position is primarily responsible for monitoring, reporting on, and reconciling portfolio risk and profit. The role will be integral in developing risk/P&L infrastructure and tracking portfolio exposures against various risk limits. The Analyst will also be responsible for monitoring portfolio FX and interest rate exposure, and will have capacity to recommend alpha positions based on research and sentiment. Major areas of responsibilities include:Developing and enhancing financial models used for valuation of fixed income and credit productsCalculations of P&L, risk and other metrics on the trading deskAssisting Portfolio Managers in the development, implementation and monitoring of existing portfoliosIdentifying and researching new alpha-generating investment opportunities within this asset classConstant optimization and re-engineering of desk processes and strategy tools to increase group efficiency", "link": "https://www.indeed.ca/viewjob?jk=799477c5840d0b37&from=serp&vjs=3"},
{"title": "Senior Business Analyst", "company": "CIBC", "link": "https://ca.indeed.com/viewjob?jk=fc858dc3d91a055a&from=serp&vjs=3"},
{"title": "Test Automation Architect", "company": "HCL America Inc", "link": "https://www.indeed.ca/cmp/HCL-Technologies/jobs/Test-Automation-Architect-3c599e734b2f5519?sjdu=vQIlM60yK_PwYat7ToXhk-QupQFnb8b_tsK3nTDMOrqXoXRzY-VTwf26bWv2KUQtxE0XzjpMiqtAKJtr6OvdSfRXnJP1gKhlBc5kg2DOpKs&adid=269051460&vjs=3"},
{"title": "Analyste s nior", "company": "TD Bank", "link": "https://ca.indeed.com/viewjob?jk=04fff55be875b31a&from=serp&vjs=3"},
{"title": "Analyst, Advanced Analytics", "company": "President's Choice Financial", "descr": "Analyst, Advanced Analytics25 York Street, Toronto, Ontario, M5J 2V5President s Choice Bank is a wholly-owned subsidiary of Loblaw Companies Limited (LCL) and was established to promote President s Choice Financial services offered by strategic partners in all regions of Canada. PCF has grown to over 3 million customers earning millions in better interest rates, free groceries and other rewards. It operates in the following segments:Mastercard : The President s Choice Financial Mastercard is offered and operated by President s Choice Bank.Insurance : Home and auto insurance, travel and pet insurance are offered through affiliates and relationships with several insurance companies.PC Services , which includes PC Financial Insurance, The Mobile Shop, Prepaid Cell Phones Express and gift card businesses, is a new business in growth mode.PC Optimum : All PCF customers have the opportunity to earn PC Optimum Points that can be earned and redeemed in all LCL stores.Loblaws Inc. is a wholly-owned subsidiary of Loblaw Companies Limited (LCL). LCL is Canada s food and pharmacy leader, with a network of corporate and independently- operated stores in communities across the country, employing close to 200,000 Canadians. PCF is an important business unit within LCL that manages and develops products and service programs to improve the customer experience, maximize value, and provide a platform to enhance customer insights and relationships. PCF s vision is to provide superior value financial products to consumers.The Analyst , Advanced Analytics is accountable for delivering tactical and strategic knowledge through multivariate statistical analysis.What you'll doManipulation and calculation of large complex data from various sources, convey complicated information concisely, simply with clarity, and deliver actionable insights that enable business partners to fully understand key drivers of business resultsConduct sophisticated multivariate analysis/ predictive modeling at product, portfolio, and customer level, and recommend appropriate actions to ensure profitable and sustainable business growthDesign, develop and evaluate business cases that consider multiple drivers and relay those drivers into accurate forecasts, and presented to varying audiences in order to move business idea forwardCollaborate with the business areas to assess opportunities and measure results of campaigns & initiatives and ensure timely communication of strategic and operational resultsDevelop and implement statistical models using machine learning techniques that include linear/logistic regression, decision trees and k-means clustering analysisWhat you'll needBachelor s degree in quantitative discipline (e.g. computer science, engineering, statistics or other analytically based discipline). Master s degree in Business Analytics, Management Analytics or other professional designation is highly preferred.Minimum 3 years proven strong business analytical and modeling experience including statistical and segmentation analysis; data analysis and insight development; financial statement and competitive analysisMust be proficient with SAS, SQL, Data Warehouses on large datasets; R or Python, knowledge of SAS Enterprise Data Miner, Hadoop & HIVE are asset.Advanced proficiency in MS Excel & VBA and building complex models for financial, portfolio analysis, and comprehensive business case evaluation.Strategic critical thinker with proven ability to think conceptually (use numbers to tell a story) and make meaning of complex data to develop insights and communicate resultsStrong communication skills and desire to work in cross-functional groups.Experience working with machine learning algorithms including linear/logistic regression, decision trees, k-means clustering analysis#LI-JD1Come and join a winning team who demonstrates innovation, energy, creativity and vision. We recognize the importance of a diverse workforce and we therefor encourage applications from Aboriginal Peoples, women, members of a visible minority and persons with a disability. We thank all applicants for their interest, however, only those selected for an interview will be contacted.Number of Openings:1PC Financial recognizes Canada's diversity as a source of national pride and strength. We have made it a priority to reflect our nation s evolving diversity in the products we sell, the people we hire, and the culture we create in our organization. Accommodation is available upon request for applicants and colleagues with disabilities.In addition, we believe that compliance with laws is about doing the right thing. Upholding the law is part of our Code of Conduct   it reinforces what our customers and stakeholders expect of us.Please Note: If you have Employee Self Service (ESS) on Workday, apply to this job via the Workday application.", "link": "https://ca.indeed.com/viewjob?jk=7407746bfc7d1d43&from=serp&vjs=3"},
{"title": "Senior   Data Analytics", "company": "EY", "descr": "Canada TAS, Decision Analytics SeniorDo you have an analytical mind-set? Within Business Modelling and Decision Analytics we have a rapidly growing analytics service and are currently looking for exceptional individuals with experience in advanced analytics, data science and machine learning technologies to join the team.We work with major corporate and private equity clients, government departments and other public-sector bodies, advising them on complex strategic corporate transaction activities (e.g. related to mergers and acquisitions, joint ventures, asset disposals etc.) and commercial, financial and operational decisions.Our projects often involve managing multiple stakeholders and high degrees of complexity and uncertainty. Decision making in this environment requires strong client management and communication skills, in addition to rigorous analytical techniques and excellent data handling skills.Our work typically involves constructing purpose built databases storing large client datasets for our analytical models, using data transformation tools, visualization tools, programming and statistical tools (such as R and Python), to derive insight through data modelling and simulations, in a fast-moving transaction decision-making environment.Although the team is largely Toronto-based, we operate as a national team and many of our engagements involve multi-national clients. This role will most likely require some travel within Canada and could require overseas working from time to time.", "link": "https://ca.indeed.com/viewjob?jk=713ba3c8f3ed5ee8&from=serp&vjs=3"},
{"title": "Advanced Analytics Lead, Integrative Planning & Predictive Modeling", "company": "Canadian Tire", "link": "https://ca.indeed.com/viewjob?jk=8c1c31e68d741b2f&from=serp&vjs=3"},
{"title": "Software Engineer II", "company": "LoyaltyOne", "descr": "Description:Why Work with Us Are you passionate about Data and Reporting?As part of Member Experience Reporting team, the Software Engineer will play a critical role in making Member Experience data available in Data Hub and providing reports and insights that will help drive business decisions.What you ll do Create pipelines in databricks to transfer data to Data HubSupport other departments by producing self-serve reports / dashboards in Tableau to drive resultsConduct analysis and deliver key insights to address business problems or understand underlying trends to help evolve business strategies or in support of new programs or initiativesPrepare high-quality reports and presentations targeted for specific audiencesProactively highlight opportunities to develop and/or enhance existing tools and processesQualification:Who you are Post-secondary education with 1-2 years IT Application Development ExperienceAdvanced experience using Python, databricks Spark, SQL and ExcelProficient experience with Word, MS Access (VBA programming), PowerPoint and relational databases (Oracle)Familiarity with data warehouse and AWS (data lake) conceptsKnowledge of key call center metrics/reporting and call center applications is an assetSolid analytical, logical and problem-solving skillsStrong project management skills, with the ability to organize and prioritize multiple projects, competing requests and multiple tasks in a deadline-driven environmentStrong written and oral communication skillsWork independently in a fast-paced dynamic environmentPossess an excellent work ethic and be self-motivatedMust be able to travel between offices as necessaryRequirement to work non-core hours from time-to-time (e.g. during application launch)Reports are used for decision making purposes, therefore accuracy and the ability to meet timelines is crucial to the businessAbout LoyaltyOneLoyaltyOne is part of the successful Alliance Data family of companies that provide the full range of data-driven loyalty, marketing and credit solutions in more than 80 locations across the globe.Working with more than 100 leading brands in the retail, financial services, grocery, petroleum retail, travel and hospitality industries to profitably change customer behavior. Through a team of businesses, including one of the leading coalition loyalty programs in the world, the AIR MILES  Reward Program, LoyaltyOne designs, delivers and manages a suite of services focused on consumer data, customer-centric retail strategies, direct-to-consumer marketing, loyalty consulting and more.LoyaltyOne has broadened its horizons geographically by growing Precima in the European market. With the recent acquisition of BrandLoyalty in the Netherlands, LoyaltyOne has gained the expertise of a global leader in short-term loyalty campaigns, along with a client network that extends throughout Europe and Asia.About ADSAlliance Data  (NYSE: ADS) is a leading global provider of data-driven marketing and loyalty solutions serving large, consumer-based industries. The Company creates and deploys customized solutions, enhancing the critical customer marketing experience; the result is measurably changing consumer behavior while driving business growth and profitability for some of today's most recognizable brands. Alliance Data helps its clients create and increase customer loyalty through solutions that engage millions of customers each day across multiple touch points using traditional, digital, mobile and emerging technologies. An S&P 500 and Fortune 500 company headquartered in Plano, Texas, Alliance Data consists of three businesses that together employ more than 16,000 associates at approximately 100 locations worldwide. www.alliancedata.comAlliance Data is an Equal Employment Opportunity employer. Accordingly, we will make reasonable accommodations to respond to the needs of people with disabilities in accordance with legislation.Alliance Data participates in E-Verify.Check us out   LoyaltyOne on Stack Overflow | LinkedIn | Glassdoor | Facebook |Twitter | Blog | Instagram", "link": "https://ca.indeed.com/viewjob?jk=868b0b6f130afcd7&tk=1d8uiskf7bl5r802&from=serp&vjs=3&advn=7042723621657021&adid=276050144&sjdu=i6xVERweJM_pVUvgf-Mzud6v7vx4W2vba62rTobId37eIK82uw1XRT7m-D8lI0g6"},
{"title": "Senior Analyst, Workflow Optimization & Analytics", "company": "Shoppers Drug Mart", "descr": "Location:243 Consumers Road, Toronto, Ontario, M2J 4W8Take ownership and find more ways to care about our local store owners in a career at Shoppers Drug Mart Central Office / Store Support. Provide great service, specific expertise and actionable advice to support Associate-Owners and their staff in delivering the best health, beauty and convenience services to Canadians.Why this role is important?Reporting to the Manager, Workflow Analytics & Insights, you will be a key contributor to the  First to Discover  mission statement by enabling early detection of pharmacy workflow improvement opportunities and developing tools to optimize process and operational design. To be successful, you will leverage expertise in data modeling & database design, deep-dive analytics, reporting dashboards, and developing leading-edge decision support tools such as optimization and labour planning models.This is an opportunity to tackle unique challenges within the Enterprise Operations Development & Systems organization, making a positive impact to productivity, patient safety and privacy, and customer experience in retail pharmacy across Canada for both Shoppers Drug Mart and Loblaws stores.What You'll Do:Measure workflow performance by analyzing transaction data and conducting in-store time studiesContribute to the development of labour modeling and scheduling tools, and support the development of change management materials and communications for the annual planning processDrive new analytical insights from transactional prescription data (long and wide data sets), using sound statistical and modeling techniques (classification, linear and logistic regression, etc.) to evaluate business hypothesesEvaluate accuracy and precision of models through p-value, residual analysis, confusion matrix, etc.Proactively identify and integrate new data sources to expand timeliness, quality, and insightfulness of analytical and modeling activitiesBuild databases and data collection/transformation processes to transform raw data into useful metricsProvide ad-hoc analysis, decision support tools, and performance measurements to support business partners and stakeholder initiativesDefine and capture KPIs to measure project success, and validate quality of transactional data and other data sourcesGenerate dashboard reports to inform leadership team on workflow performance and trendsWork with development partners to ensure decision support and reporting tools are built to expectationWhat You'll Need:University-level education in Statistics, Computer Science, Engineering, or a related quantitative field (preference given to post-graduate degrees)3+ years of experience in an operations research, data science, or similar roleStrong programming, scripting, or automation skills required (e.g. R, Python, VBA, Javascript)Knowledge in SQL and database principles requiredExperience in predictive analytics and machine learning would be an assetEffective communication and business understanding, able to articulate the  so-what  of analytical results into business contextAble to conceptualize and work with complex systems and modelsSelf-driven initiative and natural curiosity to challenge existing assumptions and pose new questionsStrong attention to detail, delivering high quality of work in fast-paced and dynamic environmentWhy work at Shoppers Drug Mart?Acting as consultants, supporting internal customers and the Associate-Owners, you will get experience unique to the retail industry while working for an award-winning national brand. Benefit from a purchase discount program, competitive pay and online learning through SDMU.Take ownership of your work and find more ways to care about your work, co-workers, customers and community.How You ll Succeed:At Shoppers Drug Mart Inc. , we seek great people to continually strengthen our culture. We believe great people model our values, are authentic, build trust and make connections.If that sounds like you, and you are open-minded, responsive to change and up to the challenges provided in a fast-paced retail environment, apply today.Employment Type:Full timeType of Role:RegularShoppers Drug Mart Inc. recognizes Canada's diversity as a source of national pride and strength. We have made it a priority to reflect our nation s evolving diversity in the products we sell, the people we hire, and the culture we create in our organization. Accommodation is available upon request for applicants with disabilities in the recruitment and assessment process and when hired.In addition, we believe that compliance with laws is about doing the right thing. Upholding the law is part of our Code of Conduct   it reinforces what our customers and stakeholders expect of us.Please Note: If you have Employee Self Service (ESS) on Workday, apply to this job via the Workday application.", "link": "https://ca.indeed.com/viewjob?jk=4d4ad6339c2758a7&from=serp&vjs=3"},
{"title": "Senior Quantitative Analyst", "company": "Manulife", "descr": "Are you looking for unlimited opportunities to develop and succeed? With work that challenges and makes a difference, within a flexible and supportive environment, we can help our customers achieve their dreams and aspirations.Job DescriptionThe Quantitative Analytics team within Financial Risk provides quantitative financial modelling and analytics capability to a variety of stakeholders in Group Risk, Group Finance and Business Units. The team focuses on model, methodology and application development to support liability valuation, risk measurement, insurance product pricing and decision making.Reporting to the AVP, Quantitative Analytics, the Senior Quantitative Analyst is accountable for the development and implementation of quantitative models to support business growth. This position provides the unique opportunity for gaining exposure to risks arising from both asset and liability sides (interest rate risk, equity risk, counterparty credit risk, etc.).ResponsibilitiesDevelop models to generate economic scenarios covering multiple asset classes for valuation, pricing, capital and risk reporting.Develop risk models/engines for market, credit, liquidity and investment risks.Develop calibration methodology and build calibration tools for model inputs.Document key processes on model and methodology related processes.Responsible for getting models and methodologies approved by appropriated authorities or vetted by Model Risk Management.Understand business requirements and look for opportunities to automate and streamline business processes.Participate in ad-hoc projects and provide quantitative support to business partners, senior management and industry working groups.Keep informed of current practices and research in financial modelling by reading academic literature, attending academic and practitioner workshops and conference.QualificationsMaster or Ph.D. in Quantitative/Mathematical Finance, Mathematics, Physics, Engineering, Statistics, etc..Experience in stochastic modelling, probability theories, statistics analysis, econometric modelling, machine learning and other numerical techniques.Experience in Python, EXCEL, VBA and SQL.Excellent analytic and problem-solving skills.Excellent communication and documentation skills.Strong organizational and team building skills.Ability to build strong working relationships with business units and other teams across Manulife.If you are ready to unleash your potential it s time to start your career with Manulife/John Hancock.About ManulifeManulife Financial Corporation is a leading international financial services group that helps people achieve their dreams and aspirations by putting customers' needs first and providing the right advice and solutions. We operate as John Hancock in the United States and Manulife elsewhere. We provide financial advice, insurance, as well as wealth and asset management solutions for individuals, groups and institutions. At the end of 2016, we had approximately 35,000 employees, 70,000 agents, and thousands of distribution partners, serving more than 22 million customers. At the end of 2016, we had $977 billion (US$728 billion) in assets under management and administration, and in the previous 12 months we made almost $26 billion in payments to our customers.Our principal operations are in Asia, Canada and the United States where we have served customers for more than 100 years. With our global headquarters in Toronto, Canada, we trade as 'MFC' on the Toronto, New York, and the Philippine stock exchanges and under '945' in Hong Kong.Manulife is committed to supporting a culture of diversity and accessibility across the organization. It is our priority to remove barriers to provide equal access to employment. A Human Resources representative will consult with applicants contacted to participate at any stage of the recruitment process who request an accommodation. Information received regarding the accommodation needs of applicants will be addressed confidentially.", "link": "https://ca.indeed.com/viewjob?jk=b185978f274dccf7&from=serp&vjs=3"},
{"title": "Senior Specialist, Process Innovation", "company": "Samsung Electronics", "descr": "Position SummaryThe Senior Specialist in Process Innovation will review all operations and processes related to Retail, sales, Supply Chain Management (SCM), Logistics, Finance and Service to identify areas of improvement, develop action/project plans to address and follow through to implementation. This person will focus on value added projects to optimize the functional processes and the operational systems utilizing data driven analytics. The position will be a key liaison between Sales & Marketing, SCM, Logistics, Business Operations Center (BOC), Information Technology (MIS), Finance and Service and will interact with Samsung Corporate Headquarters(HQ), North American Headquarters (NAHQ), Samsung sister companies such as Samsung SDS, External Customers and 3rd party Vendors on projects they lead.Role and ResponsibilitiesEssential Duties and Responsibilities:Responsible for the development of new Process Innovation Projects related to operation optimization and process efficiency and ensuring successful delivery of projects: Project PlanEnsures execution of projects developedResponsible to establish timelines, ownership, key milestones and to follow-up with stakeholders on all deliverablesResponsible to monitor project execution and develops follow-up plan in case change/improvement are required based on the feedbackResponsible for the adoption and coordination of new operational process or system changes ensuring alignment to HQ guidelinesResponsible to resolve escalations through interaction with all levels within Sales and Marketing, SCM, Logistics, BOC, Finance and Service to ensure that needs are identified and immediate resolution found for critical SCM operational barriersCoordination of required System/process implementationTraining for new Process or functional system delivered by projectImplementing a robust KPI monitoring system at Project end to measure short/long term resultsResponsible to present strategic ideas to executives, tactical plans to managers and operational tasks to employees in addition to gaining consensus from all levels of the organizationReview and Coordinate the updates of new policies and procedures in GPPMKnowledge:Education focused on a technical discipline is an asset (Computer Science, Engineering, etc)Expert Knowledge of Business Systems (SAP required, SFDC an asset)MS Office suite required, Strong Excel VBA, SQL an asset, R and Python an assetAbility to evaluate and analyze complex systems data and determine appropriate actionsStrong interpersonal skills with the ability to influence without authorityAdvanced in Microsoft Office (Excel, Access, PowerPoint, Visio, Word, Outlook),Experience:Project Management experience required (PMP an asset)Lean Six Sigma experience an Asset3-5 years of work related experience supply chain processes and/or retail channel within electronics industryCompetencies:Strong Data analysisThe ability to develop and maintain excellent working relationships with multiple levels within and outside the company. Must be able to influence others in acceptance, approval, and providing project description.The ability to plan, organize, and prioritize multiple assignments and projects.The ability to work in a team environment to identify and achieve team project goals and results, including the completion of assignments within established time frames.Demonstrated ability to Interact with all levels within the organizationStrong interpersonal and analytical skillsSkills and QualificationsSamsung is an equal employment opportunity employer.Samsung has an accommodation process in place and provides accommodations for job applicants with disabilities as appropriate. Assessment and selection materials and procedures can be made available in accessible formats and methods as appropriate. If you require a specific accommodation because of disability or medical need, please let us know when selected to take part in our recruitment process so that reasonable arrangements can be made for the appropriate accommodations to be in place as you move through our process.We thank you for your interest in working for Samsung. Only candidates selected for an interview will be contacted.#LI-DJ1#indhigh* Please visit Samsung membership to see Privacy Policy, which defaults according to your location. You can change Country/Language at the bottom of the page. If you are European Economic Resident, please click here .", "link": "https://ca.indeed.com/viewjob?jk=4e4071e6212274dd&tk=1d8uiskefbr0n800&from=serp&vjs=3&advn=4239586925542806&adid=192544934&sjdu=SiFHkPhkZXklx1BTeo8ye7P5n_-s08hrxMD-dtpZk1mNTAFRPpsSNCj5n5rye5lRDM3_fIKHIPOT2t6btmZj70bWxM9QQUtCzgscF56GXoaFNI8Kh2pSkVkX1-iPWXIQ8cmXIpoQ7ajHYZVrgXbVJkJ62_NkPPmsqUvzB3Ka2tTbj1wgapo-kDUYNzHRnF1l9owAEa2u-3z1BAnD3hr-jA"},
{"title": "Senior Specialist, Process Innovation", "company": "Samsung Electronics", "descr": "Position SummaryThe Senior Specialist in Process Innovation will review all operations and processes related to Retail, sales, Supply Chain Management (SCM), Logistics, Finance and Service to identify areas of improvement, develop action/project plans to address and follow through to implementation. This person will focus on value added projects to optimize the functional processes and the operational systems utilizing data driven analytics. The position will be a key liaison between Sales & Marketing, SCM, Logistics, Business Operations Center (BOC), Information Technology (MIS), Finance and Service and will interact with Samsung Corporate Headquarters(HQ), North American Headquarters (NAHQ), Samsung sister companies such as Samsung SDS, External Customers and 3rd party Vendors on projects they lead.Role and ResponsibilitiesEssential Duties and Responsibilities:Responsible for the development of new Process Innovation Projects related to operation optimization and process efficiency and ensuring successful delivery of projects: Project PlanEnsures execution of projects developedResponsible to establish timelines, ownership, key milestones and to follow-up with stakeholders on all deliverablesResponsible to monitor project execution and develops follow-up plan in case change/improvement are required based on the feedbackResponsible for the adoption and coordination of new operational process or system changes ensuring alignment to HQ guidelinesResponsible to resolve escalations through interaction with all levels within Sales and Marketing, SCM, Logistics, BOC, Finance and Service to ensure that needs are identified and immediate resolution found for critical SCM operational barriersCoordination of required System/process implementationTraining for new Process or functional system delivered by projectImplementing a robust KPI monitoring system at Project end to measure short/long term resultsResponsible to present strategic ideas to executives, tactical plans to managers and operational tasks to employees in addition to gaining consensus from all levels of the organizationReview and Coordinate the updates of new policies and procedures in GPPMKnowledge:Education focused on a technical discipline is an asset (Computer Science, Engineering, etc)Expert Knowledge of Business Systems (SAP required, SFDC an asset)MS Office suite required, Strong Excel VBA, SQL an asset, R and Python an assetAbility to evaluate and analyze complex systems data and determine appropriate actionsStrong interpersonal skills with the ability to influence without authorityAdvanced in Microsoft Office (Excel, Access, PowerPoint, Visio, Word, Outlook),Experience:Project Management experience required (PMP an asset)Lean Six Sigma experience an Asset3-5 years of work related experience supply chain processes and/or retail channel within electronics industryCompetencies:Strong Data analysisThe ability to develop and maintain excellent working relationships with multiple levels within and outside the company. Must be able to influence others in acceptance, approval, and providing project description.The ability to plan, organize, and prioritize multiple assignments and projects.The ability to work in a team environment to identify and achieve team project goals and results, including the completion of assignments within established time frames.Demonstrated ability to Interact with all levels within the organizationStrong interpersonal and analytical skillsSkills and QualificationsSamsung is an equal employment opportunity employer.Samsung has an accommodation process in place and provides accommodations for job applicants with disabilities as appropriate. Assessment and selection materials and procedures can be made available in accessible formats and methods as appropriate. If you require a specific accommodation because of disability or medical need, please let us know when selected to take part in our recruitment process so that reasonable arrangements can be made for the appropriate accommodations to be in place as you move through our process.We thank you for your interest in working for Samsung. Only candidates selected for an interview will be contacted.#LI-DJ1#indhigh* Please visit Samsung membership to see Privacy Policy, which defaults according to your location. You can change Country/Language at the bottom of the page. If you are European Economic Resident, please click here .", "link": "https://ca.indeed.com/viewjob?jk=4e4071e6212274dd&tk=1d8uismqef8sh800&from=serp&vjs=3&advn=4239586925542806&adid=192544934&sjdu=SiFHkPhkZXklx1BTeo8ye7P5n_-s08hrxMD-dtpZk1mNTAFRPpsSNCj5n5rye5lRDM3_fIKHIPOT2t6btmZj70bWxM9QQUtCzgscF56GXoaFNI8Kh2pSkVkX1-iPWXIQ8cmXIpoQ7ajHYZVrgXbVJkJ62_NkPPmsqUvzB3Ka2tTbj1wgapo-kDUYNzHRnF1l9owAEa2u-3z1BAnD3hr-jA"},
{"title": "Software Engineer II", "company": "LoyaltyOne", "descr": "Description:Why Work with Us Are you passionate about Data and Reporting?As part of Member Experience Reporting team, the Software Engineer will play a critical role in making Member Experience data available in Data Hub and providing reports and insights that will help drive business decisions.What you ll do Create pipelines in databricks to transfer data to Data HubSupport other departments by producing self-serve reports / dashboards in Tableau to drive resultsConduct analysis and deliver key insights to address business problems or understand underlying trends to help evolve business strategies or in support of new programs or initiativesPrepare high-quality reports and presentations targeted for specific audiencesProactively highlight opportunities to develop and/or enhance existing tools and processesQualification:Who you are Post-secondary education with 1-2 years IT Application Development ExperienceAdvanced experience using Python, databricks Spark, SQL and ExcelProficient experience with Word, MS Access (VBA programming), PowerPoint and relational databases (Oracle)Familiarity with data warehouse and AWS (data lake) conceptsKnowledge of key call center metrics/reporting and call center applications is an assetSolid analytical, logical and problem-solving skillsStrong project management skills, with the ability to organize and prioritize multiple projects, competing requests and multiple tasks in a deadline-driven environmentStrong written and oral communication skillsWork independently in a fast-paced dynamic environmentPossess an excellent work ethic and be self-motivatedMust be able to travel between offices as necessaryRequirement to work non-core hours from time-to-time (e.g. during application launch)Reports are used for decision making purposes, therefore accuracy and the ability to meet timelines is crucial to the businessAbout LoyaltyOneLoyaltyOne is part of the successful Alliance Data family of companies that provide the full range of data-driven loyalty, marketing and credit solutions in more than 80 locations across the globe.Working with more than 100 leading brands in the retail, financial services, grocery, petroleum retail, travel and hospitality industries to profitably change customer behavior. Through a team of businesses, including one of the leading coalition loyalty programs in the world, the AIR MILES  Reward Program, LoyaltyOne designs, delivers and manages a suite of services focused on consumer data, customer-centric retail strategies, direct-to-consumer marketing, loyalty consulting and more.LoyaltyOne has broadened its horizons geographically by growing Precima in the European market. With the recent acquisition of BrandLoyalty in the Netherlands, LoyaltyOne has gained the expertise of a global leader in short-term loyalty campaigns, along with a client network that extends throughout Europe and Asia.About ADSAlliance Data  (NYSE: ADS) is a leading global provider of data-driven marketing and loyalty solutions serving large, consumer-based industries. The Company creates and deploys customized solutions, enhancing the critical customer marketing experience; the result is measurably changing consumer behavior while driving business growth and profitability for some of today's most recognizable brands. Alliance Data helps its clients create and increase customer loyalty through solutions that engage millions of customers each day across multiple touch points using traditional, digital, mobile and emerging technologies. An S&P 500 and Fortune 500 company headquartered in Plano, Texas, Alliance Data consists of three businesses that together employ more than 16,000 associates at approximately 100 locations worldwide. www.alliancedata.comAlliance Data is an Equal Employment Opportunity employer. Accordingly, we will make reasonable accommodations to respond to the needs of people with disabilities in accordance with legislation.Alliance Data participates in E-Verify.Check us out   LoyaltyOne on Stack Overflow | LinkedIn | Glassdoor | Facebook |Twitter | Blog | Instagram", "link": "https://ca.indeed.com/viewjob?jk=868b0b6f130afcd7&tk=1d8uisnknf8sh800&from=serp&vjs=3&advn=7042723621657021&adid=276050144&sjdu=i6xVERweJM_pVUvgf-Mzud6v7vx4W2vba62rTobId37eIK82uw1XRT7m-D8lI0g6"},
{"title": "Software Engineer II", "company": "LoyaltyOne", "descr": "Description:Why Work with Us Are you passionate about Data and Reporting?As part of Member Experience Reporting team, the Software Engineer will play a critical role in making Member Experience data available in Data Hub and providing reports and insights that will help drive business decisions.What you ll do Create pipelines in databricks to transfer data to Data HubSupport other departments by producing self-serve reports / dashboards in Tableau to drive resultsConduct analysis and deliver key insights to address business problems or understand underlying trends to help evolve business strategies or in support of new programs or initiativesPrepare high-quality reports and presentations targeted for specific audiencesProactively highlight opportunities to develop and/or enhance existing tools and processesQualification:Who you are Post-secondary education with 1-2 years IT Application Development ExperienceAdvanced experience using Python, databricks Spark, SQL and ExcelProficient experience with Word, MS Access (VBA programming), PowerPoint and relational databases (Oracle)Familiarity with data warehouse and AWS (data lake) conceptsKnowledge of key call center metrics/reporting and call center applications is an assetSolid analytical, logical and problem-solving skillsStrong project management skills, with the ability to organize and prioritize multiple projects, competing requests and multiple tasks in a deadline-driven environmentStrong written and oral communication skillsWork independently in a fast-paced dynamic environmentPossess an excellent work ethic and be self-motivatedMust be able to travel between offices as necessaryRequirement to work non-core hours from time-to-time (e.g. during application launch)Reports are used for decision making purposes, therefore accuracy and the ability to meet timelines is crucial to the businessAbout LoyaltyOneLoyaltyOne is part of the successful Alliance Data family of companies that provide the full range of data-driven loyalty, marketing and credit solutions in more than 80 locations across the globe.Working with more than 100 leading brands in the retail, financial services, grocery, petroleum retail, travel and hospitality industries to profitably change customer behavior. Through a team of businesses, including one of the leading coalition loyalty programs in the world, the AIR MILES  Reward Program, LoyaltyOne designs, delivers and manages a suite of services focused on consumer data, customer-centric retail strategies, direct-to-consumer marketing, loyalty consulting and more.LoyaltyOne has broadened its horizons geographically by growing Precima in the European market. With the recent acquisition of BrandLoyalty in the Netherlands, LoyaltyOne has gained the expertise of a global leader in short-term loyalty campaigns, along with a client network that extends throughout Europe and Asia.About ADSAlliance Data  (NYSE: ADS) is a leading global provider of data-driven marketing and loyalty solutions serving large, consumer-based industries. The Company creates and deploys customized solutions, enhancing the critical customer marketing experience; the result is measurably changing consumer behavior while driving business growth and profitability for some of today's most recognizable brands. Alliance Data helps its clients create and increase customer loyalty through solutions that engage millions of customers each day across multiple touch points using traditional, digital, mobile and emerging technologies. An S&P 500 and Fortune 500 company headquartered in Plano, Texas, Alliance Data consists of three businesses that together employ more than 16,000 associates at approximately 100 locations worldwide. www.alliancedata.comAlliance Data is an Equal Employment Opportunity employer. Accordingly, we will make reasonable accommodations to respond to the needs of people with disabilities in accordance with legislation.Alliance Data participates in E-Verify.Check us out   LoyaltyOne on Stack Overflow | LinkedIn | Glassdoor | Facebook |Twitter | Blog | Instagram", "link": "https://ca.indeed.com/viewjob?jk=868b0b6f130afcd7&tk=1d8uisnr9f8sh800&from=serp&vjs=3&advn=7042723621657021&adid=276050144&sjdu=i6xVERweJM_pVUvgf-Mzud6v7vx4W2vba62rTobId37eIK82uw1XRT7m-D8lI0g6"},
{"title": "Test Automation Architect", "company": "HCL America Inc", "link": "https://www.indeed.ca/cmp/HCL-Technologies/jobs/Test-Automation-Architect-3c599e734b2f5519?vjs=3"},
{"title": "Senior Specialist, Process Innovation", "company": "Samsung Electronics", "descr": "Position SummaryThe Senior Specialist in Process Innovation will review all operations and processes related to Retail, sales, Supply Chain Management (SCM), Logistics, Finance and Service to identify areas of improvement, develop action/project plans to address and follow through to implementation. This person will focus on value added projects to optimize the functional processes and the operational systems utilizing data driven analytics. The position will be a key liaison between Sales & Marketing, SCM, Logistics, Business Operations Center (BOC), Information Technology (MIS), Finance and Service and will interact with Samsung Corporate Headquarters(HQ), North American Headquarters (NAHQ), Samsung sister companies such as Samsung SDS, External Customers and 3rd party Vendors on projects they lead.Role and ResponsibilitiesEssential Duties and Responsibilities:Responsible for the development of new Process Innovation Projects related to operation optimization and process efficiency and ensuring successful delivery of projects: Project PlanEnsures execution of projects developedResponsible to establish timelines, ownership, key milestones and to follow-up with stakeholders on all deliverablesResponsible to monitor project execution and develops follow-up plan in case change/improvement are required based on the feedbackResponsible for the adoption and coordination of new operational process or system changes ensuring alignment to HQ guidelinesResponsible to resolve escalations through interaction with all levels within Sales and Marketing, SCM, Logistics, BOC, Finance and Service to ensure that needs are identified and immediate resolution found for critical SCM operational barriersCoordination of required System/process implementationTraining for new Process or functional system delivered by projectImplementing a robust KPI monitoring system at Project end to measure short/long term resultsResponsible to present strategic ideas to executives, tactical plans to managers and operational tasks to employees in addition to gaining consensus from all levels of the organizationReview and Coordinate the updates of new policies and procedures in GPPMKnowledge:Education focused on a technical discipline is an asset (Computer Science, Engineering, etc)Expert Knowledge of Business Systems (SAP required, SFDC an asset)MS Office suite required, Strong Excel VBA, SQL an asset, R and Python an assetAbility to evaluate and analyze complex systems data and determine appropriate actionsStrong interpersonal skills with the ability to influence without authorityAdvanced in Microsoft Office (Excel, Access, PowerPoint, Visio, Word, Outlook),Experience:Project Management experience required (PMP an asset)Lean Six Sigma experience an Asset3-5 years of work related experience supply chain processes and/or retail channel within electronics industryCompetencies:Strong Data analysisThe ability to develop and maintain excellent working relationships with multiple levels within and outside the company. Must be able to influence others in acceptance, approval, and providing project description.The ability to plan, organize, and prioritize multiple assignments and projects.The ability to work in a team environment to identify and achieve team project goals and results, including the completion of assignments within established time frames.Demonstrated ability to Interact with all levels within the organizationStrong interpersonal and analytical skillsSkills and QualificationsSamsung is an equal employment opportunity employer.Samsung has an accommodation process in place and provides accommodations for job applicants with disabilities as appropriate. Assessment and selection materials and procedures can be made available in accessible formats and methods as appropriate. If you require a specific accommodation because of disability or medical need, please let us know when selected to take part in our recruitment process so that reasonable arrangements can be made for the appropriate accommodations to be in place as you move through our process.We thank you for your interest in working for Samsung. Only candidates selected for an interview will be contacted.#LI-DJ1#indhigh* Please visit Samsung membership to see Privacy Policy, which defaults according to your location. You can change Country/Language at the bottom of the page. If you are European Economic Resident, please click here .", "link": "https://ca.indeed.com/viewjob?jk=4e4071e6212274dd&tk=1d8uisnr3f8sh800&from=serp&vjs=3&advn=4239586925542806&adid=192544934&sjdu=SiFHkPhkZXklx1BTeo8ye7P5n_-s08hrxMD-dtpZk1mNTAFRPpsSNCj5n5rye5lRDM3_fIKHIPOT2t6btmZj70bWxM9QQUtCzgscF56GXoaFNI8Kh2pSkVkX1-iPWXIQ8cmXIpoQ7ajHYZVrgXbVJkJ62_NkPPmsqUvzB3Ka2tTbj1wgapo-kDUYNzHRnF1l9owAEa2u-3z1BAnD3hr-jA"},
{"title": "Prochaines occasions   analystes en actuariat principaux, chefs d quipe et scientifiques de donn es", "company": "Johnson", "link": "https://www.indeed.ca/viewjob?jk=eb1ab6c62ec89b9a&from=serp&vjs=3"},
{"title": "Senior Specialist, Process Innovation", "company": "Samsung Electronics", "descr": "Position SummaryThe Senior Specialist in Process Innovation will review all operations and processes related to Retail, sales, Supply Chain Management (SCM), Logistics, Finance and Service to identify areas of improvement, develop action/project plans to address and follow through to implementation. This person will focus on value added projects to optimize the functional processes and the operational systems utilizing data driven analytics. The position will be a key liaison between Sales & Marketing, SCM, Logistics, Business Operations Center (BOC), Information Technology (MIS), Finance and Service and will interact with Samsung Corporate Headquarters(HQ), North American Headquarters (NAHQ), Samsung sister companies such as Samsung SDS, External Customers and 3rd party Vendors on projects they lead.Role and ResponsibilitiesEssential Duties and Responsibilities:Responsible for the development of new Process Innovation Projects related to operation optimization and process efficiency and ensuring successful delivery of projects: Project PlanEnsures execution of projects developedResponsible to establish timelines, ownership, key milestones and to follow-up with stakeholders on all deliverablesResponsible to monitor project execution and develops follow-up plan in case change/improvement are required based on the feedbackResponsible for the adoption and coordination of new operational process or system changes ensuring alignment to HQ guidelinesResponsible to resolve escalations through interaction with all levels within Sales and Marketing, SCM, Logistics, BOC, Finance and Service to ensure that needs are identified and immediate resolution found for critical SCM operational barriersCoordination of required System/process implementationTraining for new Process or functional system delivered by projectImplementing a robust KPI monitoring system at Project end to measure short/long term resultsResponsible to present strategic ideas to executives, tactical plans to managers and operational tasks to employees in addition to gaining consensus from all levels of the organizationReview and Coordinate the updates of new policies and procedures in GPPMKnowledge:Education focused on a technical discipline is an asset (Computer Science, Engineering, etc)Expert Knowledge of Business Systems (SAP required, SFDC an asset)MS Office suite required, Strong Excel VBA, SQL an asset, R and Python an assetAbility to evaluate and analyze complex systems data and determine appropriate actionsStrong interpersonal skills with the ability to influence without authorityAdvanced in Microsoft Office (Excel, Access, PowerPoint, Visio, Word, Outlook),Experience:Project Management experience required (PMP an asset)Lean Six Sigma experience an Asset3-5 years of work related experience supply chain processes and/or retail channel within electronics industryCompetencies:Strong Data analysisThe ability to develop and maintain excellent working relationships with multiple levels within and outside the company. Must be able to influence others in acceptance, approval, and providing project description.The ability to plan, organize, and prioritize multiple assignments and projects.The ability to work in a team environment to identify and achieve team project goals and results, including the completion of assignments within established time frames.Demonstrated ability to Interact with all levels within the organizationStrong interpersonal and analytical skillsSkills and QualificationsSamsung is an equal employment opportunity employer.Samsung has an accommodation process in place and provides accommodations for job applicants with disabilities as appropriate. Assessment and selection materials and procedures can be made available in accessible formats and methods as appropriate. If you require a specific accommodation because of disability or medical need, please let us know when selected to take part in our recruitment process so that reasonable arrangements can be made for the appropriate accommodations to be in place as you move through our process.We thank you for your interest in working for Samsung. Only candidates selected for an interview will be contacted.#LI-DJ1#indhigh* Please visit Samsung membership to see Privacy Policy, which defaults according to your location. You can change Country/Language at the bottom of the page. If you are European Economic Resident, please click here .", "link": "https://ca.indeed.com/viewjob?jk=4e4071e6212274dd&tk=1d8uiso5af8sh800&from=serp&vjs=3&advn=4239586925542806&adid=192544934&sjdu=SiFHkPhkZXklx1BTeo8ye7P5n_-s08hrxMD-dtpZk1mNTAFRPpsSNCj5n5rye5lRDM3_fIKHIPOT2t6btmZj70bWxM9QQUtCzgscF56GXoaFNI8Kh2pSkVkX1-iPWXIQ8cmXIpoQ7ajHYZVrgXbVJkJ62_NkPPmsqUvzB3Ka2tTbj1wgapo-kDUYNzHRnF1l9owAEa2u-3z1BAnD3hr-jA"},
{"title": "Manager Counterparty Credit Risk Capital", "company": "BMO Financial Group", "descr": "Mandate:Daily operations and system enhancements, create and participate in development of testing requirements and validation of implementation of capital requirements for Counterparty Credit Risk Capital. Identify opportunities for, and lead the enhancement for capital methodologies for quantifying counterparty credit risk capital across all trading products so that the accuracy and reliability of capital and consequent business decisions reliant upon these data are enhanced.KEY ACCOUNTABILITIES Implement tools for, and perform, driver analysis for the capital changes based on production operationsInterpret the regulatory requirement and provide analytical solutionsTranslate the business solutions into technical requirement, i.e. write business requirementSupport the implementation process, and provide seamless communication with technology developer .Cr eate test plan including the test scenarios and sample data to support the testing scenariosPerform the testing across the entire testing cycle to ensure business requirements are metIdentify issues and propose solutionsAnalyze the test result and communicate the result to senior managementDocument procedures, control processes, and policies relevant to internal controlsContinuously improve understanding of subject matter relating to Counterparty Credit Risk monitoring and Basel III RWA / capital calculationsCROSS-FUNCTIONAL RELATIONSHIPSTechnology & Operations;Corporate Risk Management directors and managers;Capital Markets Trading Lines of BusinessCredit Portfolio Managers and Account ManagersExternal system software vendorsModel ValidationMarket Risk internal teams   infrastructure, process and governance, etc.ROLE DIMENSIONS:This role has direct or in-direct impact on the following financial measures: Regulatory capital ;Economic and regulatory capital;Counterparty credit risk exposure measurements;QualificationsKNOWLEDGE AND SKILLS:Must-Have Skills: 3+ years of related work experience in a financial institutionStrong knowledge with financial products, specifically possessing knowledge of derivatives ( OTC) as well as SFTStrong Experience working with BASEL III and OSFI CAR GuidelineStrong Experience with CCR, CCR Capital ( CEM, SA-CCR) is a MUSTExperience on BCARAdvanced knowledge of Excel, VBA, SQL, Database ConceptsAdvanced Python programming experienceParticipation in mid-scale/large IT development projects, with hands-on experience in conducting testingStrong capability of writing business requirement and test plansStrong capability of creating mock-up data required to test the pre-specified casesNice-to-Have Skills:Broad understanding of risk management methodologiesExperience in using work tracking systems (e.g. JIRA, HPQC) would be an advantageExperience in an Agile and fast-paced environmentSoft Skills :Strong analytic and troubleshooting skill s with a solution oriented attitudeSelf-motivated and take ownershipGood self-organization skills including planning, scheduling, managing priorities and meeting deadlinesGood oral and written communication skills .Strong interpersonal skills and ability to function effectively within a team, and work with multiple stakeholders.Curios, dynamic, focused, proactive, detail-orientedEducational Requirements/Professional Certifications:Advanced university degree, preferably in a quantitative field, such as Mathematics, Statistics, Science or Engineering.CFA, FRM, PRM designation or working towards one of those or similar ones would be an assetWe re here to helpAt BMO we have a shared purpose; we put the customer at the centre of everything we do   helping people is in our DNA. For 200 years we have thought about the future the future of our customers, our communities and our people. We help our customers and our communities by working together, innovating and pushing boundaries to bring them our very best every day. Together we re changing theway people think about a bank.As a member of the BMO team you are valued, respected and heard, and you have more ways to grow and make an impact. We strive to help you make an impact from day one   for yourself and our customers. We ll support you with the tools and resources you need to reach new milestones, as you help our customers reach theirs. From in-depth training and coaching, to manager support and network-building opportunities, we ll help you gain valuable experience, and broaden your skillset.To find out more visit us at https://bmocareers.com .BMO is committed to an inclusive, equitable and accessible workplace. By learning from each other s differences, we gain strength through our people and our perspectives. Accommodations are available on request for candidates taking part in all aspects of the selection process. To request accommodation, please contact your recruiter.Job Data SciencesPrimary Location Canada-Ontario-TorontoOrganisation ERPM-X000073Schedule full-timeJob Posting 04/12/19Unposting Date 06/07/19", "link": "https://ca.indeed.com/viewjob?jk=5c8f35df4cae5cbd&from=serp&vjs=3"},
{"title": "Prochaines occasions   analystes en actuariat principaux, chefs d quipe et scientifiques de donn es", "company": "RSA", "link": "https://ca.indeed.com/viewjob?jk=068b418e9ee93e86&from=serp&vjs=3"},
{"title": "Capital Markets Analytics   VP/Director", "company": "BMO Financial Group", "descr": "The successful candidate will be a self-starting, results-oriented, and highly motivated individual with excellent analytical skills and the ability to independently resolve complex business problems.Support front office traders in their use of risk/P&L platforms.Interact and build relationships with various groups across the firm (trading desks, risk management, middle office, etc.).Aggregating, organizing and analyzing market and trade data to facilitate a wide range of reporting, from high-level business overviews down to trade-level details.Become familiar with in-house financial pricing library.Troubleshoot and solve problems within a very short timeframe.Keep abreast of BMO quantitative framework and front-office pricing developments.Be aware of changing regulatory requirements and related impact to the business.QualificationsKnowledge and SkillsUnder-graduate or graduate degree in a field such as finance, mathematics, statistics or computer science.CFA charter or candidacy an assetProgramming skills an asset, but not required (Python, JavaScript, VBA)Familiarity with database design and queries (Oracle/SQL)Proficient in MS office (excel, word, etc)Able to operate with minimal supervision/directionUnderstanding of financial pricing models and valuation of derivative productsFamiliarity with financial data providers (Bloomberg, Reuters).Solid knowledge of financial theory and risk management concepts.Experience in a capital markets environment, ideally involving interaction with trading floor.Able to exercise independent thought and judgment and adapt to new tasks with little notice.Strong analytical skills and proven problem solver.Excellent communication skills, with the ability to deal effectively with a wide range of colleagues. Ability to obtain cooperation from multiple stakeholder groups and effectively manage conflicts.We re here to helpAt BMO we have a shared purpose; we put the customer at the centre of everything we do   helping people is in our DNA. For 200 years we have thought about the future the future of our customers, our communities and our people. We help our customers and our communities by working together, innovating and pushing boundaries to bring them our very best every day. Together we re changing the way people think about a bank.As a member of the BMO team you are valued, respected and heard, and you have more ways to grow and make an impact. We strive to help you make an impact from day one   for yourself and our customers. We ll support you with the tools and resources you need to reach new milestones, as you help our customers reach theirs. From in-depth training and coaching, to manager support and networkbuilding opportunities, we ll help you gain valuable experience, and broaden your skillset.To find out more visit us at https://bmocareers.com.BMO is committed to an inclusive, equitable and accessible workplace. By learning from each other s differences, we gain strength through our people and our perspectives. Accommodations are available on request for candidates taking part in all aspects of the selection process.#LI-2461460_LI15Job TradingPrimary Location Canada-Ontario-TorontoOrganisation COO Capital Markets-X000018Schedule full-timeJob Posting 03/15/19Unposting Date Ongoing", "link": "https://ca.indeed.com/viewjob?jk=a8c90d07d90ac77d&from=serp&vjs=3"},
{"title": "Director, Performance and Analytics, MRM//McCann", "company": "Worldgroup Careers MWT", "descr": "The Director, Performance and Analytics is responsible for developing data driven strategic recommendations pertinent to branding, social, digital, media, planning, acquisition and optimization. This role will require extensive knowledge of qualitative and quantitative analytics techniques, with the end goal of providing one comprehensive 360-degree view of the customer. This is a hand s on role where the individual will be responsible for accurate analyses and advanced analytics modeling work. The Director, Performance and Analytics is also responsible for developing and cultivating relationships with key team members across the agency such as the strategy, technology, creative and account management teams.As Director, Performance and Analytics, your job duties will include, but will not be limited to, the following activities and responsibilities:Responsibilities:Establishing the objectives for the company s Performance and Analytics division and approving strategic growth strategies that will encourage agency growth and continued lead in the Canadian marketing communications industry;Partnering with the President, CSO, CCO and National Director of Media to develop and deliver Performance and Analytics strategic and business plans;Providing both direct and indirect oversight of data strategy and analytics teams and operations to achieve the division and company s goals;Leading engagement teams and serving as a new business leader that is responsible for identifying, pitching, leading the company through negotiations, and winning new business opportunities;Growth and development of junior team members, who will report to him/her on a project and/or account level basis.Providing oversight, both directly and through middle managers, of all areas within the Marketing Science division including:Return on Market Investment ( ROMI ) measurement, marketing mix modelling and optimization, econometrics, and general modelling projects;Operational analytics, including framework management, process definition, recruitment, and training;Data Infrastructure, Architecture and Management, including systems, Extract, Transform, and Load ( ETL ) data activities, report production and data visualizationIn addition, this is a highly client facing role, with a strong expectation that this individual will also contribute heavily to new business development and the pitching process.Required SkillsQualifications:The successful candidate will have exceptional business acumen and a proven track record of building and leading an advanced analytics offering within the Media landscape, across multiple analytics disciplines. It is critical that this individual has the passion and credibility within the analytics environment and can become actively involved in industry affairs and industry dialogue as a high profile advocate to build and encourage growth within this line of our business.Bachelor s Degree in Statistics, Mathematics, Operations Research, Economics, Computer or a quantitative degree in another social science; Master s degree a plusSeveral years of professional working experience (a minimum of a five) in the marketing and communications8-10+ years of experience in data analysis, media platforms, technology and/or BIDeep experience combining quantitative analytics and qualitative research methodsDeep expertise in model building and/or machine learningCandidates with media or direct marketing background encouraged to applyAs this is a business leadership role and not a traditional account management role, the successful applicant must possess a minimum of three years of experience in an business operations capacity including the management and delivery of strategic growth plans and business administration;Experience in delivering strategic growth plans for multinational clients and international brands is required;Demonstrable experience in ROMI analytics and marketing mix modelling and optimization is required;Experience in multidiscipline analytics, including marketing mix modeling ( MMM ), marketing measurements strategy, and digital media optimization reporting is required;The successful candidate must have P&L management experience and managing a business or essential business function to budget;The successful candidate must have proven experience human resources and talent management including the ability to identify, recruit, inspire, and develop best in class talent;Fluent in agency processes to ensure quality control at all stages of the project;Must be a self-starter who works well in a fast-paced, team-oriented environment;Transparent with a high degree of integrity, self-aware and self-accountable;Result and action oriented, calm under pressure with a resiliency to bounce back quickly from setbacks;Strong managerial courage, decisive and able to make the tough decisions and have the tough conversations with respect and positivity; andMust possess exceptional oral and written communication skills, presentation skills and client relationship building skillsExperience with one or more of the following:PythonSPSSVBAPHPSQL Required ExperienceStrong business acumen.Strong knowledge of marketing analytics, methodologies and platforms.Strong analytical foundation with expert hands on knowledge of advanced statistical techniquesTag management systems, ad serving platformsIntermediate to Expert Knowledge of a leading BI platform such as Tableau, DOMO, MSFT Power BIAbility to translate findings/results into clear, actionable and executable insightsExceptional communication and presentation skills; strong business development skills a plusAT MRM, RELATIONSHIP IS OUR MIDDLE NAME.MRM//McCann is a leading customer relationship agency that leverages the power of creativity, the beauty of data, and the magic of technology to nurture, encourage and sustain strong relationships between brands and their customers   in turn, creating meaningful experiences for people, while driving business results.We employ the most innovative talent in the industry to digitally drive the transformation of our clients  businesses and provide creative solutions to help brands grow meaningful relationships with people.Do you excel when working in a team? Are you fascinated by the endless possibilities that technology brings to marketing? Are you ready to transform our world?If so, you will thrive in our culture based on the Important Things We Believe (I.T.W.B.s):Ideas power everythingWe re Better TogetherWe ll figure it outComplexity can be managedIt only counts if we deliverTechnology is magicMRM//McCann is a leader in Gartner Inc.'s annual  Magic Quadrant for Global Digital Marketing Agencies  report. Gartner Magic Quadrants are based on an exacting methodology where agencies stand out for their strategic services, including business strategy and digital business transformation skills. MRM//McCann is noted for its global vision and strategy, and its use of tools and analytics enabling clients to deliver a measurable business impact as the result of those strategies.NO THIRD PARTY RESUMES ACCEPTED.MRM//McCann is an EEO/AA employer and does not discriminate on the basis of race, color, religion, creed, gender, sexual orientation, age, gender identity, marital status, citizenship, disability, genetic information or veteran status or any other basis prohibited by applicable federal, state, or local law. MRM//McCann participates in e-Verify.If you require reasonable accommodation for any part of the application or hiring process, please submit your request through one of the following methods listed below:a) Dedicated Fax - 917-661-6310b) Dedicated E-mail   Careers@mwgdetroit.comc) US Mail   ATTN: Human Resources, 360 W. Maple Birmingham, MI 48009d) Dedicated Phone   248-203-8000NOTE: Disability accommodation requests only.Required Experience", "link": "https://www.indeed.ca/viewjob?jk=f96b18ffca6a1481&from=serp&vjs=3"},
{"title": "Analyste, titres de cr ance publics", "company": "CPP Investment Board", "descr": "Job DescriptionLe groupe Titres de cr ance publics se concentre sur le d veloppement et la mise en  uvre de strat gies de b ta et d alpha adaptables. L analyste sera charg  d effectuer le suivi d analyses du rendement et des risques de portefeuille, y compris l laboration d outils et d une infrastructure pour y contribuer. La personne travaillera en  troite collaboration avec les gestionnaires de portefeuille pour  laborer des rapports et des outils qui faciliteront la surveillance de portefeuille, la recherche et l laboration de strat gies d op rations. Elle contribuera  galement   couvrir les risques du portefeuille, notamment en recommandant des positions et des op rations de taux d int r t et de change.Responsabilit s du posteRelevant du gestionnaire de portefeuille principal, Titres de cr ance publics, le titulaire du poste est principalement responsable de la surveillance, de la production de rapports et du rapprochement des risques et des profits du portefeuille. L analyste sera un acteur essentiel dans l laboration de l infrastructure des risques et des profits/pertes et du suivi de pond ration du portefeuille en fonction de diverses limites de risque. De plus, il sera responsable de la surveillance de l exposition au taux de change et au taux d int r t du portefeuille et aura la capacit  de recommander des positions alpha en fonction de la recherche et de la confiance. Les principales responsabilit s comprennent : laborer et am liorer des mod les financiers utilis s pour l valuation des produits   revenu fixe et de cr anceCalculs des profits et des pertes, du risque et d autres param tres du bureau de n gociationAider les gestionnaires de portefeuille dans la conception, la mise en  uvre et la surveillance de portefeuilles existantsRep rer et analyser de nouvelles occasions de placement qui g n rent de l alpha dans cette cat gorie d actifEffectuer de fa on constante l optimisation et la refonte des processus de bureau et des outils strat giques pour accro tre l efficacit  du groupe", "link": "https://www.indeed.ca/viewjob?jk=8fb4be4af59e1e72&from=serp&vjs=3"},
{"title": "Manager, Workflow Analytics & Insights (Pharmacy)", "company": "Shoppers Drug Mart", "descr": "Location:243 Consumers Road, Toronto, Ontario, M2J 4W8Take ownership and find more ways to care about our local store owners in a career at Shoppers Drug Mart Central Office / Store Support. Provide great service, specific expertise and actionable advice to support Associate-Owners and their staff in delivering the best health, beauty and convenience services to Canadians.Why this role is important?The incumbent will take a lead role in supporting pharmacy continuous improvement through measurement, analysis, and optimization of the dispensing workflow. As part of the Enterprise Operations Development and Systems organization, your impact will help drive operational excellence across the Shoppers Drug Mart and Loblaw pharmacy network. Reporting to the Director, Pharmacy Workflow Design & Optimization, your combination of strong technical expertise with business acumen will guide the ongoing development of value-adding analytical capabilities and tools. The successful candidate will play a major role in enhancing the data-driven culture in pharmacy, demonstrating strengths in both planning and execution (process analytics, data modeling, and business intelligence reporting) to help meet enterprise objectives.What You'll Do:Build deep understanding of digital and physical dispensing workflow through process analysis, engagement with subject matter experts, and conducting in-store work studiesProvide analytical input to support defining project requirements and workflow design principlesConsult with project and product leads within Pharmacy and Healthcare to understand business challenges, define success metrics, and quantify business case opportunitiesUncover process improvement opportunities, working from problem identification through data collection, analysis, results, and evaluationEnhance scope, quality, and timeliness of internal analytics and KPI measurement tools, building upon existing data platforms and providing input to develop future reporting capabilitiesGuide technical teams to ensure reporting and dashboard systems meet desired outcomes and qualityPromote use of data-driven decision making by presenting key analytical findings and maximizing stakeholder engagementProvide input to the design and development of pharmacy labour model and other resource scheduling toolsLead team members and developers in statistical & data modeling and reporting best practicesWhat You'll Need:5+ years in data and analytical modeling, preferably in an operational improvement or industrial engineering roleUniversity degree (Bachelors or Masters) in engineering, math, computer science, or similar disciplineStrong stakeholder engagement, asking the right questions to understand the complexities of pharmacy operations and business needsDemonstrates high level of ownership and initiative to oversee deliverables and anticipate issuesRobust analytical skills to deep-dive and work hands on with various data sourcesVerbal and visual communication skills to effectively report findings and insights to non-technical audiencesFluent in multiple small to large-scale data analysis and reporting platforms (our tools include SQL, Teradata, R, VBA, Python, MicroStrategy, Power BI)Able to accommodate occasional travel within CanadaWhy work at Shoppers Drug Mart?Acting as consultants, supporting internal customers and the Associate-Owners, you will get experience unique to the retail industry while working for an award-winning national brand. Benefit from a purchase discount program, competitive pay and online learning through SDMU.Take ownership of your work and find more ways to care about your work, co-workers, customers and community.How You ll Succeed:At Shoppers Drug Mart Inc. , we seek great people to continually strengthen our culture. We believe great people model our values, are authentic, build trust and make connections.If that sounds like you, and you are open-minded, responsive to change and up to the challenges provided in a fast-paced retail environment, apply today.Employment Type:Full timeType of Role:RegularShoppers Drug Mart Inc. recognizes Canada's diversity as a source of national pride and strength. We have made it a priority to reflect our nation s evolving diversity in the products we sell, the people we hire, and the culture we create in our organization. Accommodation is available upon request for applicants with disabilities in the recruitment and assessment process and when hired.In addition, we believe that compliance with laws is about doing the right thing. Upholding the law is part of our Code of Conduct   it reinforces what our customers and stakeholders expect of us.Please Note: If you have Employee Self Service (ESS) on Workday, apply to this job via the Workday application.", "link": "https://ca.indeed.com/viewjob?jk=d6b9d15bea1b5400&from=serp&vjs=3"},
{"title": "Upcoming Opportunities   Senior Actuarial Analysts, Team Leads and Data Scientists   Greater Toronto", "company": "Johnson", "link": "https://www.indeed.ca/viewjob?jk=41ab41bb5ff06bb5&from=serp&vjs=3"},
{"title": "Senior Actuarial Analyst", "company": "RGA", "descr": "Position OverviewThe Senior Actuarial Analyst will be part of Global Financial Solutions (GFS) which accounts for over 50% of RGA s consolidated income. The Longevity line of business is both new and one of RGA s fastest growing lines of business with benefit obligations in excess of  40 billion. The Sr. Actuarial Analyst will contribute to the development and implementation of ongoing monitoring processes and tools to ensuring that the Longevity line of business is managed to a standard at least as rigorous as that of RGA s other lines of business.ResponsibilitiesConducting user testing of inforce data extracts on experience analysis and valuation platformsImplementing and maintaining inforce management and risk management processes, including premium vector maintenance activitiesModeling and analysis to monitor financial performance and risk metricsDeveloping, maintaining, reporting, and analysis of collateral models for the block of businessExperience AnalysisPartner with Operations, Valuation and Pricing to perform user testing of experience data extractsPerform mortality experience analysis against various bases using mortality analysis softwareExamines quality of source data and evaluates software output for accuracy and quality, understanding patterns and trends in analyzing the informationActuarial Adjustments to Premiums (Premium Resets)Support the Longevity team in the identification of data changes in the inforce file, revised premium cashflows and the resulting financial settlementReview the proposed data changes to ensure compliance with treaty termsReview the calculation of new monthly premium vectors encompassing the remaining life of the dealReview the retroactive benefit/cost of the changeCollateral Monitoring and ManagementDevelop transaction specific cash flow models in order to estimate current and ongoing collateral needsMaintain and enhance existing models to ensure appropriate model capabilities and controls are in placeCalculate and validate margin calls associated with collateral movementsDevelop collateral projections, sensitivities, and management reportsGain in-depth knowledge of the collateral provisions of each treaty in order to effectively monitor the collateral movement and expectationsAnalyze collateral impacts resulting from changes in underlying data extractsInforce Monitoring and Data AnalysisPartner with peers in Valuation and Operations to support the testing of valuation data extractsDevelop and implement system tools to monitor all aspects of the inforce businessProvide analysis to support communication to executives and senior management groupsPlan Cycle Support and Earnings ReviewSupport development and upload of Plan projections based on given inputs from Corporate GuidanceDevelop systems and analysis to reveal the root causes of deviations from plan and/or from original pricingRequirementsRequired:Passed 4 exams with the Society of Actuaries2+ years relevant experienceUndergraduate degree in related fieldStrong modeling and technical skills, including database applications (Access, Oracle, SQL or equivalent technology), spreadsheets (VBA), statistical programs (R-code or Python) and actuarial software (MoSes, TAS, AXIS, Prophet, or equivalent)Strong analytical and problem solving skillsEffective project management skillsKnowledge of life, health, and/or annuity productsEffective written and verbal communication skills, whereby complex and technical information can be conveyed in a way that is meaningful by all stakeholdersEffective interpersonal skills, demonstrating the ability to work effectively with different stakeholders and disciplines across the company, including local offices, pricing, finance, valuation, investments, administration as well as external vendorsAbility to work independently as well as within a team environmentAbility to anticipate future needs; be proactive and adjust to constant changeStrong time management skills and ability to manage multiple priorities, while dealing with ambiguity.Strong service and results orientation and a drive to make a differencePreferred:ASA designation with the Society of ActuariesPrevious reinsurance experiencePrevious experience with pensionsCompany OverviewReinsurance Group of America, Incorporated (NYSE: RGA) is a leader in the global life reinsurance industry with approximately $2.9 trillion of life reinsurance in force and assets of $44.7 billion. We are one of the largest life reinsurance companies in the world.#LI-OJ1Job Reference: CN00588", "link": "https://www.indeed.ca/viewjob?jk=f9d3734e82329a6f&from=serp&vjs=3"},
{"title": "Upcoming Opportunities   Senior Actuarial Analysts, Team Leads and Data Scientists   Greater Toronto", "company": "RSA", "link": "https://ca.indeed.com/viewjob?jk=bfa0f63459b7706a&from=serp&vjs=3"},
{"title": "Senior Pricing Actuary", "company": "Everest Re Group, Ltd.", "descr": "Everest Insurance Company of Canada, a member of the Everest Re Group, Ltd. is currently recruiting for a Senior Pricing Actuary to be located in Toronto. This is an exciting opportunity to play a key frontline role in providing production pricing support for Everest Insurance s Canada operations. Line of businesses include GL, Umbrella, Inland Marine and Property.Responsibilities will include:Portfolio price and risk monitoring;Enhancement of rating models and parameters;Planning and portfolio strategy, including account segmentation and property cat management;Involvement in ceded reinsurance submissions, evaluation and strategy;Evaluation of new program opportunities;Large and complex account pricing referrals;Support for supplemental Canadian regulatory filingsQualifications:10-15 years of experience in the property-casualty insurance industry with significant commercial lines pricing experienceAnywhere from 5 exams to recent FCIAEnjoys fostering collaborative relationships with underwriting teamsFlexible and responsive to dynamic business needs including tight turnaround times and limited dataComfortable with autonomy, responsibility and visibilityExcel expertise a must.Proficiency in at least one of the following is a plus: SQL or MS Access, Excel VBA, Power BI, R, SAS, PythonEverest is committed to recruiting and retaining the most talented individuals in the industry. We offer a dynamic work environment and a competitive compensation and benefit package which includes a 401k plan, retirement/savings option, tuition reimbursement, medical, dental, vision, life and group legal plans.Everest is an equal opportunity employer. All qualified applicants will receive consideration for employment without regard to race, color, religion or creed, sex (including pregnancy), sexual orientation, gender identity or expression, national origin or ancestry, citizenship, genetics, physical or mental disability, age, marital status, civil union status, family or parental status, veteran status, or any other characteristic protected by law.", "link": "https://ca.indeed.com/viewjob?jk=8459a9bd1bc8bfef&from=serp&vjs=3"},
{"title": "Data Scientist / Sr. Data Scientist", "company": "Manulife", "descr": "Are you looking for unlimited opportunities to develop and succeed? With work that challenges and makes a difference, within a flexible and supportive environment, we can help our customers achieve their dreams and aspirations.Job DescriptionGeneral Accountability:This position is accountable for the development and implementation of advanced analytic models to improve business process, and to generate insight in order to support the strategy & goals of Group Functions. This position will provide analytics thought leadership, coaching to the Data Scientists & Analysts and support the development of the capabilities of the team. Additional responsibilities include the development of documentation & measurement framework.Responsibilities:Develop & implement models to support Group Functions strategy and business pillar initiativesDevelop advanced analytics models in order to maximize ROI, revenue and overall profitability.Perform needs analysis with business area (understand business problem & generate hypotheses)Explore, generate & source data relevant to the hypothesis(internal, external, 3rd party)Create, assess, evaluate & Iteratively improve modelsCalculate model impact/ROIPeer review other Data scientists workLeverage sound judgment, balancing analysis effort vs incremental improvementMeasure & communicate analytic results & impact of analytics modelsImplement measurement & documentation framework against all project workGenerate insights in such a way that the businesses can clearly understand the quantifiable value. Enable the business to make clear trade-offs between and among choices, with a reasonable view into the most likely outcomes of each.Turn statistical and computational analysis into user-friendly graphs, charts, and animation. Enable those who aren t professional data analysts to effectively interpret data. Ability to communicate results and educate others through reports and presentationsProvide thought leadership around analytics methodology, tools, and measurementLeverage extensive theoretical and practical knowledge of advanced analytic methods and algorithms, understanding their utility in different problem domains (sparse data, rare event detection, etc), evaluation methodologies and pitfalls, and stays on top of industry & academic developments.Innovate & find creative ways to source & leverage data to support modeling efforts, leveraging structured & unstructured data, and big data technologies.Collaborate with internal stakeholders to develop tools and services such as modeling, dashboard development, decision aids and business case analysis to drive innovation, strategic initiatives and recommend solutions.Coach & provide guidance to Data Scientists & Data AnalystsLeverage depth of experience in business, technical & analytical problem solving to support & coach other team members.Qualifications:Post grad in Statistics, Math, Comp Sci, Engineering or other related discipline (PhD preferred)Minimum of 10 years' experience specifically in statistical/data analysis and data mining, predictive modeling, cluster analysis, optimizationAdvanced Experience in Python, R, SAS, SQL, Java, , VBATrack of record of delivering innovative analytical insights to lines of businessesStrong commitment to organizational success and team workAdaptable and open to change with strong collaboration and elaboration skillsDemonstrated data transformation & manipulation experienceStrong Knowledge of strategic marketing, data, audience targeting, segmentation, and customer analysis. Familiarity of vendors that operate in this spaceInsurance or Financial Services industry experience preferred.Demonstrated experience exhibiting innovation and leadership in proposing new strategies and/or tactics based on analysis findingsExperience with Big Data platforms desiredExperience with analysis of unstructured data desiredIf you are ready to unleash your potential it s time to start your career with Manulife/John Hancock.About ManulifeManulife Financial Corporation is a leading international financial services group that helps people achieve their dreams and aspirations by putting customers' needs first and providing the right advice and solutions. We operate as John Hancock in the United States and Manulife elsewhere. We provide financial advice, insurance, as well as wealth and asset management solutions for individuals, groups and institutions. At the end of 2016, we had approximately 35,000 employees, 70,000 agents, and thousands of distribution partners, serving more than 22 million customers. At the end of 2016, we had $977 billion (US$728 billion) in assets under management and administration, and in the previous 12 months we made almost $26 billion in payments to our customers.Our principal operations are in Asia, Canada and the United States where we have served customers for more than 100 years. With our global headquarters in Toronto, Canada, we trade as 'MFC' on the Toronto, New York, and the Philippine stock exchanges and under '945' in Hong Kong.Manulife is committed to supporting a culture of diversity and accessibility across the organization. It is our priority to remove barriers to provide equal access to employment. A Human Resources representative will consult with applicants contacted to participate at any stage of the recruitment process who request an accommodation. Information received regarding the accommodation needs of applicants will be addressed confidentially.", "link": "https://ca.indeed.com/viewjob?jk=e5ec98e98da8a515&from=serp&vjs=3"},
{"title": "Manager, Credit Risk Analytics", "company": "Scotiabank", "descr": "Requisition ID: 58564Join the Global Community of Scotiabankers to help customers become better off.The Manager takes initiatives to evaluate and improve the IFRS 9 Expected Credit Loss (ECL) models and Provision for Credit Loss (PCL) measures. This role primarily involves code development work around the ECL calculation as well as working with different stakeholders to determine new and changing requirements. There is also work associated to validating and analyzing the metrics produced and the cause for the changes.Key Accountabilities:Maintain and improve upon the IFRS9 ECL ecosystem, including production process, Web UI application, analytics and reporting functionsWork with the Information Technology & Support (IT&S) team to implement and improve ECL methodology in the production environment and ensure seamless production process each quarter.Work with IT&S for automation in the IFRS 9 parallel year, production and strategic states. This includes reporting automation, data flow infrastructure and security controlsWork with key stakeholders in developing the IFRS 9 end-to-end process, which includes project planning, data reconciliation, model implementation, control process, governance and reporting.Collaborate with internal stakeholders such as Internal Ratings Management, Enterprise Stress Testing, Information Technology & Systems (IT&S) business lines, and Enterprise Risk Management for methodology improvement to ECL and capital. Apply specialized knowledge of Expected credit loss methodology, in ECL analytics and implementation. Assist the internal and external ECL reporting and disclosure.Ensure compliance with relevant internal policies, procedures and regulatory requirements. Manage timely resolution of audit and regulatory issues.EDUCATION/WORK EXPERIENCE/DESIGNATIONS:Quantitative educational background: Math, Finance, Physics, or other quantitative areasPreferred work experience: 3 years + of relevant analytical work experience; familiar with Git, Bitbucket/GitHub, JIRA; prior experience with Power BI, Tableau etc.Knowledge in regulatory capital requirements, credit product knowledge and capital modelingTechnical capacity: strong programming skills in SQL, VBA, Python and R.Comfort and experience working in a project context and juggling multiple competing prioritiesStrong organizational and analytical skills.Critical thinking skills and ability to work under tight timelines.Good verbal and written communication skills and proven problem solving skillsLocation(s): Canada : Ontario : TorontoAs Canada s International Bank, we are a leader when it comes to inclusion. We are a diverse and global team, speaking more than 100 languages with backgrounds from more than 120 countries. We value the unique skills and experiences each individual brings to the bank, and are committed to creating and maintaining an inclusive and accessible environment for everyone. Candidates selected for an interview will be contacted directly. If you require accommodation during the recruitment and selection process, please let us know. We will work with you to provide as seamless a recruitment experience as possible.", "link": "https://ca.indeed.com/viewjob?jk=278a61358232a4b8&from=serp&vjs=3"},
{"title": "MES", "company": "Grantek Systems Integration", "descr": "Job DescriptionAs a key member of Grantek s Engineering team, you will be focused on the design, implementation and deployment of Manufacturing Execution System (MES) solutions, using a variety of software tools. You will also be a vital link in Grantek s Smart Manufacturing practice, translating user requirements and customer business needs into fully-traceable and scalable MES solutions.Grantek will leverage your extensive industry knowledge and deep experience developing MES solutions to provide crucial support to our customers and their project needs, which are often global or continental in scope. Multi-site rollouts are commonplace, as Grantek s clients see us as trusted partners, and we hold these relationships sacred.Your in-depth knowledge and experience working within the pharmaceutical, food & beverage, and consumer packaged goods industry verticals, including the unique challenges and regulatory requirements therein, along with your ability to guide and mentor a small team of MES professionals will bolster our ever-growing Engineering team.Key-skills and interests: ANSI/ISA-95, ANSI/ISA-88, OEE downtime tracking and production scheduling, traceability and production tracking, statistical process control (SPC), recipe management and batch execution, enterprise resource planning (ERP) integration, high-level programming, information solutions, operational efficiency.Primary Job Responsibilities:Architecting, implementing, and integrating solutions focused around tracking, analyzing, and improving the manufacturing processDesigning and implementing data management strategies for the integration of MES solutions with our customers  ERP software and plant automation equipmentConceptualizing solutions during the design phase of the project life cycleManufacturing execution system configuration, programming, debugging, and testingCreating documentation, including project engineering notes, project proposals, project design traceability documentation, case studies, and moreCommissioning innovative solutions for our world-class customer base; finding, sharing and capitalizing on opportunities for improvementCreating methodologies and performing complex problem-solvingLearning new technologiesMentoring colleagues on your expertise and knowledge baseHaving fun and being challengedTechnologies Used:ERP Platforms: SAP, Microsoft Dynamics, etc.MES Platforms: Sepasoft MES, Werum PAS-X, Rockwell FactoryTalk Application Suites (CPG Suite, PharmaSuite), etc.SCADA Platforms: Rockwell, Inductive Automation, Wonderware, GE, Siemens, etc.High-level Programming: Python, JAVA, .NET, HTML5, SQL, VBA, etc.Database Platforms: Microsoft, Oracle, etc.Operating Systems: Microsoft (current and legacy to NT), Unix, Linux, etc.Project Documentation: Microsoft Office", "link": "https://ca.indeed.com/viewjob?jk=fd44a815806ef2e7&from=serp&vjs=3"},
{"title": "Senior Specialist, Process Innovation", "company": "Samsung Electronics", "descr": "Position SummaryThe Senior Specialist in Process Innovation will review all operations and processes related to Retail, sales, Supply Chain Management (SCM), Logistics, Finance and Service to identify areas of improvement, develop action/project plans to address and follow through to implementation. This person will focus on value added projects to optimize the functional processes and the operational systems utilizing data driven analytics. The position will be a key liaison between Sales & Marketing, SCM, Logistics, Business Operations Center (BOC), Information Technology (MIS), Finance and Service and will interact with Samsung Corporate Headquarters(HQ), North American Headquarters (NAHQ), Samsung sister companies such as Samsung SDS, External Customers and 3rd party Vendors on projects they lead.Role and ResponsibilitiesEssential Duties and Responsibilities:Responsible for the development of new Process Innovation Projects related to operation optimization and process efficiency and ensuring successful delivery of projects: Project PlanEnsures execution of projects developedResponsible to establish timelines, ownership, key milestones and to follow-up with stakeholders on all deliverablesResponsible to monitor project execution and develops follow-up plan in case change/improvement are required based on the feedbackResponsible for the adoption and coordination of new operational process or system changes ensuring alignment to HQ guidelinesResponsible to resolve escalations through interaction with all levels within Sales and Marketing, SCM, Logistics, BOC, Finance and Service to ensure that needs are identified and immediate resolution found for critical SCM operational barriersCoordination of required System/process implementationTraining for new Process or functional system delivered by projectImplementing a robust KPI monitoring system at Project end to measure short/long term resultsResponsible to present strategic ideas to executives, tactical plans to managers and operational tasks to employees in addition to gaining consensus from all levels of the organizationReview and Coordinate the updates of new policies and procedures in GPPMKnowledge:Education focused on a technical discipline is an asset (Computer Science, Engineering, etc)Expert Knowledge of Business Systems (SAP required, SFDC an asset)MS Office suite required, Strong Excel VBA, SQL an asset, R and Python an assetAbility to evaluate and analyze complex systems data and determine appropriate actionsStrong interpersonal skills with the ability to influence without authorityAdvanced in Microsoft Office (Excel, Access, PowerPoint, Visio, Word, Outlook),Experience:Project Management experience required (PMP an asset)Lean Six Sigma experience an Asset3-5 years of work related experience supply chain processes and/or retail channel within electronics industryCompetencies:Strong Data analysisThe ability to develop and maintain excellent working relationships with multiple levels within and outside the company. Must be able to influence others in acceptance, approval, and providing project description.The ability to plan, organize, and prioritize multiple assignments and projects.The ability to work in a team environment to identify and achieve team project goals and results, including the completion of assignments within established time frames.Demonstrated ability to Interact with all levels within the organizationStrong interpersonal and analytical skillsSkills and QualificationsSamsung is an equal employment opportunity employer.Samsung has an accommodation process in place and provides accommodations for job applicants with disabilities as appropriate. Assessment and selection materials and procedures can be made available in accessible formats and methods as appropriate. If you require a specific accommodation because of disability or medical need, please let us know when selected to take part in our recruitment process so that reasonable arrangements can be made for the appropriate accommodations to be in place as you move through our process.We thank you for your interest in working for Samsung. Only candidates selected for an interview will be contacted.#LI-DJ1#indhigh* Please visit Samsung membership to see Privacy Policy, which defaults according to your location. You can change Country/Language at the bottom of the page. If you are European Economic Resident, please click here .", "link": "https://ca.indeed.com/viewjob?jk=4e4071e6212274dd&from=serp&vjs=3"},
{"title": "Actuarial Analyst - Commercial Pricing", "company": "CNS", "link": "https://ca.indeed.com/viewjob?jk=e1300a4a7665f0de&from=serp&vjs=3"},
{"title": "Actuarial Analyst - Commercial Pricing", "company": "RSA", "link": "https://ca.indeed.com/viewjob?jk=ed335ce1e0b39e58&from=serp&vjs=3"},
{"title": "Senior Credit Risk Analyst", "company": "Rogers Communications", "descr": "At Rogers, we connect Canadians to a world of possibilities and the memorable moments that matter most in their lives. Every day we wake up with one purpose in mind. To bring loved ones together from across the globe. To connect people to each other and the world around them. To help an entrepreneur realize her dream. A sports fan celebrate a special moment.Because we believe connections unite us, possibilities fuels us, and moments define us.The Senior Credit Risk Analyst will utilize data mining techniques to optimize risk and reward of Rogers Bank Credit Card products.Responsibilities will include:Credit loss forecasting, planning, and procedures specific to IFRS9 Expected Credit Loss (ECL) methodologyExecute credit risk account-management programs as requiredCollaborate on the development of credit risk models including validation, documentation, and performance trackingIdentify patterns and trends associated with multiple risk lifecycle strategies including origination, account management and collectionsReview and develop existing and new customer risk segments and identify risk factors using statistical modelling techniquesQuantify impact in key revenue and loss metrics resulting from potential/actual changes to risk strategy and processProvide recommendations to improve and optimize portfolio performance from a risk strategy and risk process perspectiveSummarize and communicate results of findings to different audiences with various levels of technical and business backgroundMaintain and develop reports to evaluate key metricsCollaborate with the design of champion-challenger strategies, test case design, implementation and monitoringContribute to execution of strategic cross-functional/organizational (client relationship, marketing, credit risk, operations) initiativesRequired Qualifications:Bachelor degree in Mathematics, Statistics, Business, Finance, Economics or equivalent quantitative field2-4 years working within the consumer finance / credit card environment is preferredIdeal candidate would have experience in IFRS9 principles, and implementationData analysis skills must include 3-5 years of experience using statistical programs such as SAS, Knowledge Studio, Enterprise Miner, Python or RStrong analytical and statistical knowledge with an ability to combine quantitative and common-sense problem solving skillsHighly proficient with the use of database querying tools such as SQLHighly proficient with Microsoft office applications - advanced Excel (knowledge of macros-VBA and pivot tables)Effective communication (written and verbal) and time management requiredSelf-starter, able to manage and prioritize multiple complex tasks with minimum supervision and strong attention to detailDesire to learn and succeed in a challenging fast-paced environmentonSchedule: Full timeShift: DayLength of Contract: Not Applicable (Regular Position)Work Location: 350 Bloor Street East (299), Toronto, ONTravel Requirements: NonePosting Category/Function: Finance & Accounting & Enterprise Risk ManagementRequisition ID: 137542Together, we'll make more possible, and these six shared values guide and define our work:Our people are at the heart of our successOur customers come first. They inspire everything we doWe do what s right, each and every dayWe believe in the power of new ideasWe work as one team, with one visionWe give back to our communities and protect our environmentWhat makes us different makes us stronger. Rogers has a strong commitment to diversity and inclusion. Everyone who applies for a job will be considered. We recognize the business value in creating a workplace where each team member has the tools to reach their full potential. At Rogers, we value the insights and innovation that diverse teams bring to work. We work with our candidates with disabilities throughout the recruitment process to ensure that they have what they need to be at their best. Please reach out to our recruiters and hiring managers to begin a conversation about how we can ensure that you deliver your best work. You can also reach out to our team at RogersRecruiting@rci.rogers.com to begin a conversation about your individual accessibility needs throughout the hiring process.Posting Notes: [[req_strategyPage]]", "link": "https://ca.indeed.com/viewjob?jk=9d8afe5070e307c8&from=serp&vjs=3"},
{"title": "Software Engineer II", "company": "LoyaltyOne", "descr": "Why Work with Us Are you passionate about Data and Reporting?As part of Member Experience Reporting team, the Software Engineer will play a critical role in making Member Experience data available in Data Hub and providing reports and insights that will help drive business decisions.What you ll do Create pipelines in databricks to transfer data to Data HubSupport other departments by producing self-serve reports / dashboards in Tableau to drive resultsConduct analysis and deliver key insights to address business problems or understand underlying trends to help evolve business strategies or in support of new programs or initiativesPrepare high-quality reports and presentations targeted for specific audiencesProactively highlight opportunities to develop and/or enhance existing tools and processesQualification:Who you are Post-secondary education with 1-2 years IT Application Development ExperienceAdvanced experience using Python, databricks Spark, SQL and ExcelProficient experience with Word, MS Access (VBA programming), PowerPoint and relational databases (Oracle)Familiarity with data warehouse and AWS (data lake) conceptsKnowledge of key call center metrics/reporting and call center applications is an assetSolid analytical, logical and problem-solving skillsStrong project management skills, with the ability to organize and prioritize multiple projects, competing requests and multiple tasks in a deadline-driven environmentStrong written and oral communication skillsWork independently in a fast-paced dynamic environmentPossess an excellent work ethic and be self-motivatedMust be able to travel between offices as necessaryRequirement to work non-core hours from time-to-time (e.g. during application launch)Reports are used for decision making purposes, therefore accuracy and the ability to meet timelines is crucial to the businessAbout LoyaltyOneLoyaltyOne is part of the successful Alliance Data family of companies that provide the full range of data-driven loyalty, marketing and credit solutions in more than 80 locations across the globe.Working with more than 100 leading brands in the retail, financial services, grocery, petroleum retail, travel and hospitality industries to profitably change customer behavior. Through a team of businesses, including one of the leading coalition loyalty programs in the world, the AIR MILES  Reward Program, LoyaltyOne designs, delivers and manages a suite of services focused on consumer data, customer-centric retail strategies, direct-to-consumer marketing, loyalty consulting and more.LoyaltyOne has broadened its horizons geographically by growing Precima in the European market. With the recent acquisition of BrandLoyalty in the Netherlands, LoyaltyOne has gained the expertise of a global leader in short-term loyalty campaigns, along with a client network that extends throughout Europe and Asia.About ADSAlliance Data  (NYSE: ADS) is a leading global provider of data-driven marketing and loyalty solutions serving large, consumer-based industries. The Company creates and deploys customized solutions, enhancing the critical customer marketing experience; the result is measurably changing consumer behavior while driving business growth and profitability for some of today's most recognizable brands. Alliance Data helps its clients create and increase customer loyalty through solutions that engage millions of customers each day across multiple touch points using traditional, digital, mobile and emerging technologies. An S&P 500 and Fortune 500 company headquartered in Plano, Texas, Alliance Data consists of three businesses that together employ more than 16,000 associates at approximately 100 locations worldwide. www.alliancedata.comAlliance Data is an Equal Employment Opportunity employer. Accordingly, we will make reasonable accommodations to respond to the needs of people with disabilities in accordance with legislation.Alliance Data participates in E-Verify.Check us out   LoyaltyOne on Stack Overflow | LinkedIn | Glassdoor | Facebook |Twitter | Blog | Instagram", "link": "https://ca.indeed.com/viewjob?jk=1d23c7d2e7278485&from=serp&vjs=3"},
{"title": "Senior Financial Analyst II", "company": "Staples", "descr": "DescriptionAbout UsStaples Advantage is the contract business-to-business division of Staples, working with companies of 20 or more employees to develop customized programs with specialized pricing, dedicated account management, and a complete assortment of products and services at a low total delivered cost. In addition to a complete selection of office products, Staples Advantage offers: Business Interiors by Staples, Staples Technology Solutions, Staples Facility Solutions, Staples Print Solutions and Staples Promotional Products.We offer competitive wages along with a comprehensive benefits package including medical, dental, vision, vacation, sick pay, company RRSP/DPSP and much more.Terms of employment: Full-time, PermanentLanguage of work: The work will be performed in EnglishWork location: 550 Pendant Dr. Mississauga, ON L5T 2W6Salary Range: $97 500Position Summary:The Senior Financial Analyst for Financial Planning & Analysis will be a key member of the Supply Chain Finance team dedicated to providing analytical support and business insights for the $10B+ in revenue North American Delivery business as well as the US Retail business. This role will work directly with the supply chain leaders across several locations to help drive deeper understandings of logistics trends and performance, as well as, ensure businesses are performing in line with short and long-term objectives. Analyses performed by this role will influence decisions impacting spend and strategy across both NAD & USR business units.Job Duties:Work with leaders to prepare full year comprehensive budget for supply chain operating expenses and capital.Review budget proposals and make forecasts for future budget needs.Manage weekly/monthly/annual financial processes pertaining to actual results, forecasted and budgeted expectations. Identify and explain variances on a regular basis.Perform tracking of routine period end close functionalities including but not limited to P&L consolidation, accrual tracking and reconciliation with general ledger.Track expenses across multiple cost centers and take recommended action to stay within the budget.Understand risk and opportunities to plans using sensitivity analysis and simulations.Be adept at manipulating, analyzing and presenting findings around big, complex data set.Partner with leadership to identify key business trends and provide supportive analytics that drive and influence business performanceLeverage technology-based forecasting techniques to provide expense forecast for the Staples supply chain across U.S. and Canada.Prepare robust and scalable models using advanced excel mathematical and financial functions.Think analytically, be able to drill into the detail but understand its relevance to the big picture and disseminate key insights.Train and support team members to use data visualization tools such as PowerBI and TableauMaintain databases housed within Microsoft Access and PostgreSQL database used to compile financial data from multiple sources.QualificationsEducation/Work Experience RequiredBachelor s degree in Information Technology.Post-graduation degree with a specialization in Finance.At least 2 years of full-time/part-time work experience in financial analysis, planning, forecasting and reporting.Candidates with CFA certification or pursuing CFA preferred.1 or more years  experience synthesizing large amounts of data and providing meaningful, insightful analysis to senior management.1 or more years  experience in using SQL.Candidates with SQL related certifications preferred.Ability to work well both independently and as part of a team.Organized, self-starter who can prioritize and manage multiple tasks to effectively meet deadlines and objectives in a changing environmentAbility to use data to make recommendations and drive decisions, relying on strong qualitative and quantitative skillsDriven intellectual curiosity to explore trends and variances to understand root causeAdvanced understanding of Microsoft Office products such as Excel and Access and Microsoft Azure.Ability to use Microsoft PowerBI, Oracle Essbase and MicroStrategy.Excellent oral and written communication skills and must be comfortable interacting with and presenting to senior managementAbility to actively engage and partner with various leadership team members to drive results and provide needed analysis.Ability to write scripts in Python and SQL/PostgreSQL and VBA is a plus.Staples is committed to providing accommodation to people with disabilities throughout the job application and interview process to the point of undue hardship. If you require an accommodation during the application or interview process, please contact a Customer Care Representative at 1-866-782-7537.Staples is an equal opportunity employer and an accommodation will be provided during the hiring process if requested.", "link": "https://ca.indeed.com/viewjob?jk=9909afe6942277af&from=serp&vjs=3"},
{"title": "Senior Actuarial Analyst", "company": "RGA Reinsurance Company", "link": "https://www.indeed.ca/cmp/RGA-Reinsurance-Company/jobs/Senior-Actuarial-Analyst-8c3bdafab50f18df?vjs=3"},
{"title": "Manager   Business Modelling", "company": "EY", "descr": "Canada TAS, Modelling ManagerCompetitive business today is all about making intelligent, informed decisions. As a Modelling Manager you ll help make that happen. You will be an important part of our diversely talented, highly experienced team and work at the forefront of high-profile transactions and strategic decisions. Our team of advisors sits at the heart of a global Valuation, Modelling and Economics (VME) network of specialists who deliver high quality advice to our clients. Recognized as one of Canada s top employers, EY continually strives to be a great place to work.The opportunityEY has an established industry leading VME group of over 1,500 people worldwide. We advise our clients on strategic financial decisions including buy vs build, strategic options, deal structure, predictive analytics. You will have the opportunity to develop your career through a broad scope of engagements, mentoring and formal learning. That s how we develop outstanding leaders who team to deliver on our promises to all our stakeholders, and in so doing, play a critical role in building a better working world for our people, for our clients and for our communities.", "link": "https://ca.indeed.com/viewjob?jk=865ba9c7d6a7a431&from=serp&vjs=3"},
{"title": "Senior Data Analyst - Lifecycle", "company": "FreshBooks", "link": "https://www.indeed.ca/viewjob?jk=637db44a14d01aa4&from=serp&vjs=3"},
{"title": "Senior Financial Analyst, FP&A", "company": "The Finance Department Limited", "descr": "Industry: RetailEducation: CPA-CGA, CMA, CA, MBA, CFA or student pursuing designationCompensation: $70-80KOverview:The Finance Department Limited (TFDL) specializes in the Strategic Placement of Accounting & Finance Professionals on a Contract or Permanent basis. For 20 years, TFDL has been successfully servicing a select group of clients, providing them with the best Intermediate-to-Senior level talent in the industry. (BMH3xU1)Our client, a high end Retail organization is seeking a driven Financial Analyst to support their growing, exciting organization. This is an excellent opportunity for both a candidate with a tradition FP&A educational background in accounting and finance or individuals that come from a technical background in programming or engineering. Advancement opportunities are available for individuals that can prove their value to the organization.Responsibilities:Financial Planning and Analysis, including budgeting, forecasting and KPIsSophisticated financial model construction in ExcelMonthly and quarterly management reporting, including explaining and communicating business trends to senior managementBusiness and Cash ForecastingVariance and trend analysis, including in support of the Month-End Close processAd-hoc analysisQualifications:CPA - CA, CMA, CGA or CFA, MBA is a plusUniversity degree (Business, Economics, Engineering or Computer Science)2-5 years of relevant experienceAccounting experience - familiarity with financial statements, accounting rules, accounting entries, accounting data systems and charts of accountsFinance knowledge   Understanding of business concepts related to trends and drivers affecting revenues, profits, and expenses, loans, interest, return on investment, basicTreasury analyst experience is an assetAdvanced Excel is required which includes macros / VBA. SQL or any programming experience is an strong asset (Python or R)Must be able to think through complex problemsA demonstrated ability to interact with people at all levels within an organizationA results oriented, team player that can also work independently and take responsibility for own actionsStrong communication skills (verbal and written)", "link": "https://ca.indeed.com/viewjob?jk=9d96fcaca43a2cbc&from=serp&vjs=3"},
{"title": "Senior Analyst - Fixed Income, Currencies, and Commodities, P & L/PAA", "company": "BMO Financial Group", "descr": "Who We AreThe Global Middle Office is the first line of defence, and the go-to team for our Trading Products, Capital Markets business partners. Our broad mandate includes: Profit & Loss and Profit Attribution Reporting & Analysis; Trade Desk Support; Product Control; Collateral Management; Data Governance, Reporting & Analytics; and everything in-between.We are a group of Finance professionals, where our collective experiences are as diverse as our mandate. We work hard, and are always ready to tackle the next opportunity. We do not shy away from challenging the status quo and always promote best practices, often leading the charge across all initiatives.About the RoleYou will be responsible for the accurate, complete, and timely generation of daily and monthly P&L (Profit & Loss) and PAA (Profit Attribution and Analysis) reporting. The role requires specialized business and valuation skills in order to provide transparency, obtain concurrence, and provide quality analytics of P&L for the Capital Markets and Corporate Treasury trading businesses, while acting as the key escalation point for the P&L reconciliations process. The role requires the application of in-depth product knowledge, trade flow reconciliation, and profit attribution knowledge to ensure consistency and effectiveness of drilling down of the P&L drivers to support Capital Markets and Corporate Treasury trading businesses.You are accountable for developing and executing against department goals and personal objectives while partnering with internal business partners (e.g. Global Middle Office, Market Risk, Finance, Technology, Operations, Pricing, Accounting) to meet service delivery expectations at the operational level.You will provide professional / technical advice as the subject matter expert to internal business partners and Product Operations colleagues on the P&L reporting process. We will rely on you to manage the quality and continuous improvement of existing standards, processes, and policies.Who You AreYou are an eager self-starter with an impeccable attention to detail who feels a personal sense of responsibility for getting the job done right the first time. You are an active communicator who can clearly and effectively tailor your message for the right audience, while bringing together large groups with a deep understanding of the roles of all involved parties in order to meet a target goal. You excel in an environment where problem-solving becomes second-nature and you can dive into problems to understand their root cause, while offering solutions within the risk appetite of the group. You have a knack for data, and have the ability to tell a story with numbers. You know how to present complex financial information in easily digestible formats.Why Us?The Global Middle Office is a high-demand area as we offer our team members with a collaborative, high-energy work environment that welcomes diverse backgrounds and experiences. You are provided with the autonomy to explore your areas of interest in a meaningful way. The breadth of our mandate and our cultural motivation to spearhead initiatives will get you involved in the processes of numerous areas within the bank, naturally exposing you to differing viewpoints and objectives. We offer numerous areas for growth including a constant supply for your endless thirst for learning, as well as through upward mobility opportunities. We pride ourselves in our work ethic and constant desire to improve, replicate, and iterate.If you want to join this group of extremely talented people, we welcome your application. Though we thank all candidates for their time and consideration, we will only contact those selected for an interviewQualificationsKnowledge and Skills:At a minimum, you hold a Bachelor s degree in a related field. You are a product expert in the areas of fixed income, and other interest and credit related hedging instruments including swaps, futures, and options. The  Senior  in your working title brings with you a commensurate amount of experience (3-5 years) from a related field where you demonstrated expertise in the areas of P&L, Risk Reporting, Trade Support, Accounting, Finance, Trading, or other operational areas in support of the trade lifecycle. It also means you have a willingness to take the lead on projects, processes, and people; and are comfortable acting in a leadership capacity. You remain professional under pressure and demonstrate responsible decision-making in ways that create additional value. You build effective relationships and are able to collaborate with peers, management, and business partners. You communicate openly, share ideas, and provide timely feedback.Other nice-to-have s include a post-graduate degree in a related discipline (or equivalent work-experience), and programming capabilities (SQL/VBA/Python).We re here to helpAt BMO we have a shared purpose; we put the customer at the centre of everything we do   helping people is in our DNA. For 200 years we have thought about the future the future of our customers, our communities and our people. We help our customers and our communities by working together, innovating and pushing boundaries to bring them our very best every day. Together we re changing theway people think about a bank.As a member of the BMO team you are valued, respected and heard, and you have more ways to grow and make an impact. We strive to help you make an impact from day one   for yourself and our customers. We ll support you with the tools and resources you need to reach new milestones, as you help our customers reach theirs. From in-depth training and coaching, to manager support and network-building opportunities, we ll help you gain valuable experience, and broaden your skillset.To find out more visit us at https://bmocareers.com .BMO is committed to an inclusive, equitable and accessible workplace. By learning from each other s differences, we gain strength through our people and our perspectives. Accommodations are available on request for candidates taking part in all aspects of the selection process. To request accommodation, please contact your recruiter.Job Finance & AccountingPrimary Location Canada-Ontario-TorontoOrganisation CIOO CM & US CTOO-X000070Schedule full-timeJob Posting 04/08/19Unposting Date 05/01/19", "link": "https://ca.indeed.com/viewjob?jk=8beae170860b6eae&from=serp&vjs=3"},
{"title": "Manager, Internal Capital and Credit Analytics", "company": "Scotiabank", "descr": "Requisition ID: 59728Join the Global Community of Scotiabankers to help customers become better off.PURPOSE:The Manager takes initiatives to evaluate and improve internal capital methodologies for more effective capital measures and better tools for business decision and capital management. This role primarily involves the development and production work around internal capital analytics and measurement. There is also work associated to validating and analyzing the metrics produced and the cause for the changes.KEY ACCOUNTABILITIES:Implement changes on credit risk capital models for both retail and non-retail portfolios. Assist the production of all regular and  on demand  deliverables for internal clients, including E.O. Finance, GBM Loan Portfolio Management, GBM Client Measurement, and GRM Executives.Provide support to business lines on capital methodology and contribute to their business growth. Explain, seek feedback and provide diagnostics and analytical supports to allow business to use capital more efficiently.Support the design and implementation of capital production initiatives and projects. This involves collaborating with other stakeholders such as technology and modeling teams.Provide ongoing support pertaining to credit capital, losses, ROEE/RORC, and active portfolio management for various Bank departments. Provide analytics and solutions on credit risk related issues of specific interest to Executive and Senior Management.Implementation of stress testing for credit risk capital on a quarterly basis and as part of Enterprise Wide Stress Testing (EWST).Contribute to business growth by providing independent capital analysis for one off transactions or transactions proposed to reduce risk and capital.Develop and maintain the documentation of capital models. Review and evaluate technical implementation, results, and functional credit capital documentation.Maintain compliance with relevant internal policies, procedures and regulatory requirements. Contribute to timely resolution of audit and regulatory issues.Keep abreast with advances in credit risk analytics developments, products and applications by vendors, consultants, regulatory agencies and competitors.EDUCATION/WORK EXPERIENCE/DESIGNATIONS:Postgraduate degree in a quantitative discipline such as Math, Physics, Computer Science or other quantitative areasPreferred work experience: 3 years + of relevant analytical work experienceREQUIRED FUNCTIONAL/TECHNICAL COMPETENCIES:Strong knowledge of relational database application and development, data integration, and process automation. Proficient in working with large datasets is an asset.Technical proficiency with Excel, Access, PowerPoint, Visio, SQL, VBA, Java, C++, Python and R.Advanced knowledge of portfolio credit risk modeling theories and applications - including their business implications and limitations. Previous experience with Moody's Analytics Risk Frontier is an asset.Excellent written and presentation skills in order to report findings, make recommendations, and provide insightful viewpoints to Executive and Senior Management, as well as to provide training/explanation to various internal users of credit risk analytics, and to liaise with industry participants and other external parties.Knowledge of the Bank's policies, practices, and products as well as regulatory requirements and expectations pertaining to credit risk analytics.Required Behavioral Competencies:Ability to manage multiple priorities to ensure timely completion of planned deliverables (e.g. regular reports and analytics development milestones) as well as efficient response to ad hoc requirements that arise from time to time.Forward and independent thinking to identify requirements on credit risk analytics and associated opportunities for the Bank to reduce regulatory burden and economic risk as well as to enhance profitability and reputation.Collaborative and consensus-building skills, in particular with other Bank departments and external organizations.Flexibility and creativity in problem solving, innovation and path-finding ability.Strong project management skills and demonstrates accountability.Location(s): Canada : Ontario : TorontoAs Canada s International Bank, we are a leader when it comes to inclusion. We are a diverse and global team, speaking more than 100 languages with backgrounds from more than 120 countries. We value the unique skills and experiences each individual brings to the bank, and are committed to creating and maintaining an inclusive and accessible environment for everyone. Candidates selected for an interview will be contacted directly. If you require accommodation during the recruitment and selection process, please let us know. We will work with you to provide as seamless a recruitment experience as possible.", "link": "https://ca.indeed.com/viewjob?jk=77c78b76bf026fae&from=serp&vjs=3"},
{"title": "AVP, Portfolio and Risk Analytics", "company": "Manulife", "descr": "Are you looking for unlimited opportunities to develop and succeed? With work that challenges and makes a difference, within a flexible and supportive environment, we can help our customers achieve their dreams and aspirations.Job DescriptionThe Middle Office of Global Derivative Services has the mandate to manage: 1) the ongoing derivatives valuation processes; 2) Potential Future Exposure (PFE) modeling; 3) hedge effectiveness assessment testing; and 4) Variable Annuity (VA) hedging reporting and operations. These four functions are performed for financial, regulatory, compliance and internal reporting purposes.The Derivatives Valuation and Analytics function is accountable for ensuring correct ongoing valuation of all derivatives within the organization booked in the Findur system, offline, as well as for providing reporting on these positions to internal business users. The candidate will also have understanding of the daily PFE production that quantifies the counterparty credit risk of the firm s derivative trading activities, and understand performance attribution of derivative portfolios. In addition, the position is responsible for the on-going hedge assessment function, which includes effectiveness testing, hedge inception documentation, reporting, and managing the support systems involved. Due to its breadth, this role requires collaboration across the organization including interaction with front office, business units, risk, credit, finance, compliance, audit and technology personnel.Reporting to the AVP, Derivatives Middle Office, this position is based in the Toronto head office and services the derivatives activity of both the General Account and Asset Management arms of the business.Responsibilities:Work closely with business units, portfolio managers and front office to assess requirements of valuing new and existing derivatives positions, sensitivity analysis for existing positions;Interface with Models & Analytics, Market Risk Management and Derivatives Operations teams to implement new curves and models in the Findur pricing system;Work with the Derivatives Solutions team to support the setup of technology to facilitate trading of new derivative product types;Conduct risk testing and scenario analysis for internal business units;Monitor and report derivatives positions to satisfy regulatory and compliance requirements;Develop and maintain controls to ensure derivatives are valued correctly in the system;Reconcile mark-to-market differences with the counterparty and communicate issues to Collateral and Investment Risk teams;Take ownership of projects to enhance risk controls and reporting;Continuously evaluate, identify and recommend practices and controls that will increase process efficiency and mitigate financial and operational risks;Enhance Findur system capabilities to support effectiveness testing for new hedge accounting strategies;Develop a control framework to ensure hedge relationships are tracked and properly processed for financial reporting;Review automated hedge effectiveness assessment testing at quarter ends and perform manual testing as needed;Implement financial models and curves for pricing derivative trades and computing potential future exposure in Findur;Perform impact analysis on PFE of proposed trades as requested by front office;Prepare daily VAH Hedging Performance Attribution reports, macro hedging reports, and design and implement ongoing enhancement to those reports.Support daily VA Hedging operations and prepare / distribute weekly, quarterly and annual reporting to senior management and affected business units.Assist with process updates for PFE engine parameter calibration and maintenance, and conduct pre-deal checks for front office as needed;Provide leadership and mentoring to junior team members;Develop work plans that prioritize business needs of all stakeholders, establish project deliverables, timelines, and budget;Exercise judgment in identifying issues, modifying plans as demands change, assessing courses of action, and developing recommendations;Participate in ad-hoc projects across groups as needed. Support the assignments above for both the General Accounts and Manulife Asset Management.Knowledge/Skills/Competencies/Education:Education and Experience RequirementsEducation in business finance, quantitative finance or statistical analysis (Masters in Financial Engineering / Mathematical Finance / Statistics) or other quantitative discipline.Six to ten years of hands-on experience with derivative products. Familiarity with derivative instruments including futures, equity options, FX forwards, OTC and centrally cleared interest rate swaps, swaptions, bond forwards, cross-currency and total return swaps, interest rate caps & floors, FX options, and credit default swaps.Similar levels of experience with derivative pricing curve construction, including projection and discounting curves, LIBOR and OIS swap curves, FX forward points, repo curves, cross currency basis spreads, inflation curves, survival and recovery curves, dividend curves and volatility surfaces/cubes.Familiarity with derivative trading and collateral agreements such as Clearing Agreements and ISDAs/ CSAs.Advanced knowledge of derivative valuation models including Black-Scholes, Hull-White, normal swaption, Asian floor, and standard quanto;Understand statistical / stochastic models of risk factors for computing changes in credit exposures of derivatives in PFE calculations;Experience with hedge effectiveness assessment testing and performance attribution analysis for derivatives;CFA and/or FRM/ PRM designations preferred.Technical SkillsProgramming experience in VBA, SQL, EXCEL, MATLAB and/or Python an asset.An understanding of market data setup and market conventions.Experience with Findur system an asset.Management and Personal EffectivenessExcellent analytical and problem-solving skills.Solid organizational skills and high degree of professionalism combined with the ability to readily adapt to changing environments and deal with competing priorities.Excellent communication and documentation skills. A team player with demonstrated abilities for building and maintaining good working relationships both internally and externally, and up, down and across a large organization.Demonstrated ability and experience managing and coaching several direct reports (preferably in other locations) and leading a team of highly educated professionals.If you are ready to unleash your potential it s time to start your career with Manulife/John Hancock.About ManulifeManulife Financial Corporation is a leading international financial services group that helps people achieve their dreams and aspirations by putting customers' needs first and providing the right advice and solutions. We operate as John Hancock in the United States and Manulife elsewhere. We provide financial advice, insurance, as well as wealth and asset management solutions for individuals, groups and institutions. At the end of 2016, we had approximately 35,000 employees, 70,000 agents, and thousands of distribution partners, serving more than 22 million customers. At the end of 2016, we had $977 billion (US$728 billion) in assets under management and administration, and in the previous 12 months we made almost $26 billion in payments to our customers.Our principal operations are in Asia, Canada and the United States where we have served customers for more than 100 years. With our global headquarters in Toronto, Canada, we trade as 'MFC' on the Toronto, New York, and the Philippine stock exchanges and under '945' in Hong Kong.Manulife is committed to supporting a culture of diversity and accessibility across the organization. It is our priority to remove barriers to provide equal access to employment. A Human Resources representative will consult with applicants contacted to participate at any stage of the recruitment process who request an accommodation. Information received regarding the accommodation needs of applicants will be addressed confidentially.", "link": "https://ca.indeed.com/viewjob?jk=2ba6b8987074bb6f&from=serp&vjs=3"},
{"title": "Director and Actuary, GVAH", "company": "Manulife", "descr": "Are you looking for unlimited opportunities to develop and succeed? With work that challenges and makes a difference, within a flexible and supportive environment, we can help our customers achieve their dreams and aspirations.Job DescriptionTitle: Director (Manager), Actuarial Modelling, Global VA HedgingFunction: ActuarialLocation: Toronto onlyPosition Overview:Global Variable Annuity Hedging (GVAH) is responsible for establishing and leading the VA dynamic hedge programs at Manulife Financial. The role belongs to the Investment Division and reports to the AVP & Actuary, Global VA Hedging. It provides the opportunity to develop a deep understanding of various aspects of VA, such as product features, hedging strategies, financial reporting, capital and modelling. It also provides the opportunity to build relationships with several corporate areas and business units.The Actuarial Modelling Team in Global VA Hedging has the following mandate:Hedging of VA products with guaranteed value of C$72bnActuarial analysis of fair market value of VA liabilities, and its sensitivities to various market-based risk factors (Greeks). You can finally make use of your IFM exam knowledge.Utilize SoE-type analysis to provide actuarial insights for hedging performance and developing hedging strategies.Utilize the unique knowledge of both assets and liabilities to optimize hedging decisionsProvide forward-looking insights to anticipate trends that will have material impact on our hedging framework (e.g. IFRS 17, market depth issues and new tradeable assets)Become a master user of our homegrown hedging systems,.Test and implement changes to hedging models and systems to extend modelling and hedging capabilitiesMake recommendations on inforce management initiatives (e.g. buyback programs, reinsurance)Monitor currently unhedged business for opportunistic migration into the hedging programTo be a source of actuarial expertise on all issues related to VA. Interact with several group functions and business units from diverse backgrounds.This role is ideal for a good team player who is highly motivated and would like to participate in high profile projects relating to VA hedging. There are opportunities to gain exposure to topical and emerging actuarial issues such as IFRS 17. The candidate will have the opportunity to develop critical and transferable skills: quantitative, communication, systems, programming and strategic thinking.Responsibilities:Take on a leadership role in the implementation of a new hedging model.Test and implement improvements to existing hedging models and daily hedging operations.Take steps to ensure Manulife is ready for VA hedging under an IFRS 17 framework.Reviewing hedging liability grid results and assist with performance attributionWork with GVAH Strategy Team to develop and quantify impacts of new hedging strategiesInteract with Corporate Actuarial, Capital, Corporate Risk, and Business Unit Modelling and Valuation teams to validate and explain hedging resultsUpdate and propose changes to the equity option and swaption calibration methods and assumptionsRespond effectively to time sensitive requests for information from ManagementLead VA hedging projects as neededSupport regular stress testing and reporting of liabilities and GreeksQualifications:FSA/FCIA or equivalent. Quantitative Modeller / Financial Mathematician with actuarial foundation and experience will also be considered.Minimum 5 years of experience in the financial services industryStrong actuarial, analytical, and problem-solving skillsProactive and able to work both independently and with teamsStrong communication and relationship building skills to work with multiple partners from various backgrounds at the same time.Organized and capable to handle complex processesBasic knowledge of capital market instruments including futures, swaps, options and swaptionsKnowledge of Python, VBA and SQL is usefulStochastic modelling and quantitative modelling knowledge are assetsIf you are ready to unleash your potential it s time to start your career with Manulife/John Hancock.About ManulifeManulife Financial Corporation is a leading international financial services group that helps people achieve their dreams and aspirations by putting customers' needs first and providing the right advice and solutions. We operate as John Hancock in the United States and Manulife elsewhere. We provide financial advice, insurance, as well as wealth and asset management solutions for individuals, groups and institutions. At the end of 2016, we had approximately 35,000 employees, 70,000 agents, and thousands of distribution partners, serving more than 22 million customers. At the end of 2016, we had $977 billion (US$728 billion) in assets under management and administration, and in the previous 12 months we made almost $26 billion in payments to our customers.Our principal operations are in Asia, Canada and the United States where we have served customers for more than 100 years. With our global headquarters in Toronto, Canada, we trade as 'MFC' on the Toronto, New York, and the Philippine stock exchanges and under '945' in Hong Kong.Manulife is committed to supporting a culture of diversity and accessibility across the organization. It is our priority to remove barriers to provide equal access to employment. A Human Resources representative will consult with applicants contacted to participate at any stage of the recruitment process who request an accommodation. Information received regarding the accommodation needs of applicants will be addressed confidentially.", "link": "https://ca.indeed.com/viewjob?jk=0946170a9f240dc1&from=serp&vjs=3"},
{"title": "Software Engineer II", "company": "LoyaltyOne", "descr": "Description:Why Work with Us Are you passionate about Data and Reporting?As part of Member Experience Reporting team, the Software Engineer will play a critical role in making Member Experience data available in Data Hub and providing reports and insights that will help drive business decisions.What you ll do Create pipelines in databricks to transfer data to Data HubSupport other departments by producing self-serve reports / dashboards in Tableau to drive resultsConduct analysis and deliver key insights to address business problems or understand underlying trends to help evolve business strategies or in support of new programs or initiativesPrepare high-quality reports and presentations targeted for specific audiencesProactively highlight opportunities to develop and/or enhance existing tools and processesQualification:Who you are Post-secondary education with 1-2 years IT Application Development ExperienceAdvanced experience using Python, databricks Spark, SQL and ExcelProficient experience with Word, MS Access (VBA programming), PowerPoint and relational databases (Oracle)Familiarity with data warehouse and AWS (data lake) conceptsKnowledge of key call center metrics/reporting and call center applications is an assetSolid analytical, logical and problem-solving skillsStrong project management skills, with the ability to organize and prioritize multiple projects, competing requests and multiple tasks in a deadline-driven environmentStrong written and oral communication skillsWork independently in a fast-paced dynamic environmentPossess an excellent work ethic and be self-motivatedMust be able to travel between offices as necessaryRequirement to work non-core hours from time-to-time (e.g. during application launch)Reports are used for decision making purposes, therefore accuracy and the ability to meet timelines is crucial to the businessAbout LoyaltyOneLoyaltyOne is part of the successful Alliance Data family of companies that provide the full range of data-driven loyalty, marketing and credit solutions in more than 80 locations across the globe.Working with more than 100 leading brands in the retail, financial services, grocery, petroleum retail, travel and hospitality industries to profitably change customer behavior. Through a team of businesses, including one of the leading coalition loyalty programs in the world, the AIR MILES  Reward Program, LoyaltyOne designs, delivers and manages a suite of services focused on consumer data, customer-centric retail strategies, direct-to-consumer marketing, loyalty consulting and more.LoyaltyOne has broadened its horizons geographically by growing Precima in the European market. With the recent acquisition of BrandLoyalty in the Netherlands, LoyaltyOne has gained the expertise of a global leader in short-term loyalty campaigns, along with a client network that extends throughout Europe and Asia.About ADSAlliance Data  (NYSE: ADS) is a leading global provider of data-driven marketing and loyalty solutions serving large, consumer-based industries. The Company creates and deploys customized solutions, enhancing the critical customer marketing experience; the result is measurably changing consumer behavior while driving business growth and profitability for some of today's most recognizable brands. Alliance Data helps its clients create and increase customer loyalty through solutions that engage millions of customers each day across multiple touch points using traditional, digital, mobile and emerging technologies. An S&P 500 and Fortune 500 company headquartered in Plano, Texas, Alliance Data consists of three businesses that together employ more than 16,000 associates at approximately 100 locations worldwide. www.alliancedata.comAlliance Data is an Equal Employment Opportunity employer. Accordingly, we will make reasonable accommodations to respond to the needs of people with disabilities in accordance with legislation.Alliance Data participates in E-Verify.Check us out   LoyaltyOne on Stack Overflow | LinkedIn | Glassdoor | Facebook |Twitter | Blog | Instagram", "link": "https://ca.indeed.com/viewjob?jk=868b0b6f130afcd7&tk=1d8uist00f8sh800&from=serp&vjs=3&advn=7042723621657021&adid=276050144&sjdu=i6xVERweJM_pVUvgf-Mzud6v7vx4W2vba62rTobId37eIK82uw1XRT7m-D8lI0g6"},
{"title": "Senior   Business Modelling", "company": "EY", "descr": "Canada TAS, Business Modelling SeniorCompetitive business today is all about making intelligent, informed decisions. As a Business Modelling Senior, you ll help make that happen. You'd be an important part of our diversely talented, highly experienced team and work at the forefront of high-profile transactions. Our team of around 190 people sits at the heart of a global Valuation & Business Modelling network of over 1,550 specialists who deliver high quality advice through each phase of the transaction process.The OpportunityUnderpinning everything is our focus on developing a talented team through investment in technical and commercial training and knowledge transfer. Within the team you will have the opportunity to take on client management responsibilities and have the potential to gain excellent career progression. As part of your role you would work a varied portfolio of Business Modelling and transaction decision-related projects, which would include model builds to assist clients with developing Excel-based business planning and forecasting models as part of their ongoing business needs. You d also work on model review services and these are predominantly transaction decision-focused, typically project finance or buy side for potential investors as well as getting involved with the wider team on project work. Although our team are largely Toronto based, we operate as a national team and many of our engagements involve multi-national clients. There would likely be travel in Canada and a requirement to work outside of the country from time to time.", "link": "https://ca.indeed.com/viewjob?jk=9bbf2fd8be7a746f&from=serp&vjs=3"}
]