[
{"title": "Analyst, Public Credit", "company": "CPP Investment Board", "descr": "Job Description\n\nThe Public Credit group s focus is on the development and implementation of scalable beta and alpha strategies. The Analyst will be responsible for monitoring generation of portfolio risk and performance analytics, including building out tools and infrastructure to assist in such. The individual will work closely with Portfolio Managers to develop reports and tools that aid in portfolio monitoring, research, and trade strategy generation. They will also assist in hedging of portfolio risks, including recommendations of interest rate and FX positions and trades.\nRole-Specific Accountabilities\nReporting to the Senior Portfolio Manager   Public Credit, this position is primarily responsible for monitoring, reporting on, and reconciling portfolio risk and profit. The role will be integral in developing risk/P&L infrastructure and tracking portfolio exposures against various risk limits. The Analyst will also be responsible for monitoring portfolio FX and interest rate exposure, and will have capacity to recommend alpha positions based on research and sentiment. Major areas of responsibilities include:\nDeveloping and enhancing financial models used for valuation of fixed income and credit products\nCalculations of P&L, risk and other metrics on the trading desk\nAssisting Portfolio Managers in the development, implementation and monitoring of existing portfolios\nIdentifying and researching new alpha-generating investment opportunities within this asset class\nConstant optimization and re-engineering of desk processes and strategy tools to increase group efficiency", "link": "https://www.indeed.ca/viewjob?jk=799477c5840d0b37&from=serp&vjs=3"},
{"title": "Solutions Analyst", "company": "GS1 Canada", "descr": "Position:\n\nSolutions Analyst\n\n\nReports To:\n\nSenior Vice President, IMS\n\n\nTier:\n\nStaff\n\n\nDepartment:\n\nIndustry Managed Solutions\n\n\nCompany:\n\nGS1 Canada\n\n\nLocation:\nToronto\n\n\nStatus:\n\nFull time\n\n\nJob Number:\n\n 1437\n\n\nKey Role\nThe Industry Managed Solutions team requires a Solutions Analyst to assist in managing the ongoing growth and transformation of the team. The Analyst will play a critical role on the IMS team, helping to consolidate the various streams of data and information from throughout the organization. In addition, the Analyst will help create and maintain a comprehensive set of metrics and reports which will help describe the current state of the business, identify trends and measure key vendor performance. In addition to the data-oriented responsibilities, the Analyst will be required to conduct industry research, perform industry scans, partake in vendor reviews and assist in vendor selection.\n\nIn addition to these responsibilities, the Analyst will assist in the day-to-day operation of the department which will include managing the departments SharePoint site, assisting in budgeting, resource tracking and overall administration of the team.\n\n\nDuties and Responsibilities\nDevelop and manage reports to identify trends and opportunities within key business areas\nCollect, organize and maintain information from various sources throughout the organization (incl. subscriber feedback, business requirements, sector board feedback, etc) and deliver regular status updates regarding progress within various project assignments\nConduct industry research and communicate finding to leadership;\nManage departmental communication and document SharePoint site;\nAct as a conduit between the Industry Managed Solutions team and other key stakeholder in the organization\nMaintain key vendor information, and monitor reporting on vendor performance against service level agreements and Key Performance Indicators\nAssist with budgeting, time tracking and general administration of the IMS team\n\n\nRequired Knowledge, Skills, and Experience\nBachelor s degree in Business, Technology or Engineering\n2-5 years of experience in a similar role\nExperience with developing and managing reports, and conducting analysis to provide insights to team members and senior leadership\nStrong analytical and statistical knowledge with an ability to combine quantitative and common-sense problem-solving skills\nAbility to read, comprehend, summarize and report on various sources of information such as industry articles, websites, periodicals, etc. and present findings in a succinct and professional manner\nExcellent knowledge of Microsoft Office suite of products; must have exceptional Excel skills and working knowledge of MS Access (or other database management system).\nUnderstanding of simple programing languages (such as SQL, VBA, Python)\nAbility to independently gain insight into and develop process / system changes and improvements.\nSelf-starter, able to manage and prioritize multiple complex tasks with minimum supervision and strong attention to detail\nDesire to learn and succeed in a challenging fast-paced environment\nUnderstanding of six sigma tools and methodologies would be an asset\nStrong organizational, planning and time management skills\nStrong work ethic, a high respect for confidentiality and sound professional judgment", "link": "https://www.indeed.ca/viewjob?jk=72f855ddc32d6924&from=serp&vjs=3"},
{"title": "Professor - Data Analytics", "company": "Toronto School of Management", "link": "https://www.indeed.ca/cmp/LSBF-Canada-Inc./jobs/Professor-62bc86789a1d92eb?vjs=3"},
{"title": "Manager Counterparty Credit Risk Capital", "company": "BMO Financial Group", "descr": "Mandate:\nDaily operations and system enhancements, create and participate in development of testing requirements and validation of implementation of capital requirements for Counterparty Credit Risk Capital. Identify opportunities for, and lead the enhancement for capital methodologies for quantifying counterparty credit risk capital across all trading products so that the accuracy and reliability of capital and consequent business decisions reliant upon these data are enhanced.\nKEY ACCOUNTABILITIES\n Implement tools for, and perform, driver analysis for the capital changes based on production operations\nInterpret the regulatory requirement and provide analytical solutions\nTranslate the business solutions into technical requirement, i.e. write business requirement\nSupport the implementation process, and provide seamless communication with technology developer .\nCr eate test plan including the test scenarios and sample data to support the testing scenarios\nPerform the testing across the entire testing cycle to ensure business requirements are met\nIdentify issues and propose solutions\nAnalyze the test result and communicate the result to senior management\nDocument procedures, control processes, and policies relevant to internal controls\nContinuously improve understanding of subject matter relating to Counterparty Credit Risk monitoring and Basel III RWA / capital calculations\nCROSS-FUNCTIONAL RELATIONSHIPS\nTechnology & Operations;\nCorporate Risk Management directors and managers;\nCapital Markets Trading Lines of Business\nCredit Portfolio Managers and Account Managers\nExternal system software vendors\nModel Validation\nMarket Risk internal teams   infrastructure, process and governance, etc.\nROLE DIMENSIONS:\nThis role has direct or in-direct impact on the following financial measures:\n Regulatory capital ;\nEconomic and regulatory capital;\nCounterparty credit risk exposure measurements;\nQualifications\nKNOWLEDGE AND SKILLS:\nMust-Have Skills:\n 3+ years of related work experience in a financial institution\nStrong knowledge with financial products, specifically possessing knowledge of derivatives ( OTC) as well as SFT\nStrong Experience working with BASEL III and OSFI CAR Guideline\nStrong Experience with CCR, CCR Capital ( CEM, SA-CCR) is a MUST\nExperience on BCAR\nAdvanced knowledge of Excel, VBA, SQL, Database Concepts\nAdvanced Python programming experience\nParticipation in mid-scale/large IT development projects, with hands-on experience in conducting testing\nStrong capability of writing business requirement and test plans\nStrong capability of creating mock-up data required to test the pre-specified cases\nNice-to-Have Skills:\nBroad understanding of risk management methodologies\nExperience in using work tracking systems (e.g. JIRA, HPQC) would be an advantage\nExperience in an Agile and fast-paced environment\nSoft Skills :\nStrong analytic and troubleshooting skill s with a solution oriented attitude\nSelf-motivated and take ownership\nGood self-organization skills including planning, scheduling, managing priorities and meeting deadlines\nGood oral and written communication skills .\nStrong interpersonal skills and ability to function effectively within a team, and work with multiple stakeholders.\nCurios, dynamic, focused, proactive, detail-oriented\nEducational Requirements/Professional Certifications:\nAdvanced university degree, preferably in a quantitative field, such as Mathematics, Statistics, Science or Engineering.\nCFA, FRM, PRM designation or working towards one of those or similar ones would be an asset\nWe re here to help\nAt BMO we have a shared purpose; we put the customer at the centre of everything we do   helping people is in our DNA. For 200 years we have thought about the future the future of our customers, our communities and our people. We help our customers and our communities by working together, innovating and pushing boundaries to bring them our very best every day. Together we re changing the\n\nway people think about a bank.\nAs a member of the BMO team you are valued, respected and heard, and you have more ways to grow and make an impact. We strive to help you make an impact from day one   for yourself and our customers. We ll support you with the tools and resources you need to reach new milestones, as you help our customers reach theirs. From in-depth training and coaching, to manager support and network-building opportunities, we ll help you gain valuable experience, and broaden your skillset.\nTo find out more visit us at https://bmocareers.com .\nBMO is committed to an inclusive, equitable and accessible workplace. By learning from each other s differences, we gain strength through our people and our perspectives. Accommodations are available on request for candidates taking part in all aspects of the selection process. To request accommodation, please contact your recruiter.\nJob\n Data Sciences\nPrimary Location\n Canada-Ontario-Toronto\nOrganisation\n ERPM-X000073\nSchedule\n full-time\nJob Posting\n 04/12/19\nUnposting Date\n 06/07/19", "link": "https://ca.indeed.com/viewjob?jk=5c8f35df4cae5cbd&tk=1d8uc1use0m61000&from=serp&vjs=3&advn=6114451463185775&adid=196201922&sjdu=PU7VS0P_e8MVjSR70CDLK--bPylNW2vvO3WAHEKN7JgEuyl-uSLk6boycRtdWr-cP7xj9iob-_hS8FrnYnn0D0VC-VkTibfxmUNGuMzS9Qz7YMFRWwiY7cJo0du9vzAV"},
{"title": "Analyst/Senior Associate - Market Risk, Quantitative Risk Advisory", "company": "Deloitte", "descr": "Job Type: Permanent\nPrimary Location: Toronto, Ontario, Canada\nAll Available Locations: Toronto\nExternal Posting Description\nWould you like to further develop your career with our exponentially expanding Analytics Data Application & Modeling (ADAM) practice? Are you up for the challenge to help the most sophisticated Canadian and international clients to solve their quantitative and modelling issues? if you are looking for a challenging opportunity, please see below for what this exciting opportunity entails.\n\nEven the best-managed ventures are vulnerable to external influences-that s where Deloitte s Analytics Data Application & Modeling experts step in. As a member of our Financial Advisory team, you ll help financial services industry (FSI) clients face quantitative issues with informed confidence. Using your deep technical skills and leveraging our global network of experts, you ll provide professional advice to our FSI clients in a wide range of situations. The result? Our clients will be better placed to take control and receive the best solutions to their complex challenges.\n\nAs a Senior Associate, you will:\n\nDevelop/validate/review Capital Markets and Market Risk including Structural Market Risk Interest-Rate-Risk models (e.g. Financial Derivatives Pricing, VaR, Counterparty Credit Risk, DRC/IRC, CVA/XVA, FRTB and CCAR models) based on industry best practices;Be able to learn and work in other quantitative and analytical areas such as credit modeling, forecasting and stress testing, customer behavior modeling, and new innovations such as Machine Learning and Artificial Intelligence;Carry out various complex financial analyses including derivatives valuation independently;Support and contribute to a variety of Market Risk and other areas projects for our clients by delivering high quality and value-added work on timely base;Work with our clients independently demonstrating your capabilities and accountabilities as a subject matter expertContribute to the growth of continued business practices within Financial Engineering and Analytics (FEA) groupEmploy a structured approach to project management to ensure complete client satisfaction and project profitability\nExternal Posting Qualifications\nSolid academic background with a PhD or Master s Degree in Mathematical Finance, Financial Engineering or other relevant post graduate degree; FRM, PRM, CFA is an asset;Solid knowledge and skills of modeling practices in Capital Markets and Market Risk, including Derivatives Pricing, VaR, sVaR, IRC, DRC, CVA/XVA, FRTB and Counterparty Credit RiskMinimum 1 year of relevant experience spent within Capital Markets and/or Market Risk, on model development or model validation team at a major financial institution;Strong commitment to professional and client service excellence;Ability to program in pertinent languages, such as Excel, C++, VBA, Python and MATLAB;Knowledge of FINCAD and Bloomberg/ Reuters, an asset;Strong team player as well as an independent contributor with capacity to work under pressure;Demonstrated superior verbal and written communication skills to communicate with members of our team and with internal and external clients;Experienced with project problem diagnosis, documentation and solution developmentCanadian travel required and occasional international travel. Candidates must be able to enter the USA to work on client assignments.\nWhy Deloitte?\nLaunch your career with The One Firm where you can make a greater impact than you ever thought possible. With endless opportunities at every turn, and a culture built to support and drive our people to be the very best they can be, Deloitte is The One Firm for you to learn, grow, create, and lead.\nAt Deloitte, we understand that everyone, and their career goals, are different. As a firm, we help create the conditions and opportunities that will enable our people to thrive   both professionally and personally. We do this by making three commitments to our people:\nYou will lead at every level: We grow the world s best leaders so you can achieve the impact you seek, faster.\nYou can work your way: We give you the means to work how you want, and we have innovative spaces and the mindset to help you be wildly successful.\nYou will feel included and inspired: We create a deep sense of belonging where you can bring your whole self to work.\nApply now and let us show you how to push your career to the next level at Deloitte. The One Firm. For You.\nDeloitte is an inclusive employer dedicated to building a diverse workforce. We encourage applications from all qualified candidates and will accommodate applicants  needs under the respective provincial human rights codes throughout all stages of the recruitment and selection process. Please advise the Recruiter to ensure your accessibility needs are accommodated throughout this process. Information received relating to accommodation will be addressed confidentially.\nWe thank all applicants in advance for their interest; however, only those candidates selected for an interview will be contacted\n44954", "link": "https://ca.indeed.com/viewjob?jk=bdd82e262b2d1d84&from=serp&vjs=3"},
{"title": "Analyste s nior", "company": "TD Bank", "link": "https://ca.indeed.com/viewjob?jk=04fff55be875b31a&from=serp&vjs=3"},
{"title": "Entry Level Groundwater Modeler", "company": "Wood", "descr": "Overview / Responsibilities\nWood Environment & Infrastructure Solutions has an exciting career opportunity in our Hydrogeology Group for an Entry Level Groundwater Modeler. This position will be based in Burlington or Mississauga and will be part of our existing modelling group, reporting to our Senior Hydrogeologist Lead based in Burlington. As part of the work you would be expected to work with other disciplines such as hydrologists, aquatic biologists, permitting specialists, geochemists, water resources engineers and geotechnical engineers.\n\nThe successful candidate will be working with a highly motivated team of professionals delivering quality services on technically challenging projects located across Canada. While the primary component of the work is groundwater modelling, you will also be required to undertake data analysis and some reporting tasks. The job will also provide an opportunity to broaden your experience with field work, including single well response and pumping tests, flow monitoring, drilling, and the use of specialty data collection techniques. You would also be given the opportunity to develop project management skills over time. Wood would provide mentorship and on the job training opportunities.\n\nKey Responsibilities:\nIn conjunction with experienced modelers, develop and apply analytical and numerical groundwater models as required to support environmental impact assessments, regional groundwater resource evaluations, mine dewatering planning and optimization, and municipal water supply projects\nWork collaboratively with members of the Hydrogeology Group and team members from other internal business lines and offices, as well as external sub-contractors/consultants, and clients\nEvaluate and interpret data including geology, hydrogeology, and groundwater chemistry as part of the conceptual model development process\nContribute to the development of proposals for new work, both internally to other offices and internal business lines, and externally to potential and existing clients\nOpportunities to collaborate with Wood teams across Ontario and sometimes across Canada and internationally\nSkills / Qualifications\nUndergraduate Degree in Earth Sciences/Geology, Environmental Sciences or Civil/Geological/Environmental Engineering with a specialization in groundwater modelling through course work or undergraduate projects/thesis is preferred; candidates with strong analytical and quantitative skills with other degrees having a strong quantitative component such as physics or applied mathematics will also be considered\nA post-graduate degree (M.Sc., Ph.D.) in Engineering, Hydrogeology or related discipline with a thesis with a significant modelling component is required\nExperience with industry-standard numerical modelling codes for simulation of groundwater flow is essential to the position; at least one of USGS MODFLOW, FEFLOW, HydroGeoSphere, MIKE SHE\nProgramming experience with one of the following Fortran, MS VBA, and Python\nExperience with geological modelling software (e.g. Leapfrog, EVS) is an asset\nExperience with coupled surface water   groundwater modelling is an asset\nExperience of parameter estimation and uncertainty analysis (i.e. PEST) is also desirable\nRegistered or eligible for registration as a P.Geo. or P.Eng. in Ontario, once reaching the required level of experience\nSome consulting experience in hydrogeology is an asset\nStrong technical, verbal, and written communication skills (English) are required\nSpanish or French would be an asset\nSome technical report and/or document writing experience is an asset\nCompetency with MS Office suite of applications is required\nAbility to work independently in both office and field environments and demonstrate strong attention to detail and organization skills\nBe self-motivated and a team player\nValid Class G Ontario Driver s License\nCompany Overview\nWood is a global leader in the delivery of project, engineering and technical services to energy and industrial markets. We operate in more than 60 countries, employing around 60,000 people, with revenues of over $10 billion. We provide performance-driven solutions throughout the asset life cycle, from concept to decommissioning across a broad range of industrial markets, including the upstream, midstream and downstream oil & gas, power & process, environment and infrastructure, clean energy, mining, nuclear, and general industrial sectors. www.woodplc.com\nDiversity Statement\nWe are an equal opportunity employer that recognises the value of a diverse workforce. All suitably qualified applicants will receive consideration for employment on the basis of objective criteria and without regard to the following (which is a non-exhaustive list): race, colour, age, religion, gender, national origin, disability, sexual orientation, gender identity, protected veteran status, or other characteristics in accordance with the relevant governing laws.", "link": "https://ca.indeed.com/viewjob?jk=4262327d0f432d4f&from=serp&vjs=3"},
{"title": "Senior Business Analyst", "company": "CIBC", "link": "https://ca.indeed.com/viewjob?jk=fc858dc3d91a055a&from=serp&vjs=3"},
{"title": "Senior Quantitative Analyst", "company": "Manulife", "descr": "Are you looking for unlimited opportunities to develop and succeed? With work that challenges and makes a difference, within a flexible and supportive environment, we can help our customers achieve their dreams and aspirations.\nJob Description\nThe Quantitative Analytics team within Financial Risk provides quantitative financial modelling and analytics capability to a variety of stakeholders in Group Risk, Group Finance and Business Units. The team focuses on model, methodology and application development to support liability valuation, risk measurement, insurance product pricing and decision making.\nReporting to the AVP, Quantitative Analytics, the Senior Quantitative Analyst is accountable for the development and implementation of quantitative models to support business growth. This position provides the unique opportunity for gaining exposure to risks arising from both asset and liability sides (interest rate risk, equity risk, counterparty credit risk, etc.).\nResponsibilities\nDevelop models to generate economic scenarios covering multiple asset classes for valuation, pricing, capital and risk reporting.\nDevelop risk models/engines for market, credit, liquidity and investment risks.\nDevelop calibration methodology and build calibration tools for model inputs.\nDocument key processes on model and methodology related processes.\nResponsible for getting models and methodologies approved by appropriated authorities or vetted by Model Risk Management.\nUnderstand business requirements and look for opportunities to automate and streamline business processes.\nParticipate in ad-hoc projects and provide quantitative support to business partners, senior management and industry working groups.\nKeep informed of current practices and research in financial modelling by reading academic literature, attending academic and practitioner workshops and conference.\nQualifications\nMaster or Ph.D. in Quantitative/Mathematical Finance, Mathematics, Physics, Engineering, Statistics, etc..\nExperience in stochastic modelling, probability theories, statistics analysis, econometric modelling, machine learning and other numerical techniques.\nExperience in Python, EXCEL, VBA and SQL.\nExcellent analytic and problem-solving skills.\nExcellent communication and documentation skills.\nStrong organizational and team building skills.\nAbility to build strong working relationships with business units and other teams across Manulife.\n\nIf you are ready to unleash your potential it s time to start your career with Manulife/John Hancock.\n\nAbout Manulife\n\nManulife Financial Corporation is a leading international financial services group that helps people achieve their dreams and aspirations by putting customers' needs first and providing the right advice and solutions. We operate as John Hancock in the United States and Manulife elsewhere. We provide financial advice, insurance, as well as wealth and asset management solutions for individuals, groups and institutions. At the end of 2016, we had approximately 35,000 employees, 70,000 agents, and thousands of distribution partners, serving more than 22 million customers. At the end of 2016, we had $977 billion (US$728 billion) in assets under management and administration, and in the previous 12 months we made almost $26 billion in payments to our customers.\n\n\nOur principal operations are in Asia, Canada and the United States where we have served customers for more than 100 years. With our global headquarters in Toronto, Canada, we trade as 'MFC' on the Toronto, New York, and the Philippine stock exchanges and under '945' in Hong Kong.\n\nManulife is committed to supporting a culture of diversity and accessibility across the organization. It is our priority to remove barriers to provide equal access to employment. A Human Resources representative will consult with applicants contacted to participate at any stage of the recruitment process who request an accommodation. Information received regarding the accommodation needs of applicants will be addressed confidentially.", "link": "https://ca.indeed.com/viewjob?jk=b185978f274dccf7&from=serp&vjs=3"},
{"title": "Senior Analyst, Workflow Optimization & Analytics", "company": "Shoppers Drug Mart", "descr": "Location:\n243 Consumers Road, Toronto, Ontario, M2J 4W8\nTake ownership and find more ways to care about our local store owners in a career at Shoppers Drug Mart Central Office / Store Support. Provide great service, specific expertise and actionable advice to support Associate-Owners and their staff in delivering the best health, beauty and convenience services to Canadians.\n\n\nWhy this role is important?\nReporting to the Manager, Workflow Analytics & Insights, you will be a key contributor to the  First to Discover  mission statement by enabling early detection of pharmacy workflow improvement opportunities and developing tools to optimize process and operational design. To be successful, you will leverage expertise in data modeling & database design, deep-dive analytics, reporting dashboards, and developing leading-edge decision support tools such as optimization and labour planning models.\nThis is an opportunity to tackle unique challenges within the Enterprise Operations Development & Systems organization, making a positive impact to productivity, patient safety and privacy, and customer experience in retail pharmacy across Canada for both Shoppers Drug Mart and Loblaws stores.\nWhat You'll Do:\nMeasure workflow performance by analyzing transaction data and conducting in-store time studies\nContribute to the development of labour modeling and scheduling tools, and support the development of change management materials and communications for the annual planning process\nDrive new analytical insights from transactional prescription data (long and wide data sets), using sound statistical and modeling techniques (classification, linear and logistic regression, etc.) to evaluate business hypotheses\nEvaluate accuracy and precision of models through p-value, residual analysis, confusion matrix, etc.\nProactively identify and integrate new data sources to expand timeliness, quality, and insightfulness of analytical and modeling activities\nBuild databases and data collection/transformation processes to transform raw data into useful metrics\nProvide ad-hoc analysis, decision support tools, and performance measurements to support business partners and stakeholder initiatives\nDefine and capture KPIs to measure project success, and validate quality of transactional data and other data sources\nGenerate dashboard reports to inform leadership team on workflow performance and trends\nWork with development partners to ensure decision support and reporting tools are built to expectation\nWhat You'll Need:\nUniversity-level education in Statistics, Computer Science, Engineering, or a related quantitative field (preference given to post-graduate degrees)\n3+ years of experience in an operations research, data science, or similar role\nStrong programming, scripting, or automation skills required (e.g. R, Python, VBA, Javascript)\nKnowledge in SQL and database principles required\nExperience in predictive analytics and machine learning would be an asset\nEffective communication and business understanding, able to articulate the  so-what  of analytical results into business context\nAble to conceptualize and work with complex systems and models\nSelf-driven initiative and natural curiosity to challenge existing assumptions and pose new questions\nStrong attention to detail, delivering high quality of work in fast-paced and dynamic environment\nWhy work at Shoppers Drug Mart?\nActing as consultants, supporting internal customers and the Associate-Owners, you will get experience unique to the retail industry while working for an award-winning national brand. Benefit from a purchase discount program, competitive pay and online learning through SDMU.\nTake ownership of your work and find more ways to care about your work, co-workers, customers and community.\nHow You ll Succeed:\nAt Shoppers Drug Mart Inc. , we seek great people to continually strengthen our culture. We believe great people model our values, are authentic, build trust and make connections.\nIf that sounds like you, and you are open-minded, responsive to change and up to the challenges provided in a fast-paced retail environment, apply today.\nEmployment Type:\nFull time\nType of Role:\nRegular\nShoppers Drug Mart Inc. recognizes Canada's diversity as a source of national pride and strength. We have made it a priority to reflect our nation s evolving diversity in the products we sell, the people we hire, and the culture we create in our organization. Accommodation is available upon request for applicants with disabilities in the recruitment and assessment process and when hired.\nIn addition, we believe that compliance with laws is about doing the right thing. Upholding the law is part of our Code of Conduct   it reinforces what our customers and stakeholders expect of us.\nPlease Note: If you have Employee Self Service (ESS) on Workday, apply to this job via the Workday application.", "link": "https://ca.indeed.com/viewjob?jk=4d4ad6339c2758a7&from=serp&vjs=3"},
{"title": "Software Engineer II", "company": "LoyaltyOne", "descr": "Description:\n\nWhy Work with Us \nAre you passionate about Data and Reporting?\nAs part of Member Experience Reporting team, the Software Engineer will play a critical role in making Member Experience data available in Data Hub and providing reports and insights that will help drive business decisions.\nWhat you ll do \nCreate pipelines in databricks to transfer data to Data Hub\nSupport other departments by producing self-serve reports / dashboards in Tableau to drive results\nConduct analysis and deliver key insights to address business problems or understand underlying trends to help evolve business strategies or in support of new programs or initiatives\nPrepare high-quality reports and presentations targeted for specific audiences\nProactively highlight opportunities to develop and/or enhance existing tools and processes\nQualification:\nWho you are \nPost-secondary education with 1-2 years IT Application Development Experience\nAdvanced experience using Python, databricks Spark, SQL and Excel\nProficient experience with Word, MS Access (VBA programming), PowerPoint and relational databases (Oracle)\nFamiliarity with data warehouse and AWS (data lake) concepts\nKnowledge of key call center metrics/reporting and call center applications is an asset\nSolid analytical, logical and problem-solving skills\nStrong project management skills, with the ability to organize and prioritize multiple projects, competing requests and multiple tasks in a deadline-driven environment\nStrong written and oral communication skills\nWork independently in a fast-paced dynamic environment\nPossess an excellent work ethic and be self-motivated\nMust be able to travel between offices as necessary\nRequirement to work non-core hours from time-to-time (e.g. during application launch)\nReports are used for decision making purposes, therefore accuracy and the ability to meet timelines is crucial to the business\n\nAbout LoyaltyOne\nLoyaltyOne is part of the successful Alliance Data family of companies that provide the full range of data-driven loyalty, marketing and credit solutions in more than 80 locations across the globe.\nWorking with more than 100 leading brands in the retail, financial services, grocery, petroleum retail, travel and hospitality industries to profitably change customer behavior. Through a team of businesses, including one of the leading coalition loyalty programs in the world, the AIR MILES  Reward Program, LoyaltyOne designs, delivers and manages a suite of services focused on consumer data, customer-centric retail strategies, direct-to-consumer marketing, loyalty consulting and more.\nLoyaltyOne has broadened its horizons geographically by growing Precima in the European market. With the recent acquisition of BrandLoyalty in the Netherlands, LoyaltyOne has gained the expertise of a global leader in short-term loyalty campaigns, along with a client network that extends throughout Europe and Asia.\n\nAbout ADS\nAlliance Data  (NYSE: ADS) is a leading global provider of data-driven marketing and loyalty solutions serving large, consumer-based industries. The Company creates and deploys customized solutions, enhancing the critical customer marketing experience; the result is measurably changing consumer behavior while driving business growth and profitability for some of today's most recognizable brands. Alliance Data helps its clients create and increase customer loyalty through solutions that engage millions of customers each day across multiple touch points using traditional, digital, mobile and emerging technologies. An S&P 500 and Fortune 500 company headquartered in Plano, Texas, Alliance Data consists of three businesses that together employ more than 16,000 associates at approximately 100 locations worldwide. www.alliancedata.com\n\nAlliance Data is an Equal Employment Opportunity employer. Accordingly, we will make reasonable accommodations to respond to the needs of people with disabilities in accordance with legislation.\nAlliance Data participates in E-Verify.\nCheck us out   LoyaltyOne on Stack Overflow | LinkedIn | Glassdoor | Facebook |Twitter | Blog | Instagram", "link": "https://ca.indeed.com/viewjob?jk=868b0b6f130afcd7&tk=1d8uc1usk5mcq800&from=serp&vjs=3&advn=7042723621657021&adid=276050144&sjdu=i6xVERweJM_pVUvgf-Mzud6v7vx4W2vba62rTobId37eIK82uw1XRT7m-D8lI0g6"},
{"title": "Senior Specialist, Process Innovation", "company": "Samsung Electronics", "descr": "Position Summary\nThe Senior Specialist in Process Innovation will review all operations and processes related to Retail, sales, Supply Chain Management (SCM), Logistics, Finance and Service to identify areas of improvement, develop action/project plans to address and follow through to implementation. This person will focus on value added projects to optimize the functional processes and the operational systems utilizing data driven analytics. The position will be a key liaison between Sales & Marketing, SCM, Logistics, Business Operations Center (BOC), Information Technology (MIS), Finance and Service and will interact with Samsung Corporate Headquarters(HQ), North American Headquarters (NAHQ), Samsung sister companies such as Samsung SDS, External Customers and 3rd party Vendors on projects they lead.\nRole and Responsibilities\nEssential Duties and Responsibilities:\nResponsible for the development of new Process Innovation Projects related to operation optimization and process efficiency and ensuring successful delivery of projects: Project Plan\nEnsures execution of projects developed\nResponsible to establish timelines, ownership, key milestones and to follow-up with stakeholders on all deliverables\nResponsible to monitor project execution and develops follow-up plan in case change/improvement are required based on the feedback\nResponsible for the adoption and coordination of new operational process or system changes ensuring alignment to HQ guidelines\nResponsible to resolve escalations through interaction with all levels within Sales and Marketing, SCM, Logistics, BOC, Finance and Service to ensure that needs are identified and immediate resolution found for critical SCM operational barriers\nCoordination of required System/process implementation\nTraining for new Process or functional system delivered by project\nImplementing a robust KPI monitoring system at Project end to measure short/long term results\nResponsible to present strategic ideas to executives, tactical plans to managers and operational tasks to employees in addition to gaining consensus from all levels of the organization\nReview and Coordinate the updates of new policies and procedures in GPPM\nKnowledge:\nEducation focused on a technical discipline is an asset (Computer Science, Engineering, etc)\nExpert Knowledge of Business Systems (SAP required, SFDC an asset)\nMS Office suite required, Strong Excel VBA, SQL an asset, R and Python an asset\nAbility to evaluate and analyze complex systems data and determine appropriate actions\nStrong interpersonal skills with the ability to influence without authority\nAdvanced in Microsoft Office (Excel, Access, PowerPoint, Visio, Word, Outlook),\nExperience:\nProject Management experience required (PMP an asset)\nLean Six Sigma experience an Asset\n3-5 years of work related experience supply chain processes and/or retail channel within electronics industry\nCompetencies:\nStrong Data analysis\nThe ability to develop and maintain excellent working relationships with multiple levels within and outside the company. Must be able to influence others in acceptance, approval, and providing project description.\nThe ability to plan, organize, and prioritize multiple assignments and projects.\nThe ability to work in a team environment to identify and achieve team project goals and results, including the completion of assignments within established time frames.\nDemonstrated ability to Interact with all levels within the organization\nStrong interpersonal and analytical skills\nSkills and Qualifications\nSamsung is an equal employment opportunity employer.\nSamsung has an accommodation process in place and provides accommodations for job applicants with disabilities as appropriate. Assessment and selection materials and procedures can be made available in accessible formats and methods as appropriate. If you require a specific accommodation because of disability or medical need, please let us know when selected to take part in our recruitment process so that reasonable arrangements can be made for the appropriate accommodations to be in place as you move through our process.\nWe thank you for your interest in working for Samsung. Only candidates selected for an interview will be contacted.\n#LI-DJ1\n#indhigh\n* Please visit Samsung membership to see Privacy Policy, which defaults according to your location. You can change Country/Language at the bottom of the page. If you are European Economic Resident, please click here .", "link": "https://ca.indeed.com/viewjob?jk=4e4071e6212274dd&tk=1d8uc1uua0hrf000&from=serp&vjs=3&advn=4239586925542806&adid=192544934&sjdu=SiFHkPhkZXklx1BTeo8ye7P5n_-s08hrxMD-dtpZk1mNTAFRPpsSNCj5n5rye5lRDM3_fIKHIPOT2t6btmZj70bWxM9QQUtCzgscF56GXoaFNI8Kh2pSkVkX1-iPWXIQ8cmXIpoQ7ajHYZVrgXbVJkJ62_NkPPmsqUvzB3Ka2tTbj1wgapo-kDUYNzHRnF1l9owAEa2u-3z1BAnD3hr-jA"},
{"title": "Test Automation Architect", "company": "HCL America Inc", "link": "https://www.indeed.ca/cmp/HCL-Technologies/jobs/Test-Automation-Architect-3c599e734b2f5519?sjdu=vQIlM60yK_PwYat7ToXhk-QupQFnb8b_tsK3nTDMOrqXoXRzY-VTwf26bWv2KUQtxE0XzjpMiqtAKJtr6OvdSfRXnJP1gKhlBc5kg2DOpKs&adid=269051460&vjs=3"},
{"title": "Senior   Data Analytics", "company": "EY", "descr": "Canada TAS, Decision Analytics Senior\n\n\nDo you have an analytical mind-set? Within Business Modelling and Decision Analytics we have a rapidly growing analytics service and are currently looking for exceptional individuals with experience in advanced analytics, data science and machine learning technologies to join the team.\n\n\nWe work with major corporate and private equity clients, government departments and other public-sector bodies, advising them on complex strategic corporate transaction activities (e.g. related to mergers and acquisitions, joint ventures, asset disposals etc.) and commercial, financial and operational decisions.\n\n\nOur projects often involve managing multiple stakeholders and high degrees of complexity and uncertainty. Decision making in this environment requires strong client management and communication skills, in addition to rigorous analytical techniques and excellent data handling skills.\n\n\nOur work typically involves constructing purpose built databases storing large client datasets for our analytical models, using data transformation tools, visualization tools, programming and statistical tools (such as R and Python), to derive insight through data modelling and simulations, in a fast-moving transaction decision-making environment.\n\n\nAlthough the team is largely Toronto-based, we operate as a national team and many of our engagements involve multi-national clients. This role will most likely require some travel within Canada and could require overseas working from time to time.", "link": "https://ca.indeed.com/viewjob?jk=713ba3c8f3ed5ee8&from=serp&vjs=3"},
{"title": "Senior Actuarial Analyst", "company": "RGA Reinsurance Company", "link": "https://www.indeed.ca/cmp/RGA-Reinsurance-Company/jobs/Senior-Actuarial-Analyst-8c3bdafab50f18df?vjs=3"},
{"title": "Senior Data Analyst - Lifecycle", "company": "FreshBooks", "link": "https://www.indeed.ca/viewjob?jk=637db44a14d01aa4&from=serp&vjs=3"},
{"title": "Analyst, Advanced Analytics", "company": "President's Choice Financial", "descr": "Analyst, Advanced Analytics\n\n25 York Street, Toronto, Ontario, M5J 2V5\nPresident s Choice Bank is a wholly-owned subsidiary of Loblaw Companies Limited (LCL) and was established to promote President s Choice Financial services offered by strategic partners in all regions of Canada. PCF has grown to over 3 million customers earning millions in better interest rates, free groceries and other rewards. It operates in the following segments:\nMastercard : The President s Choice Financial Mastercard is offered and operated by President s Choice Bank.\nInsurance : Home and auto insurance, travel and pet insurance are offered through affiliates and relationships with several insurance companies.\nPC Services , which includes PC Financial Insurance, The Mobile Shop, Prepaid Cell Phones Express and gift card businesses, is a new business in growth mode.\nPC Optimum : All PCF customers have the opportunity to earn PC Optimum Points that can be earned and redeemed in all LCL stores.\nLoblaws Inc. is a wholly-owned subsidiary of Loblaw Companies Limited (LCL). LCL is Canada s food and pharmacy leader, with a network of corporate and independently- operated stores in communities across the country, employing close to 200,000 Canadians. PCF is an important business unit within LCL that manages and develops products and service programs to improve the customer experience, maximize value, and provide a platform to enhance customer insights and relationships. PCF s vision is to provide superior value financial products to consumers.\nThe Analyst , Advanced Analytics is accountable for delivering tactical and strategic knowledge through multivariate statistical analysis.\nWhat you'll do\nManipulation and calculation of large complex data from various sources, convey complicated information concisely, simply with clarity, and deliver actionable insights that enable business partners to fully understand key drivers of business results\nConduct sophisticated multivariate analysis/ predictive modeling at product, portfolio, and customer level, and recommend appropriate actions to ensure profitable and sustainable business growth\nDesign, develop and evaluate business cases that consider multiple drivers and relay those drivers into accurate forecasts, and presented to varying audiences in order to move business idea forward\nCollaborate with the business areas to assess opportunities and measure results of campaigns & initiatives and ensure timely communication of strategic and operational results\nDevelop and implement statistical models using machine learning techniques that include linear/logistic regression, decision trees and k-means clustering analysis\n\nWhat you'll need\nBachelor s degree in quantitative discipline (e.g. computer science, engineering, statistics or other analytically based discipline). Master s degree in Business Analytics, Management Analytics or other professional designation is highly preferred.\nMinimum 3 years proven strong business analytical and modeling experience including statistical and segmentation analysis; data analysis and insight development; financial statement and competitive analysis\nMust be proficient with SAS, SQL, Data Warehouses on large datasets; R or Python, knowledge of SAS Enterprise Data Miner, Hadoop & HIVE are asset.\nAdvanced proficiency in MS Excel & VBA and building complex models for financial, portfolio analysis, and comprehensive business case evaluation.\nStrategic critical thinker with proven ability to think conceptually (use numbers to tell a story) and make meaning of complex data to develop insights and communicate results\nStrong communication skills and desire to work in cross-functional groups.\nExperience working with machine learning algorithms including linear/logistic regression, decision trees, k-means clustering analysis\n#LI-JD1\nCome and join a winning team who demonstrates innovation, energy, creativity and vision. We recognize the importance of a diverse workforce and we therefor encourage applications from Aboriginal Peoples, women, members of a visible minority and persons with a disability. We thank all applicants for their interest, however, only those selected for an interview will be contacted.\nNumber of Openings:\n1\nPC Financial recognizes Canada's diversity as a source of national pride and strength. We have made it a priority to reflect our nation s evolving diversity in the products we sell, the people we hire, and the culture we create in our organization. Accommodation is available upon request for applicants and colleagues with disabilities.\nIn addition, we believe that compliance with laws is about doing the right thing. Upholding the law is part of our Code of Conduct   it reinforces what our customers and stakeholders expect of us.\nPlease Note: If you have Employee Self Service (ESS) on Workday, apply to this job via the Workday application.", "link": "https://ca.indeed.com/viewjob?jk=7407746bfc7d1d43&from=serp&vjs=3"},
{"title": "Software Engineer II", "company": "LoyaltyOne", "descr": "Why Work with Us \nAre you passionate about Data and Reporting?\nAs part of Member Experience Reporting team, the Software Engineer will play a critical role in making Member Experience data available in Data Hub and providing reports and insights that will help drive business decisions.\nWhat you ll do \nCreate pipelines in databricks to transfer data to Data Hub\nSupport other departments by producing self-serve reports / dashboards in Tableau to drive results\nConduct analysis and deliver key insights to address business problems or understand underlying trends to help evolve business strategies or in support of new programs or initiatives\nPrepare high-quality reports and presentations targeted for specific audiences\nProactively highlight opportunities to develop and/or enhance existing tools and processes\nQualification:\nWho you are \nPost-secondary education with 1-2 years IT Application Development Experience\nAdvanced experience using Python, databricks Spark, SQL and Excel\nProficient experience with Word, MS Access (VBA programming), PowerPoint and relational databases (Oracle)\nFamiliarity with data warehouse and AWS (data lake) concepts\nKnowledge of key call center metrics/reporting and call center applications is an asset\nSolid analytical, logical and problem-solving skills\nStrong project management skills, with the ability to organize and prioritize multiple projects, competing requests and multiple tasks in a deadline-driven environment\nStrong written and oral communication skills\nWork independently in a fast-paced dynamic environment\nPossess an excellent work ethic and be self-motivated\nMust be able to travel between offices as necessary\nRequirement to work non-core hours from time-to-time (e.g. during application launch)\nReports are used for decision making purposes, therefore accuracy and the ability to meet timelines is crucial to the business\n\nAbout LoyaltyOne\nLoyaltyOne is part of the successful Alliance Data family of companies that provide the full range of data-driven loyalty, marketing and credit solutions in more than 80 locations across the globe.\nWorking with more than 100 leading brands in the retail, financial services, grocery, petroleum retail, travel and hospitality industries to profitably change customer behavior. Through a team of businesses, including one of the leading coalition loyalty programs in the world, the AIR MILES  Reward Program, LoyaltyOne designs, delivers and manages a suite of services focused on consumer data, customer-centric retail strategies, direct-to-consumer marketing, loyalty consulting and more.\nLoyaltyOne has broadened its horizons geographically by growing Precima in the European market. With the recent acquisition of BrandLoyalty in the Netherlands, LoyaltyOne has gained the expertise of a global leader in short-term loyalty campaigns, along with a client network that extends throughout Europe and Asia.\n\nAbout ADS\nAlliance Data  (NYSE: ADS) is a leading global provider of data-driven marketing and loyalty solutions serving large, consumer-based industries. The Company creates and deploys customized solutions, enhancing the critical customer marketing experience; the result is measurably changing consumer behavior while driving business growth and profitability for some of today's most recognizable brands. Alliance Data helps its clients create and increase customer loyalty through solutions that engage millions of customers each day across multiple touch points using traditional, digital, mobile and emerging technologies. An S&P 500 and Fortune 500 company headquartered in Plano, Texas, Alliance Data consists of three businesses that together employ more than 16,000 associates at approximately 100 locations worldwide. www.alliancedata.com\n\nAlliance Data is an Equal Employment Opportunity employer. Accordingly, we will make reasonable accommodations to respond to the needs of people with disabilities in accordance with legislation.\nAlliance Data participates in E-Verify.\nCheck us out   LoyaltyOne on Stack Overflow | LinkedIn | Glassdoor | Facebook |Twitter | Blog | Instagram", "link": "https://ca.indeed.com/viewjob?jk=1d23c7d2e7278485&from=serp&vjs=3"},
{"title": "Manager   Business Modelling", "company": "EY", "descr": "Canada TAS, Modelling Manager\n\n\nCompetitive business today is all about making intelligent, informed decisions. As a Modelling Manager you ll help make that happen. You will be an important part of our diversely talented, highly experienced team and work at the forefront of high-profile transactions and strategic decisions. Our team of advisors sits at the heart of a global Valuation, Modelling and Economics (VME) network of specialists who deliver high quality advice to our clients. Recognized as one of Canada s top employers, EY continually strives to be a great place to work.\n\n\nThe opportunity\n\nEY has an established industry leading VME group of over 1,500 people worldwide. We advise our clients on strategic financial decisions including buy vs build, strategic options, deal structure, predictive analytics. You will have the opportunity to develop your career through a broad scope of engagements, mentoring and formal learning. That s how we develop outstanding leaders who team to deliver on our promises to all our stakeholders, and in so doing, play a critical role in building a better working world for our people, for our clients and for our communities.", "link": "https://ca.indeed.com/viewjob?jk=865ba9c7d6a7a431&from=serp&vjs=3"},
{"title": "Senior Specialist, Process Innovation", "company": "Samsung Electronics", "descr": "Position Summary\nThe Senior Specialist in Process Innovation will review all operations and processes related to Retail, sales, Supply Chain Management (SCM), Logistics, Finance and Service to identify areas of improvement, develop action/project plans to address and follow through to implementation. This person will focus on value added projects to optimize the functional processes and the operational systems utilizing data driven analytics. The position will be a key liaison between Sales & Marketing, SCM, Logistics, Business Operations Center (BOC), Information Technology (MIS), Finance and Service and will interact with Samsung Corporate Headquarters(HQ), North American Headquarters (NAHQ), Samsung sister companies such as Samsung SDS, External Customers and 3rd party Vendors on projects they lead.\nRole and Responsibilities\nEssential Duties and Responsibilities:\nResponsible for the development of new Process Innovation Projects related to operation optimization and process efficiency and ensuring successful delivery of projects: Project Plan\nEnsures execution of projects developed\nResponsible to establish timelines, ownership, key milestones and to follow-up with stakeholders on all deliverables\nResponsible to monitor project execution and develops follow-up plan in case change/improvement are required based on the feedback\nResponsible for the adoption and coordination of new operational process or system changes ensuring alignment to HQ guidelines\nResponsible to resolve escalations through interaction with all levels within Sales and Marketing, SCM, Logistics, BOC, Finance and Service to ensure that needs are identified and immediate resolution found for critical SCM operational barriers\nCoordination of required System/process implementation\nTraining for new Process or functional system delivered by project\nImplementing a robust KPI monitoring system at Project end to measure short/long term results\nResponsible to present strategic ideas to executives, tactical plans to managers and operational tasks to employees in addition to gaining consensus from all levels of the organization\nReview and Coordinate the updates of new policies and procedures in GPPM\nKnowledge:\nEducation focused on a technical discipline is an asset (Computer Science, Engineering, etc)\nExpert Knowledge of Business Systems (SAP required, SFDC an asset)\nMS Office suite required, Strong Excel VBA, SQL an asset, R and Python an asset\nAbility to evaluate and analyze complex systems data and determine appropriate actions\nStrong interpersonal skills with the ability to influence without authority\nAdvanced in Microsoft Office (Excel, Access, PowerPoint, Visio, Word, Outlook),\nExperience:\nProject Management experience required (PMP an asset)\nLean Six Sigma experience an Asset\n3-5 years of work related experience supply chain processes and/or retail channel within electronics industry\nCompetencies:\nStrong Data analysis\nThe ability to develop and maintain excellent working relationships with multiple levels within and outside the company. Must be able to influence others in acceptance, approval, and providing project description.\nThe ability to plan, organize, and prioritize multiple assignments and projects.\nThe ability to work in a team environment to identify and achieve team project goals and results, including the completion of assignments within established time frames.\nDemonstrated ability to Interact with all levels within the organization\nStrong interpersonal and analytical skills\nSkills and Qualifications\nSamsung is an equal employment opportunity employer.\nSamsung has an accommodation process in place and provides accommodations for job applicants with disabilities as appropriate. Assessment and selection materials and procedures can be made available in accessible formats and methods as appropriate. If you require a specific accommodation because of disability or medical need, please let us know when selected to take part in our recruitment process so that reasonable arrangements can be made for the appropriate accommodations to be in place as you move through our process.\nWe thank you for your interest in working for Samsung. Only candidates selected for an interview will be contacted.\n#LI-DJ1\n#indhigh\n* Please visit Samsung membership to see Privacy Policy, which defaults according to your location. You can change Country/Language at the bottom of the page. If you are European Economic Resident, please click here .", "link": "https://ca.indeed.com/viewjob?jk=4e4071e6212274dd&tk=1d8uc20fd0j02000&from=serp&vjs=3&advn=4239586925542806&adid=192544934&sjdu=SiFHkPhkZXklx1BTeo8ye7P5n_-s08hrxMD-dtpZk1mNTAFRPpsSNCj5n5rye5lRDM3_fIKHIPOT2t6btmZj70bWxM9QQUtCzgscF56GXoaFNI8Kh2pSkVkX1-iPWXIQ8cmXIpoQ7ajHYZVrgXbVJkJ62_NkPPmsqUvzB3Ka2tTbj1wgapo-kDUYNzHRnF1l9owAEa2u-3z1BAnD3hr-jA"},
{"title": "Senior   Business Modelling", "company": "EY", "descr": "Canada TAS, Business Modelling Senior\n\n\nCompetitive business today is all about making intelligent, informed decisions. As a Business Modelling Senior, you ll help make that happen. You'd be an important part of our diversely talented, highly experienced team and work at the forefront of high-profile transactions. Our team of around 190 people sits at the heart of a global Valuation & Business Modelling network of over 1,550 specialists who deliver high quality advice through each phase of the transaction process.\n\n\nThe Opportunity\n\n\nUnderpinning everything is our focus on developing a talented team through investment in technical and commercial training and knowledge transfer. Within the team you will have the opportunity to take on client management responsibilities and have the potential to gain excellent career progression. As part of your role you would work a varied portfolio of Business Modelling and transaction decision-related projects, which would include model builds to assist clients with developing Excel-based business planning and forecasting models as part of their ongoing business needs. You d also work on model review services and these are predominantly transaction decision-focused, typically project finance or buy side for potential investors as well as getting involved with the wider team on project work. Although our team are largely Toronto based, we operate as a national team and many of our engagements involve multi-national clients. There would likely be travel in Canada and a requirement to work outside of the country from time to time.", "link": "https://ca.indeed.com/viewjob?jk=9bbf2fd8be7a746f&from=serp&vjs=3"},
{"title": "AVP, Portfolio and Risk Analytics", "company": "Manulife", "descr": "Are you looking for unlimited opportunities to develop and succeed? With work that challenges and makes a difference, within a flexible and supportive environment, we can help our customers achieve their dreams and aspirations.\nJob Description\nThe Middle Office of Global Derivative Services has the mandate to manage: 1) the ongoing derivatives valuation processes; 2) Potential Future Exposure (PFE) modeling; 3) hedge effectiveness assessment testing; and 4) Variable Annuity (VA) hedging reporting and operations. These four functions are performed for financial, regulatory, compliance and internal reporting purposes.\nThe Derivatives Valuation and Analytics function is accountable for ensuring correct ongoing valuation of all derivatives within the organization booked in the Findur system, offline, as well as for providing reporting on these positions to internal business users. The candidate will also have understanding of the daily PFE production that quantifies the counterparty credit risk of the firm s derivative trading activities, and understand performance attribution of derivative portfolios. In addition, the position is responsible for the on-going hedge assessment function, which includes effectiveness testing, hedge inception documentation, reporting, and managing the support systems involved. Due to its breadth, this role requires collaboration across the organization including interaction with front office, business units, risk, credit, finance, compliance, audit and technology personnel.\nReporting to the AVP, Derivatives Middle Office, this position is based in the Toronto head office and services the derivatives activity of both the General Account and Asset Management arms of the business.\nResponsibilities:\nWork closely with business units, portfolio managers and front office to assess requirements of valuing new and existing derivatives positions, sensitivity analysis for existing positions;\nInterface with Models & Analytics, Market Risk Management and Derivatives Operations teams to implement new curves and models in the Findur pricing system;\nWork with the Derivatives Solutions team to support the setup of technology to facilitate trading of new derivative product types;\nConduct risk testing and scenario analysis for internal business units;\nMonitor and report derivatives positions to satisfy regulatory and compliance requirements;\nDevelop and maintain controls to ensure derivatives are valued correctly in the system;\nReconcile mark-to-market differences with the counterparty and communicate issues to Collateral and Investment Risk teams;\nTake ownership of projects to enhance risk controls and reporting;\nContinuously evaluate, identify and recommend practices and controls that will increase process efficiency and mitigate financial and operational risks;\nEnhance Findur system capabilities to support effectiveness testing for new hedge accounting strategies;\nDevelop a control framework to ensure hedge relationships are tracked and properly processed for financial reporting;\nReview automated hedge effectiveness assessment testing at quarter ends and perform manual testing as needed;\nImplement financial models and curves for pricing derivative trades and computing potential future exposure in Findur;\nPerform impact analysis on PFE of proposed trades as requested by front office;\nPrepare daily VAH Hedging Performance Attribution reports, macro hedging reports, and design and implement ongoing enhancement to those reports.\nSupport daily VA Hedging operations and prepare / distribute weekly, quarterly and annual reporting to senior management and affected business units.\nAssist with process updates for PFE engine parameter calibration and maintenance, and conduct pre-deal checks for front office as needed;\nProvide leadership and mentoring to junior team members;\nDevelop work plans that prioritize business needs of all stakeholders, establish project deliverables, timelines, and budget;\nExercise judgment in identifying issues, modifying plans as demands change, assessing courses of action, and developing recommendations;\nParticipate in ad-hoc projects across groups as needed. Support the assignments above for both the General Accounts and Manulife Asset Management.\nKnowledge/Skills/Competencies/Education:\nEducation and Experience Requirements\nEducation in business finance, quantitative finance or statistical analysis (Masters in Financial Engineering / Mathematical Finance / Statistics) or other quantitative discipline.\nSix to ten years of hands-on experience with derivative products. Familiarity with derivative instruments including futures, equity options, FX forwards, OTC and centrally cleared interest rate swaps, swaptions, bond forwards, cross-currency and total return swaps, interest rate caps & floors, FX options, and credit default swaps.\nSimilar levels of experience with derivative pricing curve construction, including projection and discounting curves, LIBOR and OIS swap curves, FX forward points, repo curves, cross currency basis spreads, inflation curves, survival and recovery curves, dividend curves and volatility surfaces/cubes.\nFamiliarity with derivative trading and collateral agreements such as Clearing Agreements and ISDAs/ CSAs.\nAdvanced knowledge of derivative valuation models including Black-Scholes, Hull-White, normal swaption, Asian floor, and standard quanto;\nUnderstand statistical / stochastic models of risk factors for computing changes in credit exposures of derivatives in PFE calculations;\nExperience with hedge effectiveness assessment testing and performance attribution analysis for derivatives;\nCFA and/or FRM/ PRM designations preferred.\nTechnical Skills\nProgramming experience in VBA, SQL, EXCEL, MATLAB and/or Python an asset.\nAn understanding of market data setup and market conventions.\nExperience with Findur system an asset.\nManagement and Personal Effectiveness\nExcellent analytical and problem-solving skills.\nSolid organizational skills and high degree of professionalism combined with the ability to readily adapt to changing environments and deal with competing priorities.\nExcellent communication and documentation skills. A team player with demonstrated abilities for building and maintaining good working relationships both internally and externally, and up, down and across a large organization.\nDemonstrated ability and experience managing and coaching several direct reports (preferably in other locations) and leading a team of highly educated professionals.\n\nIf you are ready to unleash your potential it s time to start your career with Manulife/John Hancock.\n\nAbout Manulife\n\nManulife Financial Corporation is a leading international financial services group that helps people achieve their dreams and aspirations by putting customers' needs first and providing the right advice and solutions. We operate as John Hancock in the United States and Manulife elsewhere. We provide financial advice, insurance, as well as wealth and asset management solutions for individuals, groups and institutions. At the end of 2016, we had approximately 35,000 employees, 70,000 agents, and thousands of distribution partners, serving more than 22 million customers. At the end of 2016, we had $977 billion (US$728 billion) in assets under management and administration, and in the previous 12 months we made almost $26 billion in payments to our customers.\n\n\nOur principal operations are in Asia, Canada and the United States where we have served customers for more than 100 years. With our global headquarters in Toronto, Canada, we trade as 'MFC' on the Toronto, New York, and the Philippine stock exchanges and under '945' in Hong Kong.\n\nManulife is committed to supporting a culture of diversity and accessibility across the organization. It is our priority to remove barriers to provide equal access to employment. A Human Resources representative will consult with applicants contacted to participate at any stage of the recruitment process who request an accommodation. Information received regarding the accommodation needs of applicants will be addressed confidentially.", "link": "https://ca.indeed.com/viewjob?jk=2ba6b8987074bb6f&from=serp&vjs=3"},
{"title": "Director and Actuary, GVAH", "company": "Manulife", "descr": "Are you looking for unlimited opportunities to develop and succeed? With work that challenges and makes a difference, within a flexible and supportive environment, we can help our customers achieve their dreams and aspirations.\nJob Description\nTitle: Director (Manager), Actuarial Modelling, Global VA Hedging\nFunction: Actuarial\nLocation: Toronto only\nPosition Overview:\nGlobal Variable Annuity Hedging (GVAH) is responsible for establishing and leading the VA dynamic hedge programs at Manulife Financial. The role belongs to the Investment Division and reports to the AVP & Actuary, Global VA Hedging. It provides the opportunity to develop a deep understanding of various aspects of VA, such as product features, hedging strategies, financial reporting, capital and modelling. It also provides the opportunity to build relationships with several corporate areas and business units.\nThe Actuarial Modelling Team in Global VA Hedging has the following mandate:\nHedging of VA products with guaranteed value of C$72bn\nActuarial analysis of fair market value of VA liabilities, and its sensitivities to various market-based risk factors (Greeks). You can finally make use of your IFM exam knowledge.\nUtilize SoE-type analysis to provide actuarial insights for hedging performance and developing hedging strategies.\nUtilize the unique knowledge of both assets and liabilities to optimize hedging decisions\nProvide forward-looking insights to anticipate trends that will have material impact on our hedging framework (e.g. IFRS 17, market depth issues and new tradeable assets)\nBecome a master user of our homegrown hedging systems,.Test and implement changes to hedging models and systems to extend modelling and hedging capabilities\nMake recommendations on inforce management initiatives (e.g. buyback programs, reinsurance)\nMonitor currently unhedged business for opportunistic migration into the hedging program\nTo be a source of actuarial expertise on all issues related to VA. Interact with several group functions and business units from diverse backgrounds.\nThis role is ideal for a good team player who is highly motivated and would like to participate in high profile projects relating to VA hedging. There are opportunities to gain exposure to topical and emerging actuarial issues such as IFRS 17. The candidate will have the opportunity to develop critical and transferable skills: quantitative, communication, systems, programming and strategic thinking.\nResponsibilities:\nTake on a leadership role in the implementation of a new hedging model.\nTest and implement improvements to existing hedging models and daily hedging operations.\nTake steps to ensure Manulife is ready for VA hedging under an IFRS 17 framework.\nReviewing hedging liability grid results and assist with performance attribution\nWork with GVAH Strategy Team to develop and quantify impacts of new hedging strategies\nInteract with Corporate Actuarial, Capital, Corporate Risk, and Business Unit Modelling and Valuation teams to validate and explain hedging results\nUpdate and propose changes to the equity option and swaption calibration methods and assumptions\nRespond effectively to time sensitive requests for information from Management\nLead VA hedging projects as needed\nSupport regular stress testing and reporting of liabilities and Greeks\nQualifications:\nFSA/FCIA or equivalent. Quantitative Modeller / Financial Mathematician with actuarial foundation and experience will also be considered.\nMinimum 5 years of experience in the financial services industry\nStrong actuarial, analytical, and problem-solving skills\nProactive and able to work both independently and with teams\nStrong communication and relationship building skills to work with multiple partners from various backgrounds at the same time.\nOrganized and capable to handle complex processes\nBasic knowledge of capital market instruments including futures, swaps, options and swaptions\nKnowledge of Python, VBA and SQL is useful\nStochastic modelling and quantitative modelling knowledge are assets\n\nIf you are ready to unleash your potential it s time to start your career with Manulife/John Hancock.\n\nAbout Manulife\n\nManulife Financial Corporation is a leading international financial services group that helps people achieve their dreams and aspirations by putting customers' needs first and providing the right advice and solutions. We operate as John Hancock in the United States and Manulife elsewhere. We provide financial advice, insurance, as well as wealth and asset management solutions for individuals, groups and institutions. At the end of 2016, we had approximately 35,000 employees, 70,000 agents, and thousands of distribution partners, serving more than 22 million customers. At the end of 2016, we had $977 billion (US$728 billion) in assets under management and administration, and in the previous 12 months we made almost $26 billion in payments to our customers.\n\n\nOur principal operations are in Asia, Canada and the United States where we have served customers for more than 100 years. With our global headquarters in Toronto, Canada, we trade as 'MFC' on the Toronto, New York, and the Philippine stock exchanges and under '945' in Hong Kong.\n\nManulife is committed to supporting a culture of diversity and accessibility across the organization. It is our priority to remove barriers to provide equal access to employment. A Human Resources representative will consult with applicants contacted to participate at any stage of the recruitment process who request an accommodation. Information received regarding the accommodation needs of applicants will be addressed confidentially.", "link": "https://ca.indeed.com/viewjob?jk=0946170a9f240dc1&from=serp&vjs=3"},
{"title": "Manager, Internal Capital and Credit Analytics", "company": "Scotiabank", "descr": "Requisition ID: 59728\nJoin the Global Community of Scotiabankers to help customers become better off.\nPURPOSE:\nThe Manager takes initiatives to evaluate and improve internal capital methodologies for more effective capital measures and better tools for business decision and capital management. This role primarily involves the development and production work around internal capital analytics and measurement. There is also work associated to validating and analyzing the metrics produced and the cause for the changes.\nKEY ACCOUNTABILITIES:\nImplement changes on credit risk capital models for both retail and non-retail portfolios. Assist the production of all regular and \"on demand\" deliverables for internal clients, including E.O. Finance, GBM Loan Portfolio Management, GBM Client Measurement, and GRM Executives.\nProvide support to business lines on capital methodology and contribute to their business growth. Explain, seek feedback and provide diagnostics and analytical supports to allow business to use capital more efficiently.\nSupport the design and implementation of capital production initiatives and projects. This involves collaborating with other stakeholders such as technology and modeling teams.\nProvide ongoing support pertaining to credit capital, losses, ROEE/RORC, and active portfolio management for various Bank departments. Provide analytics and solutions on credit risk related issues of specific interest to Executive and Senior Management.\nImplementation of stress testing for credit risk capital on a quarterly basis and as part of Enterprise Wide Stress Testing (EWST).\nContribute to business growth by providing independent capital analysis for one off transactions or transactions proposed to reduce risk and capital.\nDevelop and maintain the documentation of capital models. Review and evaluate technical implementation, results, and functional credit capital documentation.\nMaintain compliance with relevant internal policies, procedures and regulatory requirements. Contribute to timely resolution of audit and regulatory issues.\nKeep abreast with advances in credit risk analytics developments, products and applications by vendors, consultants, regulatory agencies and competitors.\nEDUCATION/WORK EXPERIENCE/DESIGNATIONS:\nPostgraduate degree in a quantitative discipline such as Math, Physics, Computer Science or other quantitative areas\nPreferred work experience: 3 years + of relevant analytical work experience\nREQUIRED FUNCTIONAL/TECHNICAL COMPETENCIES:\nStrong knowledge of relational database application and development, data integration, and process automation. Proficient in working with large datasets is an asset.\nTechnical proficiency with Excel, Access, PowerPoint, Visio, SQL, VBA, Java, C++, Python and R.\nAdvanced knowledge of portfolio credit risk modeling theories and applications - including their business implications and limitations. Previous experience with Moody's Analytics Risk Frontier is an asset.\nExcellent written and presentation skills in order to report findings, make recommendations, and provide insightful viewpoints to Executive and Senior Management, as well as to provide training/explanation to various internal users of credit risk analytics, and to liaise with industry participants and other external parties.\nKnowledge of the Bank's policies, practices, and products as well as regulatory requirements and expectations pertaining to credit risk analytics.\nRequired Behavioral Competencies:\nAbility to manage multiple priorities to ensure timely completion of planned deliverables (e.g. regular reports and analytics development milestones) as well as efficient response to ad hoc requirements that arise from time to time.\nForward and independent thinking to identify requirements on credit risk analytics and associated opportunities for the Bank to reduce regulatory burden and economic risk as well as to enhance profitability and reputation.\nCollaborative and consensus-building skills, in particular with other Bank departments and external organizations.\nFlexibility and creativity in problem solving, innovation and path-finding ability.\nStrong project management skills and demonstrates accountability.\nLocation(s): Canada : Ontario : Toronto\nAs Canada s International Bank, we are a leader when it comes to inclusion. We are a diverse and global team, speaking more than 100 languages with backgrounds from more than 120 countries. We value the unique skills and experiences each individual brings to the bank, and are committed to creating and maintaining an inclusive and accessible environment for everyone. Candidates selected for an interview will be contacted directly. If you require accommodation during the recruitment and selection process, please let us know. We will work with you to provide as seamless a recruitment experience as possible.", "link": "https://ca.indeed.com/viewjob?jk=77c78b76bf026fae&from=serp&vjs=3"},
{"title": "Software Engineer II", "company": "LoyaltyOne", "descr": "Description:\n\nWhy Work with Us \nAre you passionate about Data and Reporting?\nAs part of Member Experience Reporting team, the Software Engineer will play a critical role in making Member Experience data available in Data Hub and providing reports and insights that will help drive business decisions.\nWhat you ll do \nCreate pipelines in databricks to transfer data to Data Hub\nSupport other departments by producing self-serve reports / dashboards in Tableau to drive results\nConduct analysis and deliver key insights to address business problems or understand underlying trends to help evolve business strategies or in support of new programs or initiatives\nPrepare high-quality reports and presentations targeted for specific audiences\nProactively highlight opportunities to develop and/or enhance existing tools and processes\nQualification:\nWho you are \nPost-secondary education with 1-2 years IT Application Development Experience\nAdvanced experience using Python, databricks Spark, SQL and Excel\nProficient experience with Word, MS Access (VBA programming), PowerPoint and relational databases (Oracle)\nFamiliarity with data warehouse and AWS (data lake) concepts\nKnowledge of key call center metrics/reporting and call center applications is an asset\nSolid analytical, logical and problem-solving skills\nStrong project management skills, with the ability to organize and prioritize multiple projects, competing requests and multiple tasks in a deadline-driven environment\nStrong written and oral communication skills\nWork independently in a fast-paced dynamic environment\nPossess an excellent work ethic and be self-motivated\nMust be able to travel between offices as necessary\nRequirement to work non-core hours from time-to-time (e.g. during application launch)\nReports are used for decision making purposes, therefore accuracy and the ability to meet timelines is crucial to the business\n\nAbout LoyaltyOne\nLoyaltyOne is part of the successful Alliance Data family of companies that provide the full range of data-driven loyalty, marketing and credit solutions in more than 80 locations across the globe.\nWorking with more than 100 leading brands in the retail, financial services, grocery, petroleum retail, travel and hospitality industries to profitably change customer behavior. Through a team of businesses, including one of the leading coalition loyalty programs in the world, the AIR MILES  Reward Program, LoyaltyOne designs, delivers and manages a suite of services focused on consumer data, customer-centric retail strategies, direct-to-consumer marketing, loyalty consulting and more.\nLoyaltyOne has broadened its horizons geographically by growing Precima in the European market. With the recent acquisition of BrandLoyalty in the Netherlands, LoyaltyOne has gained the expertise of a global leader in short-term loyalty campaigns, along with a client network that extends throughout Europe and Asia.\n\nAbout ADS\nAlliance Data  (NYSE: ADS) is a leading global provider of data-driven marketing and loyalty solutions serving large, consumer-based industries. The Company creates and deploys customized solutions, enhancing the critical customer marketing experience; the result is measurably changing consumer behavior while driving business growth and profitability for some of today's most recognizable brands. Alliance Data helps its clients create and increase customer loyalty through solutions that engage millions of customers each day across multiple touch points using traditional, digital, mobile and emerging technologies. An S&P 500 and Fortune 500 company headquartered in Plano, Texas, Alliance Data consists of three businesses that together employ more than 16,000 associates at approximately 100 locations worldwide. www.alliancedata.com\n\nAlliance Data is an Equal Employment Opportunity employer. Accordingly, we will make reasonable accommodations to respond to the needs of people with disabilities in accordance with legislation.\nAlliance Data participates in E-Verify.\nCheck us out   LoyaltyOne on Stack Overflow | LinkedIn | Glassdoor | Facebook |Twitter | Blog | Instagram", "link": "https://ca.indeed.com/viewjob?jk=868b0b6f130afcd7&tk=1d8uc20o40j02001&from=serp&vjs=3&advn=7042723621657021&adid=276050144&sjdu=i6xVERweJM_pVUvgf-Mzud6v7vx4W2vba62rTobId37eIK82uw1XRT7m-D8lI0g6"},
{"title": "Test Automation Architect", "company": "HCL America Inc", "link": "https://www.indeed.ca/cmp/HCL-Technologies/jobs/Test-Automation-Architect-3c599e734b2f5519?vjs=3"},
{"title": "Upcoming Opportunities   Senior Actuarial Analysts, Team Leads and Data Scientists   Greater Toronto", "company": "Johnson", "link": "https://www.indeed.ca/viewjob?jk=41ab41bb5ff06bb5&from=serp&vjs=3"},
{"title": "Upcoming Opportunities   Senior Actuarial Analysts, Team Leads and Data Scientists   Greater Toronto", "company": "RSA", "link": "https://ca.indeed.com/viewjob?jk=bfa0f63459b7706a&from=serp&vjs=3"},
{"title": "Senior Specialist, Process Innovation", "company": "Samsung Electronics", "descr": "Position Summary\nThe Senior Specialist in Process Innovation will review all operations and processes related to Retail, sales, Supply Chain Management (SCM), Logistics, Finance and Service to identify areas of improvement, develop action/project plans to address and follow through to implementation. This person will focus on value added projects to optimize the functional processes and the operational systems utilizing data driven analytics. The position will be a key liaison between Sales & Marketing, SCM, Logistics, Business Operations Center (BOC), Information Technology (MIS), Finance and Service and will interact with Samsung Corporate Headquarters(HQ), North American Headquarters (NAHQ), Samsung sister companies such as Samsung SDS, External Customers and 3rd party Vendors on projects they lead.\nRole and Responsibilities\nEssential Duties and Responsibilities:\nResponsible for the development of new Process Innovation Projects related to operation optimization and process efficiency and ensuring successful delivery of projects: Project Plan\nEnsures execution of projects developed\nResponsible to establish timelines, ownership, key milestones and to follow-up with stakeholders on all deliverables\nResponsible to monitor project execution and develops follow-up plan in case change/improvement are required based on the feedback\nResponsible for the adoption and coordination of new operational process or system changes ensuring alignment to HQ guidelines\nResponsible to resolve escalations through interaction with all levels within Sales and Marketing, SCM, Logistics, BOC, Finance and Service to ensure that needs are identified and immediate resolution found for critical SCM operational barriers\nCoordination of required System/process implementation\nTraining for new Process or functional system delivered by project\nImplementing a robust KPI monitoring system at Project end to measure short/long term results\nResponsible to present strategic ideas to executives, tactical plans to managers and operational tasks to employees in addition to gaining consensus from all levels of the organization\nReview and Coordinate the updates of new policies and procedures in GPPM\nKnowledge:\nEducation focused on a technical discipline is an asset (Computer Science, Engineering, etc)\nExpert Knowledge of Business Systems (SAP required, SFDC an asset)\nMS Office suite required, Strong Excel VBA, SQL an asset, R and Python an asset\nAbility to evaluate and analyze complex systems data and determine appropriate actions\nStrong interpersonal skills with the ability to influence without authority\nAdvanced in Microsoft Office (Excel, Access, PowerPoint, Visio, Word, Outlook),\nExperience:\nProject Management experience required (PMP an asset)\nLean Six Sigma experience an Asset\n3-5 years of work related experience supply chain processes and/or retail channel within electronics industry\nCompetencies:\nStrong Data analysis\nThe ability to develop and maintain excellent working relationships with multiple levels within and outside the company. Must be able to influence others in acceptance, approval, and providing project description.\nThe ability to plan, organize, and prioritize multiple assignments and projects.\nThe ability to work in a team environment to identify and achieve team project goals and results, including the completion of assignments within established time frames.\nDemonstrated ability to Interact with all levels within the organization\nStrong interpersonal and analytical skills\nSkills and Qualifications\nSamsung is an equal employment opportunity employer.\nSamsung has an accommodation process in place and provides accommodations for job applicants with disabilities as appropriate. Assessment and selection materials and procedures can be made available in accessible formats and methods as appropriate. If you require a specific accommodation because of disability or medical need, please let us know when selected to take part in our recruitment process so that reasonable arrangements can be made for the appropriate accommodations to be in place as you move through our process.\nWe thank you for your interest in working for Samsung. Only candidates selected for an interview will be contacted.\n#LI-DJ1\n#indhigh\n* Please visit Samsung membership to see Privacy Policy, which defaults according to your location. You can change Country/Language at the bottom of the page. If you are European Economic Resident, please click here .", "link": "https://ca.indeed.com/viewjob?jk=4e4071e6212274dd&tk=1d8uc21j20j02002&from=serp&vjs=3&advn=4239586925542806&adid=192544934&sjdu=SiFHkPhkZXklx1BTeo8ye7P5n_-s08hrxMD-dtpZk1mNTAFRPpsSNCj5n5rye5lRDM3_fIKHIPOT2t6btmZj70bWxM9QQUtCzgscF56GXoaFNI8Kh2pSkVkX1-iPWXIQ8cmXIpoQ7ajHYZVrgXbVJkJ62_NkPPmsqUvzB3Ka2tTbj1wgapo-kDUYNzHRnF1l9owAEa2u-3z1BAnD3hr-jA"},
{"title": "Data Scientist / Sr. Data Scientist", "company": "Manulife", "descr": "Are you looking for unlimited opportunities to develop and succeed? With work that challenges and makes a difference, within a flexible and supportive environment, we can help our customers achieve their dreams and aspirations.\nJob Description\nGeneral Accountability:\nThis position is accountable for the development and implementation of advanced analytic models to improve business process, and to generate insight in order to support the strategy & goals of Group Functions. This position will provide analytics thought leadership, coaching to the Data Scientists & Analysts and support the development of the capabilities of the team. Additional responsibilities include the development of documentation & measurement framework.\nResponsibilities:\nDevelop & implement models to support Group Functions strategy and business pillar initiatives\nDevelop advanced analytics models in order to maximize ROI, revenue and overall profitability.\nPerform needs analysis with business area (understand business problem & generate hypotheses)\nExplore, generate & source data relevant to the hypothesis(internal, external, 3rd party)\nCreate, assess, evaluate & Iteratively improve models\nCalculate model impact/ROI\nPeer review other Data scientists work\nLeverage sound judgment, balancing analysis effort vs incremental improvement\nMeasure & communicate analytic results & impact of analytics models\nImplement measurement & documentation framework against all project work\nGenerate insights in such a way that the businesses can clearly understand the quantifiable value. Enable the business to make clear trade-offs between and among choices, with a reasonable view into the most likely outcomes of each.\nTurn statistical and computational analysis into user-friendly graphs, charts, and animation. Enable those who aren t professional data analysts to effectively interpret data. Ability to communicate results and educate others through reports and presentations\nProvide thought leadership around analytics methodology, tools, and measurement\nLeverage extensive theoretical and practical knowledge of advanced analytic methods and algorithms, understanding their utility in different problem domains (sparse data, rare event detection, etc), evaluation methodologies and pitfalls, and stays on top of industry & academic developments.\nInnovate & find creative ways to source & leverage data to support modeling efforts, leveraging structured & unstructured data, and big data technologies.\nCollaborate with internal stakeholders to develop tools and services such as modeling, dashboard development, decision aids and business case analysis to drive innovation, strategic initiatives and recommend solutions.\nCoach & provide guidance to Data Scientists & Data Analysts\nLeverage depth of experience in business, technical & analytical problem solving to support & coach other team members.\nQualifications:\nPost grad in Statistics, Math, Comp Sci, Engineering or other related discipline (PhD preferred)\nMinimum of 10 years' experience specifically in statistical/data analysis and data mining, predictive modeling, cluster analysis, optimization\nAdvanced Experience in Python, R, SAS, SQL, Java, , VBA\nTrack of record of delivering innovative analytical insights to lines of businesses\nStrong commitment to organizational success and team work\nAdaptable and open to change with strong collaboration and elaboration skills\nDemonstrated data transformation & manipulation experience\nStrong Knowledge of strategic marketing, data, audience targeting, segmentation, and customer analysis. Familiarity of vendors that operate in this space\nInsurance or Financial Services industry experience preferred.\nDemonstrated experience exhibiting innovation and leadership in proposing new strategies and/or tactics based on analysis findings\nExperience with Big Data platforms desired\nExperience with analysis of unstructured data desired\n\nIf you are ready to unleash your potential it s time to start your career with Manulife/John Hancock.\n\nAbout Manulife\n\nManulife Financial Corporation is a leading international financial services group that helps people achieve their dreams and aspirations by putting customers' needs first and providing the right advice and solutions. We operate as John Hancock in the United States and Manulife elsewhere. We provide financial advice, insurance, as well as wealth and asset management solutions for individuals, groups and institutions. At the end of 2016, we had approximately 35,000 employees, 70,000 agents, and thousands of distribution partners, serving more than 22 million customers. At the end of 2016, we had $977 billion (US$728 billion) in assets under management and administration, and in the previous 12 months we made almost $26 billion in payments to our customers.\n\n\nOur principal operations are in Asia, Canada and the United States where we have served customers for more than 100 years. With our global headquarters in Toronto, Canada, we trade as 'MFC' on the Toronto, New York, and the Philippine stock exchanges and under '945' in Hong Kong.\n\nManulife is committed to supporting a culture of diversity and accessibility across the organization. It is our priority to remove barriers to provide equal access to employment. A Human Resources representative will consult with applicants contacted to participate at any stage of the recruitment process who request an accommodation. Information received regarding the accommodation needs of applicants will be addressed confidentially.", "link": "https://ca.indeed.com/viewjob?jk=e5ec98e98da8a515&from=serp&vjs=3"},
{"title": "Manager Counterparty Credit Risk Capital", "company": "BMO Financial Group", "descr": "Mandate:\nDaily operations and system enhancements, create and participate in development of testing requirements and validation of implementation of capital requirements for Counterparty Credit Risk Capital. Identify opportunities for, and lead the enhancement for capital methodologies for quantifying counterparty credit risk capital across all trading products so that the accuracy and reliability of capital and consequent business decisions reliant upon these data are enhanced.\nKEY ACCOUNTABILITIES\n Implement tools for, and perform, driver analysis for the capital changes based on production operations\nInterpret the regulatory requirement and provide analytical solutions\nTranslate the business solutions into technical requirement, i.e. write business requirement\nSupport the implementation process, and provide seamless communication with technology developer .\nCr eate test plan including the test scenarios and sample data to support the testing scenarios\nPerform the testing across the entire testing cycle to ensure business requirements are met\nIdentify issues and propose solutions\nAnalyze the test result and communicate the result to senior management\nDocument procedures, control processes, and policies relevant to internal controls\nContinuously improve understanding of subject matter relating to Counterparty Credit Risk monitoring and Basel III RWA / capital calculations\nCROSS-FUNCTIONAL RELATIONSHIPS\nTechnology & Operations;\nCorporate Risk Management directors and managers;\nCapital Markets Trading Lines of Business\nCredit Portfolio Managers and Account Managers\nExternal system software vendors\nModel Validation\nMarket Risk internal teams   infrastructure, process and governance, etc.\nROLE DIMENSIONS:\nThis role has direct or in-direct impact on the following financial measures:\n Regulatory capital ;\nEconomic and regulatory capital;\nCounterparty credit risk exposure measurements;\nQualifications\nKNOWLEDGE AND SKILLS:\nMust-Have Skills:\n 3+ years of related work experience in a financial institution\nStrong knowledge with financial products, specifically possessing knowledge of derivatives ( OTC) as well as SFT\nStrong Experience working with BASEL III and OSFI CAR Guideline\nStrong Experience with CCR, CCR Capital ( CEM, SA-CCR) is a MUST\nExperience on BCAR\nAdvanced knowledge of Excel, VBA, SQL, Database Concepts\nAdvanced Python programming experience\nParticipation in mid-scale/large IT development projects, with hands-on experience in conducting testing\nStrong capability of writing business requirement and test plans\nStrong capability of creating mock-up data required to test the pre-specified cases\nNice-to-Have Skills:\nBroad understanding of risk management methodologies\nExperience in using work tracking systems (e.g. JIRA, HPQC) would be an advantage\nExperience in an Agile and fast-paced environment\nSoft Skills :\nStrong analytic and troubleshooting skill s with a solution oriented attitude\nSelf-motivated and take ownership\nGood self-organization skills including planning, scheduling, managing priorities and meeting deadlines\nGood oral and written communication skills .\nStrong interpersonal skills and ability to function effectively within a team, and work with multiple stakeholders.\nCurios, dynamic, focused, proactive, detail-oriented\nEducational Requirements/Professional Certifications:\nAdvanced university degree, preferably in a quantitative field, such as Mathematics, Statistics, Science or Engineering.\nCFA, FRM, PRM designation or working towards one of those or similar ones would be an asset\nWe re here to help\nAt BMO we have a shared purpose; we put the customer at the centre of everything we do   helping people is in our DNA. For 200 years we have thought about the future the future of our customers, our communities and our people. We help our customers and our communities by working together, innovating and pushing boundaries to bring them our very best every day. Together we re changing the\n\nway people think about a bank.\nAs a member of the BMO team you are valued, respected and heard, and you have more ways to grow and make an impact. We strive to help you make an impact from day one   for yourself and our customers. We ll support you with the tools and resources you need to reach new milestones, as you help our customers reach theirs. From in-depth training and coaching, to manager support and network-building opportunities, we ll help you gain valuable experience, and broaden your skillset.\nTo find out more visit us at https://bmocareers.com .\nBMO is committed to an inclusive, equitable and accessible workplace. By learning from each other s differences, we gain strength through our people and our perspectives. Accommodations are available on request for candidates taking part in all aspects of the selection process. To request accommodation, please contact your recruiter.\nJob\n Data Sciences\nPrimary Location\n Canada-Ontario-Toronto\nOrganisation\n ERPM-X000073\nSchedule\n full-time\nJob Posting\n 04/12/19\nUnposting Date\n 06/07/19", "link": "https://ca.indeed.com/viewjob?jk=5c8f35df4cae5cbd&from=serp&vjs=3"},
{"title": "Campaign Optimization and Analytics Manager", "company": "MediaNet ", "descr": "Manage your campaign portfolio to ensure agreed upon timelines and performance goals can be met\nContinuously iterate campaign design to optimize both delivery and performance leveraging any and all analytical and discovery tools/techniques and platform features at your disposal\nMaintain a culture of risk management and control, supported by adherence to and evolution of established internal processes and infrastructure\nThoroughly document and keep account teams updated on campaign performance, growth opportunities, issue resolution and optimization actions\nPrepare for and present weekly internal reviews of account performance across tactics, revenue, KPIs, pacing and key learnings\nDevelop executive-level post-campaign reports that communicate insights in a clear, concise and valid way so that your team and clients can effectively incorporate those insights into improved campaign planning and design\nContribute to the ongoing development of processes and best practices concerning campaign design, quality assurance, testing methodologies, and reporting and optimization approaches to ensure the fullest impact and efficiency of both client investments and internal workflows\nMaintain a high degree of technical proficiency and knowledge across the platforms and toolsets within which you will be working\nKeep on top of industry trends and current events that may impact client business\nWho you are\nYou have high personal and professional standards, a strong work ethic and are committed to delivering excellence\nYou are the ultimate team player who enjoys sharing knowledge with others\nYou are a natural problem solver who enjoys puzzles and a good challenge\nYou are an excellent communicator who is able to convey complex technical concepts in simple terms\nYou have a high degree of creativity, self-motivation and drive\nYou have the natural eagerness and flexibility to learn and grow in a team environment that will be rapidly changing\nWhat you need to apply\n2-4 years working experience in a similar or analytical role\nBachelor's or Master s degree in a quantitative discipline (mathematics, statistics)\nExtensive experience with Excel/pivot tables\nExperience with VBA/Excel Macros and R or Python\nExcellent diagnostic and troubleshooting skills\nExcellent PowerPoint presentation-crafting and storytelling skills\nHigh degree of creativity, self-motivation and drive\nTechnical acumen required to understand how to execute campaigns in a way that optimizes the use of our platform\nYou \"live for\" the numbers and have a high natural attention to detail\nStrong quantitative, analytical, data interpretation and research skills\nStrong organizational and time-management skills\nProfessional oral and written communication skills; impeccable written and spoken English\nBonus!\nExperience in a digital media analytics role\nFamiliarity with BI dashboard development\nFamiliarity with REST and JSON APIs\nClient facing experience\nKnowledge of digital media landscape, including key technologies, business models, standards/guidelines, technology platforms and products\nDirect experience with ad serving technology and/or working in an RTB ad exchange, DSP or trading-desk environment\nHands-on experience working in the DoubleClick or AdWords platform environments\nUnderstanding of media strategy, digital campaign workflows and an appreciation for marketer considerations like contextual relevance and brand safety\nThe MediaNet work environment is warm, inviting and collaborative. Everyone at MediaNet has a voice, and we encourage new ways of thinking that will lead to improved organizational performance and client success. MediaNet team members are empowered with development, support and mentoring opportunities that enable us to push critical thinking and problem solving out to the edges of our organization. We believe that the future of media is digital, and that the future of digital is rooted in a holistic, programmatically-led approach that is built around the consumer above all else.", "link": "https://www.indeed.ca/viewjob?jk=e57c18b773a34f95&from=serp&vjs=3"},
{"title": "Test Automation Architect", "company": "HCL America Inc", "link": "https://www.indeed.ca/cmp/HCL-America-Inc/jobs/Test-Automation-Architect-3c599e734b2f5519?sjdu=vQIlM60yK_PwYat7ToXhk-QupQFnb8b_tsK3nTDMOrqXoXRzY-VTwf26bWv2KUQtxE0XzjpMiqtAKJtr6OvdSfRXnJP1gKhlBc5kg2DOpKs&adid=269051460&vjs=3"},
{"title": "Prochaines occasions   analystes en actuariat principaux, chefs d quipe et scientifiques de donn es", "company": "Johnson", "link": "https://www.indeed.ca/viewjob?jk=eb1ab6c62ec89b9a&from=serp&vjs=3"},
{"title": "Senior Specialist, Process Innovation", "company": "Samsung Electronics", "descr": "Position Summary\nThe Senior Specialist in Process Innovation will review all operations and processes related to Retail, sales, Supply Chain Management (SCM), Logistics, Finance and Service to identify areas of improvement, develop action/project plans to address and follow through to implementation. This person will focus on value added projects to optimize the functional processes and the operational systems utilizing data driven analytics. The position will be a key liaison between Sales & Marketing, SCM, Logistics, Business Operations Center (BOC), Information Technology (MIS), Finance and Service and will interact with Samsung Corporate Headquarters(HQ), North American Headquarters (NAHQ), Samsung sister companies such as Samsung SDS, External Customers and 3rd party Vendors on projects they lead.\nRole and Responsibilities\nEssential Duties and Responsibilities:\nResponsible for the development of new Process Innovation Projects related to operation optimization and process efficiency and ensuring successful delivery of projects: Project Plan\nEnsures execution of projects developed\nResponsible to establish timelines, ownership, key milestones and to follow-up with stakeholders on all deliverables\nResponsible to monitor project execution and develops follow-up plan in case change/improvement are required based on the feedback\nResponsible for the adoption and coordination of new operational process or system changes ensuring alignment to HQ guidelines\nResponsible to resolve escalations through interaction with all levels within Sales and Marketing, SCM, Logistics, BOC, Finance and Service to ensure that needs are identified and immediate resolution found for critical SCM operational barriers\nCoordination of required System/process implementation\nTraining for new Process or functional system delivered by project\nImplementing a robust KPI monitoring system at Project end to measure short/long term results\nResponsible to present strategic ideas to executives, tactical plans to managers and operational tasks to employees in addition to gaining consensus from all levels of the organization\nReview and Coordinate the updates of new policies and procedures in GPPM\nKnowledge:\nEducation focused on a technical discipline is an asset (Computer Science, Engineering, etc)\nExpert Knowledge of Business Systems (SAP required, SFDC an asset)\nMS Office suite required, Strong Excel VBA, SQL an asset, R and Python an asset\nAbility to evaluate and analyze complex systems data and determine appropriate actions\nStrong interpersonal skills with the ability to influence without authority\nAdvanced in Microsoft Office (Excel, Access, PowerPoint, Visio, Word, Outlook),\nExperience:\nProject Management experience required (PMP an asset)\nLean Six Sigma experience an Asset\n3-5 years of work related experience supply chain processes and/or retail channel within electronics industry\nCompetencies:\nStrong Data analysis\nThe ability to develop and maintain excellent working relationships with multiple levels within and outside the company. Must be able to influence others in acceptance, approval, and providing project description.\nThe ability to plan, organize, and prioritize multiple assignments and projects.\nThe ability to work in a team environment to identify and achieve team project goals and results, including the completion of assignments within established time frames.\nDemonstrated ability to Interact with all levels within the organization\nStrong interpersonal and analytical skills\nSkills and Qualifications\nSamsung is an equal employment opportunity employer.\nSamsung has an accommodation process in place and provides accommodations for job applicants with disabilities as appropriate. Assessment and selection materials and procedures can be made available in accessible formats and methods as appropriate. If you require a specific accommodation because of disability or medical need, please let us know when selected to take part in our recruitment process so that reasonable arrangements can be made for the appropriate accommodations to be in place as you move through our process.\nWe thank you for your interest in working for Samsung. Only candidates selected for an interview will be contacted.\n#LI-DJ1\n#indhigh\n* Please visit Samsung membership to see Privacy Policy, which defaults according to your location. You can change Country/Language at the bottom of the page. If you are European Economic Resident, please click here .", "link": "https://ca.indeed.com/viewjob?jk=4e4071e6212274dd&tk=1d8uc225b0j02000&from=serp&vjs=3&advn=4239586925542806&adid=192544934&sjdu=SiFHkPhkZXklx1BTeo8ye7P5n_-s08hrxMD-dtpZk1mNTAFRPpsSNCj5n5rye5lRDM3_fIKHIPOT2t6btmZj70bWxM9QQUtCzgscF56GXoaFNI8Kh2pSkVkX1-iPWXIQ8cmXIpoQ7ajHYZVrgXbVJkJ62_NkPPmsqUvzB3Ka2tTbj1wgapo-kDUYNzHRnF1l9owAEa2u-3z1BAnD3hr-jA"},
{"title": "Senior Manager, Enterprise Model Risk Management", "company": "RBC", "descr": "What is the opportunity?\nThe Senior Manager is responsible for model validation of enterprise risk models, Value At Risk models, regulatory capital models and pricing models. This individual will be responsible for preventing any loss that could occur due to the misuse of mathematically complex models, for the purpose of protecting and enhancing RBC s financial safety and reputation. The Senior Manager will enhance RBC s knowledge capital and increase the bank s operational effectiveness in dealing with a large volume of regulatory-driven model validation initiatives. The incumbent will contribute to RBC s goal of being a leading financial services partner valued for our expertise.\n\nEnterprise Model Risk Management, as part of Group Risk Management, is responsible for managing the model risk across RBC including those used for the computation of regulatory capital and the measurement of a wide range of risk exposures.\n\nWhat will you do?\nIndependently validate new and existing enterprise risk models.\nProvide consultancy to Local Market Risk and Enterprise Market Risk.\nIdentify and escalate material issues related to model risk, and providing consultancy with respect to potential solutions to these issues.\nIdentify and articulate model limitations\nReport writing and model inventory maintenance\nIdentify inconsistencies across models and escalate inconsistencies to management\nKeep abreast of latest developments in enterprise risk management.\n\nWhat do you need to succeed?\nMust-have\n2+ years of experience in model validation, model development or a related position\nAn advanced degree (Masters, PhD) in a quantitative discipline, ideally in Finance\nKnowledge of enterprise risk models (eg. VaR engines and supporting pricing models, regulatory capital models)\nFluency in computational techniques including Monte Carlo simulation.\nProgramming ability in languages like C/C++/Java/Perl/Python/VBA; adept at applications such as Excel/Matlab\nAbility to explain complex processes in simple language\n\nNice-to-have\nCFA Charter Holder and/or FRM or PRM certification\n\nWhat s in it for you?\nWe thrive on the challenge to be our best, progressive thinking to keep growing, and working together to deliver trusted advice to help our clients thrive and communities prosper. We care about each other, reaching our potential, making a difference to our communities, and achieving success that is mutual.\nA comprehensive Total Rewards Program including bonuses and flexible benefits, competitive compensation\nLeaders who support your development through coaching and managing opportunities\nWork in a dynamic, collaborative, progressive, and high-performing team\nOpportunities to do challenging work\nFlexible work/life balance options\n\nAbout RBC\nRoyal Bank of Canada is Canada s largest bank, and one of the largest banks in the world, based on market capitalization. We are one of North America s leading diversified financial services companies, and provide personal and commercial banking, wealth management, insurance, investor services and capital markets products and services on a global basis. We have over 80,000 full- and part-time employees who serve more than 16 million personal, business, public sector and institutional clients through offices in Canada, the U.S. and 37 other countries.. For more information, please visit rbc.com.\nInclusion and Equal Opportunity Employment\nRBC is an equal opportunity employer committed to diversity and inclusion. We are pleased to consider all qualified applicants for employment without regard to race, color, religion, sex, sexual orientation, gender identity, national origin, age, disability, protected veterans status, Aboriginal/Native American status or any other legally-protected factors. Disability-related accommodations during the application process are available upon request.\n\nJOB SUMMARY\nCity: Toronto\nAddress: 200 Bay Street\nWork Hours/Week: 37.5\nWork Environment: Office\nCareer Level: Senior Manager/Director\nPosition Level: PL07\nApplication Deadline: 04/23/2019\nReq ID: 186033", "link": "https://ca.indeed.com/viewjob?jk=49b07479e3c9c220&from=serp&vjs=3"},
{"title": "Prochaines occasions   analystes en actuariat principaux, chefs d quipe et scientifiques de donn es", "company": "RSA", "link": "https://ca.indeed.com/viewjob?jk=068b418e9ee93e86&from=serp&vjs=3"},
{"title": "Senior Pricing Actuary", "company": "Everest Re", "descr": "Posting Title\n\nSenior Pricing Actuary\n\n\n14-Feb-2019\n\n\nDepartment\n\nEvCan Corp\n\n\nJob Description\n\nEverest Insurance Company of Canada, a member of the Everest Re Group, Ltd. is currently recruiting for a Senior Pricing Actuary to be located in Toronto. This is an exciting opportunity to play a key frontline role in providing production pricing support for Everest Insurance s Canada operations. Line of businesses include GL, Umbrella, Inland Marine and Property.\n\n\nResponsibilities will include:\nPortfolio price and risk monitoring;\nEnhancement of rating models and parameters;\nPlanning and portfolio strategy, including account segmentation and property cat management;\nInvolvement in ceded reinsurance submissions, evaluation and strategy;\nEvaluation of new program opportunities;\nLarge and complex account pricing referrals;\nSupport for supplemental Canadian regulatory filings\nQualifications:\n10-15 years of experience in the property-casualty insurance industry with significant commercial lines pricing experience\nAnywhere from 5 exams to recent FCIA\nEnjoys fostering collaborative relationships with underwriting teams\nFlexible and responsive to dynamic business needs including tight turnaround times and limited data\nComfortable with autonomy, responsibility and visibility\nExcel expertise a must.\nProficiency in at least one of the following is a plus: SQL or MS Access, Excel VBA, Power BI, R, SAS, Python\nEverest is committed to recruiting and retaining the most talented individuals in the industry. We offer a dynamic work environment and a competitive compensation and benefit package which includes a 401k plan, retirement/savings option, tuition reimbursement, medical, dental, vision, life and group legal plans.\n\n\nEverest is an equal opportunity employer. All qualified applicants will receive consideration for employment without regard to race, color, religion or creed, sex (including pregnancy), sexual orientation, gender identity or expression, national origin or ancestry, citizenship, genetics, physical or mental disability, age, marital status, civil union status, family or parental status, veteran status, or any other characteristic protected by law.\n\n\nJob Location\n\nToronto, Canada\n\n\nArea of Interest\n\nActuarial", "link": "https://ca.indeed.com/viewjob?jk=d0095a8995eca071&tk=1d8uc22k30j02000&from=serp&vjs=3&advn=4972874631828035&adid=254251241&sjdu=i6xVERweJM_pVUvgf-Mzud6v7vx4W2vba62rTobId36E0tIK7LExSPeYBy92LJNt"},
{"title": "Manager Counterparty Credit Risk Capital", "company": "BMO Financial Group", "descr": "Mandate:\nDaily operations and system enhancements, create and participate in development of testing requirements and validation of implementation of capital requirements for Counterparty Credit Risk Capital. Identify opportunities for, and lead the enhancement for capital methodologies for quantifying counterparty credit risk capital across all trading products so that the accuracy and reliability of capital and consequent business decisions reliant upon these data are enhanced.\nKEY ACCOUNTABILITIES\n Implement tools for, and perform, driver analysis for the capital changes based on production operations\nInterpret the regulatory requirement and provide analytical solutions\nTranslate the business solutions into technical requirement, i.e. write business requirement\nSupport the implementation process, and provide seamless communication with technology developer .\nCr eate test plan including the test scenarios and sample data to support the testing scenarios\nPerform the testing across the entire testing cycle to ensure business requirements are met\nIdentify issues and propose solutions\nAnalyze the test result and communicate the result to senior management\nDocument procedures, control processes, and policies relevant to internal controls\nContinuously improve understanding of subject matter relating to Counterparty Credit Risk monitoring and Basel III RWA / capital calculations\nCROSS-FUNCTIONAL RELATIONSHIPS\nTechnology & Operations;\nCorporate Risk Management directors and managers;\nCapital Markets Trading Lines of Business\nCredit Portfolio Managers and Account Managers\nExternal system software vendors\nModel Validation\nMarket Risk internal teams   infrastructure, process and governance, etc.\nROLE DIMENSIONS:\nThis role has direct or in-direct impact on the following financial measures:\n Regulatory capital ;\nEconomic and regulatory capital;\nCounterparty credit risk exposure measurements;\nQualifications\nKNOWLEDGE AND SKILLS:\nMust-Have Skills:\n 3+ years of related work experience in a financial institution\nStrong knowledge with financial products, specifically possessing knowledge of derivatives ( OTC) as well as SFT\nStrong Experience working with BASEL III and OSFI CAR Guideline\nStrong Experience with CCR, CCR Capital ( CEM, SA-CCR) is a MUST\nExperience on BCAR\nAdvanced knowledge of Excel, VBA, SQL, Database Concepts\nAdvanced Python programming experience\nParticipation in mid-scale/large IT development projects, with hands-on experience in conducting testing\nStrong capability of writing business requirement and test plans\nStrong capability of creating mock-up data required to test the pre-specified cases\nNice-to-Have Skills:\nBroad understanding of risk management methodologies\nExperience in using work tracking systems (e.g. JIRA, HPQC) would be an advantage\nExperience in an Agile and fast-paced environment\nSoft Skills :\nStrong analytic and troubleshooting skill s with a solution oriented attitude\nSelf-motivated and take ownership\nGood self-organization skills including planning, scheduling, managing priorities and meeting deadlines\nGood oral and written communication skills .\nStrong interpersonal skills and ability to function effectively within a team, and work with multiple stakeholders.\nCurios, dynamic, focused, proactive, detail-oriented\nEducational Requirements/Professional Certifications:\nAdvanced university degree, preferably in a quantitative field, such as Mathematics, Statistics, Science or Engineering.\nCFA, FRM, PRM designation or working towards one of those or similar ones would be an asset\nWe re here to help\nAt BMO we have a shared purpose; we put the customer at the centre of everything we do   helping people is in our DNA. For 200 years we have thought about the future the future of our customers, our communities and our people. We help our customers and our communities by working together, innovating and pushing boundaries to bring them our very best every day. Together we re changing the\n\nway people think about a bank.\nAs a member of the BMO team you are valued, respected and heard, and you have more ways to grow and make an impact. We strive to help you make an impact from day one   for yourself and our customers. We ll support you with the tools and resources you need to reach new milestones, as you help our customers reach theirs. From in-depth training and coaching, to manager support and network-building opportunities, we ll help you gain valuable experience, and broaden your skillset.\nTo find out more visit us at https://bmocareers.com .\nBMO is committed to an inclusive, equitable and accessible workplace. By learning from each other s differences, we gain strength through our people and our perspectives. Accommodations are available on request for candidates taking part in all aspects of the selection process. To request accommodation, please contact your recruiter.\nJob\n Data Sciences\nPrimary Location\n Canada-Ontario-Toronto\nOrganisation\n ERPM-X000073\nSchedule\n full-time\nJob Posting\n 04/12/19\nUnposting Date\n 06/07/19", "link": "https://ca.indeed.com/viewjob?jk=5c8f35df4cae5cbd&tk=1d8uc22mb0j02001&from=serp&vjs=3&advn=6114451463185775&adid=196201922&sjdu=PU7VS0P_e8MVjSR70CDLK--bPylNW2vvO3WAHEKN7JgEuyl-uSLk6boycRtdWr-cP7xj9iob-_hS8FrnYnn0D0VC-VkTibfxmUNGuMzS9Qz7YMFRWwiY7cJo0du9vzAV"},
{"title": "Software Engineer II", "company": "LoyaltyOne", "descr": "Description:\n\nWhy Work with Us \nAre you passionate about Data and Reporting?\nAs part of Member Experience Reporting team, the Software Engineer will play a critical role in making Member Experience data available in Data Hub and providing reports and insights that will help drive business decisions.\nWhat you ll do \nCreate pipelines in databricks to transfer data to Data Hub\nSupport other departments by producing self-serve reports / dashboards in Tableau to drive results\nConduct analysis and deliver key insights to address business problems or understand underlying trends to help evolve business strategies or in support of new programs or initiatives\nPrepare high-quality reports and presentations targeted for specific audiences\nProactively highlight opportunities to develop and/or enhance existing tools and processes\nQualification:\nWho you are \nPost-secondary education with 1-2 years IT Application Development Experience\nAdvanced experience using Python, databricks Spark, SQL and Excel\nProficient experience with Word, MS Access (VBA programming), PowerPoint and relational databases (Oracle)\nFamiliarity with data warehouse and AWS (data lake) concepts\nKnowledge of key call center metrics/reporting and call center applications is an asset\nSolid analytical, logical and problem-solving skills\nStrong project management skills, with the ability to organize and prioritize multiple projects, competing requests and multiple tasks in a deadline-driven environment\nStrong written and oral communication skills\nWork independently in a fast-paced dynamic environment\nPossess an excellent work ethic and be self-motivated\nMust be able to travel between offices as necessary\nRequirement to work non-core hours from time-to-time (e.g. during application launch)\nReports are used for decision making purposes, therefore accuracy and the ability to meet timelines is crucial to the business\n\nAbout LoyaltyOne\nLoyaltyOne is part of the successful Alliance Data family of companies that provide the full range of data-driven loyalty, marketing and credit solutions in more than 80 locations across the globe.\nWorking with more than 100 leading brands in the retail, financial services, grocery, petroleum retail, travel and hospitality industries to profitably change customer behavior. Through a team of businesses, including one of the leading coalition loyalty programs in the world, the AIR MILES  Reward Program, LoyaltyOne designs, delivers and manages a suite of services focused on consumer data, customer-centric retail strategies, direct-to-consumer marketing, loyalty consulting and more.\nLoyaltyOne has broadened its horizons geographically by growing Precima in the European market. With the recent acquisition of BrandLoyalty in the Netherlands, LoyaltyOne has gained the expertise of a global leader in short-term loyalty campaigns, along with a client network that extends throughout Europe and Asia.\n\nAbout ADS\nAlliance Data  (NYSE: ADS) is a leading global provider of data-driven marketing and loyalty solutions serving large, consumer-based industries. The Company creates and deploys customized solutions, enhancing the critical customer marketing experience; the result is measurably changing consumer behavior while driving business growth and profitability for some of today's most recognizable brands. Alliance Data helps its clients create and increase customer loyalty through solutions that engage millions of customers each day across multiple touch points using traditional, digital, mobile and emerging technologies. An S&P 500 and Fortune 500 company headquartered in Plano, Texas, Alliance Data consists of three businesses that together employ more than 16,000 associates at approximately 100 locations worldwide. www.alliancedata.com\n\nAlliance Data is an Equal Employment Opportunity employer. Accordingly, we will make reasonable accommodations to respond to the needs of people with disabilities in accordance with legislation.\nAlliance Data participates in E-Verify.\nCheck us out   LoyaltyOne on Stack Overflow | LinkedIn | Glassdoor | Facebook |Twitter | Blog | Instagram", "link": "https://ca.indeed.com/viewjob?jk=868b0b6f130afcd7&tk=1d8uc232q0j02003&from=serp&vjs=3&advn=7042723621657021&adid=276050144&sjdu=i6xVERweJM_pVUvgf-Mzud6v7vx4W2vba62rTobId37eIK82uw1XRT7m-D8lI0g6"},
{"title": "Senior Analyst, Risk Model Development", "company": "Central 1 Credit Union", "descr": "Job Description\n\nBASIC FUNCTION:\nThe Risk Model Development department s role is to design, develop and maintain Central 1 s risk models and provide expertise with respect to financial instrument valuation. They work closely with the Risk Analytics department and lines of business to ensure that the appropriate tools are developed to measure and manage risks.\nReporting to the Director, Risk Model Development, the Analyst/Senior Analyst, Risk Model Development is responsible for building and developing models in support of the ongoing development of Central 1 s liquidity, credit, operational, and market risk framework.\nThe position is ideally based in Toronto, ON. Vancouver, BC based applicants will be considered.\nSPECIFIC ACCOUNTABILITIES:\n1. Developing, reviewing and enhancing analytical models and tools for the:\nImplementation and maintenance of Central 1 s market risk infrastructure (VaR, stress testing, IRRBB)\nImplementation and maintenance of Central 1 s liquidity measurement infrastructure (Liquidity stress testing, LCR, NSFR, Asset-Liability Management )\nImplementation and maintenance of Central 1 s credit risk measurement infrastructure (PFE, UL, EL)\nImplementation of non-financial risk measurement infrastructure (operational risk models)\nValuation and risk measurement of new and existing business products.\n2. Contribute to key regulatory deliverables related to risk models, stress testing and risk capital.\n3. Support business units, the Risk Group, technology and finance to develop tools to facilitate the measurement and reporting of liquidity, market, operational and credit risk measures and to facilitate the introduction of new products and risk management strategies.\n4. Participate in projects relating to model development and perform other duties and ad-hoc tasks analysis as required by the Director, Risk Model Development, the Risk Analytics and Operations group, and Front Office.", "link": "https://www.indeed.ca/viewjob?jk=82226c95070dcbfb&from=serp&vjs=3"},
{"title": "Director, Performance and Analytics, MRM//McCann", "company": "Worldgroup Careers MWT", "descr": "The Director, Performance and Analytics is responsible for developing data driven strategic recommendations pertinent to branding, social, digital, media, planning, acquisition and optimization. This role will require extensive knowledge of qualitative and quantitative analytics techniques, with the end goal of providing one comprehensive 360-degree view of the customer. This is a hand s on role where the individual will be responsible for accurate analyses and advanced analytics modeling work. The Director, Performance and Analytics is also responsible for developing and cultivating relationships with key team members across the agency such as the strategy, technology, creative and account management teams.\n\n\nAs Director, Performance and Analytics, your job duties will include, but will not be limited to, the following activities and responsibilities:\n\n\nResponsibilities:\n\nEstablishing the objectives for the company s Performance and Analytics division and approving strategic growth strategies that will encourage agency growth and continued lead in the Canadian marketing communications industry;\nPartnering with the President, CSO, CCO and National Director of Media to develop and deliver Performance and Analytics strategic and business plans;\nProviding both direct and indirect oversight of data strategy and analytics teams and operations to achieve the division and company s goals;\nLeading engagement teams and serving as a new business leader that is responsible for identifying, pitching, leading the company through negotiations, and winning new business opportunities;\nGrowth and development of junior team members, who will report to him/her on a project and/or account level basis.\nProviding oversight, both directly and through middle managers, of all areas within the Marketing Science division including:\nReturn on Market Investment ( ROMI ) measurement, marketing mix modelling and optimization, econometrics, and general modelling projects;\nOperational analytics, including framework management, process definition, recruitment, and training;\nData Infrastructure, Architecture and Management, including systems, Extract, Transform, and Load ( ETL ) data activities, report production and data visualization\nIn addition, this is a highly client facing role, with a strong expectation that this individual will also contribute heavily to new business development and the pitching process.\n\n\n\nRequired Skills\nQualifications:\n\nThe successful candidate will have exceptional business acumen and a proven track record of building and leading an advanced analytics offering within the Media landscape, across multiple analytics disciplines. It is critical that this individual has the passion and credibility within the analytics environment and can become actively involved in industry affairs and industry dialogue as a high profile advocate to build and encourage growth within this line of our business.\nBachelor s Degree in Statistics, Mathematics, Operations Research, Economics, Computer or a quantitative degree in another social science; Master s degree a plus\nSeveral years of professional working experience (a minimum of a five) in the marketing and communications\n8-10+ years of experience in data analysis, media platforms, technology and/or BI\nDeep experience combining quantitative analytics and qualitative research methods\nDeep expertise in model building and/or machine learning\nCandidates with media or direct marketing background encouraged to apply\nAs this is a business leadership role and not a traditional account management role, the successful applicant must possess a minimum of three years of experience in an business operations capacity including the management and delivery of strategic growth plans and business administration;\nExperience in delivering strategic growth plans for multinational clients and international brands is required;\nDemonstrable experience in ROMI analytics and marketing mix modelling and optimization is required;\nExperience in multidiscipline analytics, including marketing mix modeling ( MMM ), marketing measurements strategy, and digital media optimization reporting is required;\nThe successful candidate must have P&L management experience and managing a business or essential business function to budget;\nThe successful candidate must have proven experience human resources and talent management including the ability to identify, recruit, inspire, and develop best in class talent;\nFluent in agency processes to ensure quality control at all stages of the project;\nMust be a self-starter who works well in a fast-paced, team-oriented environment;\nTransparent with a high degree of integrity, self-aware and self-accountable;\nResult and action oriented, calm under pressure with a resiliency to bounce back quickly from setbacks;\nStrong managerial courage, decisive and able to make the tough decisions and have the tough conversations with respect and positivity; and\nMust possess exceptional oral and written communication skills, presentation skills and client relationship building skills\nExperience with one or more of the following:\nPython\nSPSS\nVBA\nPHP\nSQL\n Required Experience\n\nStrong business acumen.\nStrong knowledge of marketing analytics, methodologies and platforms.\nStrong analytical foundation with expert hands on knowledge of advanced statistical techniques\nTag management systems, ad serving platforms\nIntermediate to Expert Knowledge of a leading BI platform such as Tableau, DOMO, MSFT Power BI\nAbility to translate findings/results into clear, actionable and executable insights\nExceptional communication and presentation skills; strong business development skills a plus\n\n\nAT MRM, RELATIONSHIP IS OUR MIDDLE NAME.\n\n\nMRM//McCann is a leading customer relationship agency that leverages the power of creativity, the beauty of data, and the magic of technology to nurture, encourage and sustain strong relationships between brands and their customers   in turn, creating meaningful experiences for people, while driving business results.\n\nWe employ the most innovative talent in the industry to digitally drive the transformation of our clients  businesses and provide creative solutions to help brands grow meaningful relationships with people.\n\nDo you excel when working in a team? Are you fascinated by the endless possibilities that technology brings to marketing? Are you ready to transform our world?\n\nIf so, you will thrive in our culture based on the Important Things We Believe (I.T.W.B.s):\n\n\nIdeas power everything\nWe re Better Together\nWe ll figure it out\nComplexity can be managed\nIt only counts if we deliver\nTechnology is magic\n\n\nMRM//McCann is a leader in Gartner Inc.'s annual \"Magic Quadrant for Global Digital Marketing Agencies\" report. Gartner Magic Quadrants are based on an exacting methodology where agencies stand out for their strategic services, including business strategy and digital business transformation skills. MRM//McCann is noted for its global vision and strategy, and its use of tools and analytics enabling clients to deliver a measurable business impact as the result of those strategies.\n\n\nNO THIRD PARTY RESUMES ACCEPTED.\n\n\nMRM//McCann is an EEO/AA employer and does not discriminate on the basis of race, color, religion, creed, gender, sexual orientation, age, gender identity, marital status, citizenship, disability, genetic information or veteran status or any other basis prohibited by applicable federal, state, or local law. MRM//McCann participates in e-Verify.\n\n\nIf you require reasonable accommodation for any part of the application or hiring process, please submit your request through one of the following methods listed below:\n\n\na) Dedicated Fax - 917-661-6310\nb) Dedicated E-mail   Careers@mwgdetroit.com\nc) US Mail   ATTN: Human Resources, 360 W. Maple Birmingham, MI 48009\nd) Dedicated Phone   248-203-8000\n\n\nNOTE: Disability accommodation requests only.\n\nRequired Experience", "link": "https://www.indeed.ca/viewjob?jk=f96b18ffca6a1481&from=serp&vjs=3"},
{"title": "Actuarial Analyst/Senior Actuarial Analyst, Personal Insurance Technical Pricing", "company": "Aviva", "descr": "Are you passionate about data and not afraid of searching for a needle in a stack of hay? Does developing pricing techniques give you goosebumps? Do you get excited when discovering a new piece of data that could potentially drive better business results or make customers happy? Can you create Harry Potter like magic with Excel?\nJoin an exciting team of actuaries, data scientists and engineers at the forefront of a company who is starting to leverage data to better drive decisions at every level of our organization. Our aim is to change how we do insurance and you can help us.\nIf you want to grow your career by shaking up the insurance industry, causing disruption, we want to hear from you! We have multiple opportunities available from Junior Actuarial Analysts to Senior Actuarial Analysts to be based out of our Markham, Toronto and Montreal locations.\nWe have:\nAn open mind for new ideas and methodologies   You will develop industry-leading go-to-market capabilities with new customer-centric offerings based on world-class pricing and data science. The team is also accountable for developing and maintaining best-in-class rate adequacy analyses and driving business insights from proactive monitoring. You will embed best practice pricing methodologies leveraging techniques used in other jurisdictions within the Canadian Environment. You will also continually improve the generation of Analysis in terms of length of time to create the reports and the accuracy.\nA great team and collaborative work environment   You will work closely with Corporate Actuarial, Claims, Finance Analytics, Underwriting and Government Relations to develop a deep understanding of Aviva s personal insurance business and reflect key data and emerging trends into our pricing models. You will also work with the analytics group to develop robust and automated monitoring framework.\nAdvanced pricing and collaboration tools   You will compile, analyze and communicate the health of the portfolio to support regional pricing and business development teams in understanding their mix of business, retention, growth, and overall quality of the book and advising on adjustments as needed. You will also support the Personal Insurance Leadership team in providing actuarial input into the company s annual business plan.\nA culture of personal and professional development   You will monitor and assess the impact of business decision including rate or underwriting changes to ensure the impact is in line with expectations. You will also monitor the market position of Aviva s pricing relative to key competitor s impact on the personal insurance portfolio and identify emerging trends which will impact the current book either adversely or positively.\nWe expect:\nStrong mathematical and statistical background\nStrong problem solving and analytical skills\nProficiency in programming and experience in SAS, R, Python and VBA a plus\nAbility to communicate well and present ideas/decisions clearly\nAdaptability, great teammate and client service skills\nYour skillset includes:\nBachelor degree in Actuarial Science, Math or Statistics\nMinimum of 2 CAS exams and 2 years of P&C work experience\nAdditional Information:\nAviva Canada is committed to providing accommodations for people with disabilities during all phases of the hiring process including the application process. If you require an accommodation because of a disability, we will work with you to meet your needs. Applicants need to make their needs known in advance. If you are selected for an interview and require an accommodation, you are encouraged to advise the Talent Acquisition Partner who will consult with you to determine an appropriate accommodation.", "link": "https://ca.indeed.com/viewjob?jk=b32dc15885bc6db5&from=serp&vjs=3"},
{"title": "Director, Enterprise Model Risk Management", "company": "RBC", "descr": "What is the opportunity?\nThe Director is accountable for model validation of structured equity derivative models. This individual will be responsible for preventing any loss that could occur due to the misuse of mathematically complex models, for the purpose of protecting and enhancing RBC s financial safety and reputation. The Director will enhance RBC s knowledge capital and increase the bank s operational effectiveness in dealing with a large volume of regulatory-driven model validation initiatives. The incumbent will be responsible for providing leadership and ensuring business continuity through the career development of the Enterprise Model Risk Management team. The Director will directly contribute to RBC s goal of being a leading financial services partner valued for our expertise.\n\nEnterprise Model Risk Management, as part of Group Risk Management, is responsible for managing the model risk across RBC including those used for the valuation of financial products, computation of regulatory capital, and measurement of a wide range of risk exposures.\n\nWhat will you do?\nIndependently validate new and existing valuation and risk measurement models for RBC Capital Markets with a concentration on structured equity derivatives.\nProvide consultancy to Local Market Risk, Finance and Global Valuations regarding technical model issues and independent price verification issues\nIdentify and escalate material issues related to model risk, and providing consultancy with respect to potential solutions to these issues.\nIdentify and articulate model limitations\nReport writing and model inventory maintenance\nIdentify inconsistencies across models and escalate inconsistencies to management\nKeep abreast of latest developments in derivatives modeling\nManage a small team\n\nWhat do you need to succeed?\nMust-have\n4+ years of experience in Model Validation, model development or a related position\nAn advanced degree (Masters, PhD) in a quantitative discipline, ideally in Finance\nProduct knowledge of structured equity derivatives (single and multi-asset, multi-currency products) and volatility modelling (local volatility, stochastic volatility, etc.)\nFluency in computational techniques, including Monte Carlo simulation, numerical and analytic solution of partial differential equations.\nProgramming ability in languages like C/C++/Java/Perl/Python/VBA; adept at applications such as Excel/Matlab\nAbility to explain complex processes in simple language\n\nNice-to-have\nCFA Charter Holder and/or FRM or PRM certification\n\nWhat s in it for you?\nWe thrive on the challenge to be our best, progressive thinking to keep growing, and working together to deliver trusted advice to help our clients thrive and communities prosper. We care about each other, reaching our potential, making a difference to our communities, and achieving success that is mutual.\nA comprehensive Total Rewards Program including bonuses and flexible benefits, competitive compensation\nLeaders who support your development through coaching and managing opportunities\nWork in a dynamic, collaborative, progressive, and high-performing team\nOpportunities to do challenging work\nFlexible work/life balance options\n\nAbout RBC\nRoyal Bank of Canada is Canada s largest bank, and one of the largest banks in the world, based on market capitalization. We are one of North America s leading diversified financial services companies, and provide personal and commercial banking, wealth management, insurance, investor services and capital markets products and services on a global basis. We have over 80,000 full- and part-time employees who serve more than 16 million personal, business, public sector and institutional clients through offices in Canada, the U.S. and 37 other countries.. For more information, please visit rbc.com.\nInclusion and Equal Opportunity Employment\nRBC is an equal opportunity employer committed to diversity and inclusion. We are pleased to consider all qualified applicants for employment without regard to race, color, religion, sex, sexual orientation, gender identity, national origin, age, disability, protected veterans status, Aboriginal/Native American status or any other legally-protected factors. Disability-related accommodations during the application process are available upon request.\n\nJOB SUMMARY\nCity: Toronto\nAddress: 200 Bay Street\nWork Hours/Week: 37.5\nWork Environment: Office\nCareer Level: Senior Manager/Director\nPosition Level: PL06\nApplication Deadline: 04/23/2019\nReq ID: 186029", "link": "https://ca.indeed.com/viewjob?jk=a82ae8364b5e8fb3&from=serp&vjs=3"},
{"title": "Senior Actuarial Analyst, Personal Insurance Technical Pricing", "company": "Aviva", "descr": "Aviva Canada is part of a global insurance company and we are on a mission to be the best insurer in Canada. The future of our business depends on good data and those who know how to use it. Our end game is to develop industry leading go-to-market capabilities with new customer-centric offerings based on world class pricing and data science.\nIf you want to grow your career by shaking up the insurance industry, causing disruption, we want to hear from you!\nSigning bonus of up to $10K will be offered!\nThe Position:\nReporting to the Manager of Technical pricing the candidate will provide forward-looking, best in class monitoring and costing analysis for the personal insurance book of business. This analysis will provide stakeholders a deep understanding of our current and future cost of doing business.\nAccountabilities:\nThe Technical Pricing team is accountable for developing and maintaining best in class rate adequacy analyses and driving business insights from proactive monitoring. Activities will include:\nAccountable for embedding best practice pricing methodologies leveraging techniques used in other jurisdictions within the Canadian Environment.\nWork closely with Corporate Actuarial, Claims, Finance, Analytics, Underwriting and Government Relations to develop a deep understanding of Aviva s personal insurance business and reflect key data and emerging trends into our pricing models\nCompile, analyse and communicate the health of the portfolio to support regional pricing and business development teams in understanding their mix of business, retention, growth, and overall quality of the book and advising on adjustments as needed\nSupport the Personal Insurance Leadership team in providing actuarial input into the company s annual business plan\nIdentify emerging trends which will impact the current book either adversely or positively.\nMonitor and assess the impact of business decision including rate or underwriting changes to ensure the impact is in line with expectations.\nMonitoring the market position of Aviva s pricing relative to key competitor s impact on the personal insurance portfolio.\nWork with analytics group to develop robust and automated monitoring framework\nContinually improve the generation of Analysis in terms of length of time to create the reports and the accuracy.\nQualifications:\nStrong mathematical and statistical background\nStrong problem solving and analytical skills\nProficient in programming and has experiences in SAS, R, Python, and VBA a plus\nAbility to communicate well and present ideas/decisions clearly\nAdaptable, team player with client service skills\n3-4 years of P&C experience\nBachelor's Degree, 5+ CAS exams\nAdditional Information:\nAviva Canada is committed to providing accommodations for people with disabilities during all phases of the hiring process including the application process. If you require an accommodation because of a disability, we will work with you to meet your needs. Applicants need to make their needs known in advance. If you are selected for an interview and require an accommodation, you are encouraged to advise the Talent Acquisition Partner who will consult with you to determine an appropriate accommodation.", "link": "https://ca.indeed.com/viewjob?jk=8df1c920a4620001&from=serp&vjs=3"},
{"title": "Capital Markets Analytics   VP/Director", "company": "BMO Financial Group", "descr": "The successful candidate will be a self-starting, results-oriented, and highly motivated individual with excellent analytical skills and the ability to independently resolve complex business problems.\n\nSupport front office traders in their use of risk/P&L platforms.\nInteract and build relationships with various groups across the firm (trading desks, risk management, middle office, etc.).\nAggregating, organizing and analyzing market and trade data to facilitate a wide range of reporting, from high-level business overviews down to trade-level details.\nBecome familiar with in-house financial pricing library.\nTroubleshoot and solve problems within a very short timeframe.\nKeep abreast of BMO quantitative framework and front-office pricing developments.\nBe aware of changing regulatory requirements and related impact to the business.\nQualifications\n\nKnowledge and Skills\nUnder-graduate or graduate degree in a field such as finance, mathematics, statistics or computer science.\nCFA charter or candidacy an asset\nProgramming skills an asset, but not required (Python, JavaScript, VBA)\nFamiliarity with database design and queries (Oracle/SQL)\nProficient in MS office (excel, word, etc)\nAble to operate with minimal supervision/direction\nUnderstanding of financial pricing models and valuation of derivative products\nFamiliarity with financial data providers (Bloomberg, Reuters).\nSolid knowledge of financial theory and risk management concepts.\nExperience in a capital markets environment, ideally involving interaction with trading floor.\nAble to exercise independent thought and judgment and adapt to new tasks with little notice.\nStrong analytical skills and proven problem solver.\nExcellent communication skills, with the ability to deal effectively with a wide range of colleagues. Ability to obtain cooperation from multiple stakeholder groups and effectively manage conflicts.\n\nWe re here to help\nAt BMO we have a shared purpose; we put the customer at the centre of everything we do   helping people is in our DNA. For 200 years we have thought about the future the future of our customers, our communities and our people. We help our customers and our communities by working together, innovating and pushing boundaries to bring them our very best every day. Together we re changing the way people think about a bank.\nAs a member of the BMO team you are valued, respected and heard, and you have more ways to grow and make an impact. We strive to help you make an impact from day one   for yourself and our customers. We ll support you with the tools and resources you need to reach new milestones, as you help our customers reach theirs. From in-depth training and coaching, to manager support and networkbuilding opportunities, we ll help you gain valuable experience, and broaden your skillset.\nTo find out more visit us at https://bmocareers.com.\nBMO is committed to an inclusive, equitable and accessible workplace. By learning from each other s differences, we gain strength through our people and our perspectives. Accommodations are available on request for candidates taking part in all aspects of the selection process.\n\n#LI-2461460_LI15\nJob\n Trading\nPrimary Location\n Canada-Ontario-Toronto\nOrganisation\n COO Capital Markets-X000018\nSchedule\n full-time\nJob Posting\n 03/15/19\nUnposting Date\n Ongoing", "link": "https://ca.indeed.com/viewjob?jk=a8c90d07d90ac77d&from=serp&vjs=3"},
{"title": "Senior Specialist, Process Innovation", "company": "Samsung Electronics", "descr": "Position Summary\nThe Senior Specialist in Process Innovation will review all operations and processes related to Retail, sales, Supply Chain Management (SCM), Logistics, Finance and Service to identify areas of improvement, develop action/project plans to address and follow through to implementation. This person will focus on value added projects to optimize the functional processes and the operational systems utilizing data driven analytics. The position will be a key liaison between Sales & Marketing, SCM, Logistics, Business Operations Center (BOC), Information Technology (MIS), Finance and Service and will interact with Samsung Corporate Headquarters(HQ), North American Headquarters (NAHQ), Samsung sister companies such as Samsung SDS, External Customers and 3rd party Vendors on projects they lead.\nRole and Responsibilities\nEssential Duties and Responsibilities:\nResponsible for the development of new Process Innovation Projects related to operation optimization and process efficiency and ensuring successful delivery of projects: Project Plan\nEnsures execution of projects developed\nResponsible to establish timelines, ownership, key milestones and to follow-up with stakeholders on all deliverables\nResponsible to monitor project execution and develops follow-up plan in case change/improvement are required based on the feedback\nResponsible for the adoption and coordination of new operational process or system changes ensuring alignment to HQ guidelines\nResponsible to resolve escalations through interaction with all levels within Sales and Marketing, SCM, Logistics, BOC, Finance and Service to ensure that needs are identified and immediate resolution found for critical SCM operational barriers\nCoordination of required System/process implementation\nTraining for new Process or functional system delivered by project\nImplementing a robust KPI monitoring system at Project end to measure short/long term results\nResponsible to present strategic ideas to executives, tactical plans to managers and operational tasks to employees in addition to gaining consensus from all levels of the organization\nReview and Coordinate the updates of new policies and procedures in GPPM\nKnowledge:\nEducation focused on a technical discipline is an asset (Computer Science, Engineering, etc)\nExpert Knowledge of Business Systems (SAP required, SFDC an asset)\nMS Office suite required, Strong Excel VBA, SQL an asset, R and Python an asset\nAbility to evaluate and analyze complex systems data and determine appropriate actions\nStrong interpersonal skills with the ability to influence without authority\nAdvanced in Microsoft Office (Excel, Access, PowerPoint, Visio, Word, Outlook),\nExperience:\nProject Management experience required (PMP an asset)\nLean Six Sigma experience an Asset\n3-5 years of work related experience supply chain processes and/or retail channel within electronics industry\nCompetencies:\nStrong Data analysis\nThe ability to develop and maintain excellent working relationships with multiple levels within and outside the company. Must be able to influence others in acceptance, approval, and providing project description.\nThe ability to plan, organize, and prioritize multiple assignments and projects.\nThe ability to work in a team environment to identify and achieve team project goals and results, including the completion of assignments within established time frames.\nDemonstrated ability to Interact with all levels within the organization\nStrong interpersonal and analytical skills\nSkills and Qualifications\nSamsung is an equal employment opportunity employer.\nSamsung has an accommodation process in place and provides accommodations for job applicants with disabilities as appropriate. Assessment and selection materials and procedures can be made available in accessible formats and methods as appropriate. If you require a specific accommodation because of disability or medical need, please let us know when selected to take part in our recruitment process so that reasonable arrangements can be made for the appropriate accommodations to be in place as you move through our process.\nWe thank you for your interest in working for Samsung. Only candidates selected for an interview will be contacted.\n#LI-DJ1\n#indhigh\n* Please visit Samsung membership to see Privacy Policy, which defaults according to your location. You can change Country/Language at the bottom of the page. If you are European Economic Resident, please click here .", "link": "https://ca.indeed.com/viewjob?jk=4e4071e6212274dd&tk=1d8uc23eq0j02002&from=serp&vjs=3&advn=4239586925542806&adid=192544934&sjdu=SiFHkPhkZXklx1BTeo8ye7P5n_-s08hrxMD-dtpZk1mNTAFRPpsSNCj5n5rye5lRDM3_fIKHIPOT2t6btmZj70bWxM9QQUtCzgscF56GXoaFNI8Kh2pSkVkX1-iPWXIQ8cmXIpoQ7ajHYZVrgXbVJkJ62_NkPPmsqUvzB3Ka2tTbj1wgapo-kDUYNzHRnF1l9owAEa2u-3z1BAnD3hr-jA"},
{"title": "Manager, Workflow Analytics & Insights (Pharmacy)", "company": "Shoppers Drug Mart", "descr": "Location:\n243 Consumers Road, Toronto, Ontario, M2J 4W8\nTake ownership and find more ways to care about our local store owners in a career at Shoppers Drug Mart Central Office / Store Support. Provide great service, specific expertise and actionable advice to support Associate-Owners and their staff in delivering the best health, beauty and convenience services to Canadians.\n\n\nWhy this role is important?\nThe incumbent will take a lead role in supporting pharmacy continuous improvement through measurement, analysis, and optimization of the dispensing workflow. As part of the Enterprise Operations Development and Systems organization, your impact will help drive operational excellence across the Shoppers Drug Mart and Loblaw pharmacy network. Reporting to the Director, Pharmacy Workflow Design & Optimization, your combination of strong technical expertise with business acumen will guide the ongoing development of value-adding analytical capabilities and tools. The successful candidate will play a major role in enhancing the data-driven culture in pharmacy, demonstrating strengths in both planning and execution (process analytics, data modeling, and business intelligence reporting) to help meet enterprise objectives.\nWhat You'll Do:\nBuild deep understanding of digital and physical dispensing workflow through process analysis, engagement with subject matter experts, and conducting in-store work studies\nProvide analytical input to support defining project requirements and workflow design principles\nConsult with project and product leads within Pharmacy and Healthcare to understand business challenges, define success metrics, and quantify business case opportunities\nUncover process improvement opportunities, working from problem identification through data collection, analysis, results, and evaluation\nEnhance scope, quality, and timeliness of internal analytics and KPI measurement tools, building upon existing data platforms and providing input to develop future reporting capabilities\nGuide technical teams to ensure reporting and dashboard systems meet desired outcomes and quality\nPromote use of data-driven decision making by presenting key analytical findings and maximizing stakeholder engagement\nProvide input to the design and development of pharmacy labour model and other resource scheduling tools\nLead team members and developers in statistical & data modeling and reporting best practices\nWhat You'll Need:\n5+ years in data and analytical modeling, preferably in an operational improvement or industrial engineering role\nUniversity degree (Bachelors or Masters) in engineering, math, computer science, or similar discipline\nStrong stakeholder engagement, asking the right questions to understand the complexities of pharmacy operations and business needs\nDemonstrates high level of ownership and initiative to oversee deliverables and anticipate issues\nRobust analytical skills to deep-dive and work hands on with various data sources\nVerbal and visual communication skills to effectively report findings and insights to non-technical audiences\nFluent in multiple small to large-scale data analysis and reporting platforms (our tools include SQL, Teradata, R, VBA, Python, MicroStrategy, Power BI)\nAble to accommodate occasional travel within Canada\nWhy work at Shoppers Drug Mart?\nActing as consultants, supporting internal customers and the Associate-Owners, you will get experience unique to the retail industry while working for an award-winning national brand. Benefit from a purchase discount program, competitive pay and online learning through SDMU.\nTake ownership of your work and find more ways to care about your work, co-workers, customers and community.\nHow You ll Succeed:\nAt Shoppers Drug Mart Inc. , we seek great people to continually strengthen our culture. We believe great people model our values, are authentic, build trust and make connections.\nIf that sounds like you, and you are open-minded, responsive to change and up to the challenges provided in a fast-paced retail environment, apply today.\nEmployment Type:\nFull time\nType of Role:\nRegular\nShoppers Drug Mart Inc. recognizes Canada's diversity as a source of national pride and strength. We have made it a priority to reflect our nation s evolving diversity in the products we sell, the people we hire, and the culture we create in our organization. Accommodation is available upon request for applicants with disabilities in the recruitment and assessment process and when hired.\nIn addition, we believe that compliance with laws is about doing the right thing. Upholding the law is part of our Code of Conduct   it reinforces what our customers and stakeholders expect of us.\nPlease Note: If you have Employee Self Service (ESS) on Workday, apply to this job via the Workday application.", "link": "https://ca.indeed.com/viewjob?jk=d6b9d15bea1b5400&from=serp&vjs=3"},
{"title": "Software Engineer II", "company": "LoyaltyOne", "descr": "Description:\n\nWhy Work with Us \nAre you passionate about Data and Reporting?\nAs part of Member Experience Reporting team, the Software Engineer will play a critical role in making Member Experience data available in Data Hub and providing reports and insights that will help drive business decisions.\nWhat you ll do \nCreate pipelines in databricks to transfer data to Data Hub\nSupport other departments by producing self-serve reports / dashboards in Tableau to drive results\nConduct analysis and deliver key insights to address business problems or understand underlying trends to help evolve business strategies or in support of new programs or initiatives\nPrepare high-quality reports and presentations targeted for specific audiences\nProactively highlight opportunities to develop and/or enhance existing tools and processes\nQualification:\nWho you are \nPost-secondary education with 1-2 years IT Application Development Experience\nAdvanced experience using Python, databricks Spark, SQL and Excel\nProficient experience with Word, MS Access (VBA programming), PowerPoint and relational databases (Oracle)\nFamiliarity with data warehouse and AWS (data lake) concepts\nKnowledge of key call center metrics/reporting and call center applications is an asset\nSolid analytical, logical and problem-solving skills\nStrong project management skills, with the ability to organize and prioritize multiple projects, competing requests and multiple tasks in a deadline-driven environment\nStrong written and oral communication skills\nWork independently in a fast-paced dynamic environment\nPossess an excellent work ethic and be self-motivated\nMust be able to travel between offices as necessary\nRequirement to work non-core hours from time-to-time (e.g. during application launch)\nReports are used for decision making purposes, therefore accuracy and the ability to meet timelines is crucial to the business\n\nAbout LoyaltyOne\nLoyaltyOne is part of the successful Alliance Data family of companies that provide the full range of data-driven loyalty, marketing and credit solutions in more than 80 locations across the globe.\nWorking with more than 100 leading brands in the retail, financial services, grocery, petroleum retail, travel and hospitality industries to profitably change customer behavior. Through a team of businesses, including one of the leading coalition loyalty programs in the world, the AIR MILES  Reward Program, LoyaltyOne designs, delivers and manages a suite of services focused on consumer data, customer-centric retail strategies, direct-to-consumer marketing, loyalty consulting and more.\nLoyaltyOne has broadened its horizons geographically by growing Precima in the European market. With the recent acquisition of BrandLoyalty in the Netherlands, LoyaltyOne has gained the expertise of a global leader in short-term loyalty campaigns, along with a client network that extends throughout Europe and Asia.\n\nAbout ADS\nAlliance Data  (NYSE: ADS) is a leading global provider of data-driven marketing and loyalty solutions serving large, consumer-based industries. The Company creates and deploys customized solutions, enhancing the critical customer marketing experience; the result is measurably changing consumer behavior while driving business growth and profitability for some of today's most recognizable brands. Alliance Data helps its clients create and increase customer loyalty through solutions that engage millions of customers each day across multiple touch points using traditional, digital, mobile and emerging technologies. An S&P 500 and Fortune 500 company headquartered in Plano, Texas, Alliance Data consists of three businesses that together employ more than 16,000 associates at approximately 100 locations worldwide. www.alliancedata.com\n\nAlliance Data is an Equal Employment Opportunity employer. Accordingly, we will make reasonable accommodations to respond to the needs of people with disabilities in accordance with legislation.\nAlliance Data participates in E-Verify.\nCheck us out   LoyaltyOne on Stack Overflow | LinkedIn | Glassdoor | Facebook |Twitter | Blog | Instagram", "link": "https://ca.indeed.com/viewjob?jk=868b0b6f130afcd7&tk=1d8uc23s50j02000&from=serp&vjs=3&advn=7042723621657021&adid=276050144&sjdu=i6xVERweJM_pVUvgf-Mzud6v7vx4W2vba62rTobId37eIK82uw1XRT7m-D8lI0g6"},
{"title": "Actuarial Analyst - Commercial Pricing", "company": "RSA", "link": "https://ca.indeed.com/viewjob?jk=ed335ce1e0b39e58&from=serp&vjs=3"},
{"title": "Actuarial Analyst - Commercial Pricing", "company": "CNS", "link": "https://ca.indeed.com/viewjob?jk=e1300a4a7665f0de&from=serp&vjs=3"},
{"title": "Analyste, titres de cr ance publics", "company": "CPP Investment Board", "descr": "Job Description\n\nLe groupe Titres de cr ance publics se concentre sur le d veloppement et la mise en  uvre de strat gies de b ta et d alpha adaptables. L analyste sera charg  d effectuer le suivi d analyses du rendement et des risques de portefeuille, y compris l laboration d outils et d une infrastructure pour y contribuer. La personne travaillera en  troite collaboration avec les gestionnaires de portefeuille pour  laborer des rapports et des outils qui faciliteront la surveillance de portefeuille, la recherche et l laboration de strat gies d op rations. Elle contribuera  galement   couvrir les risques du portefeuille, notamment en recommandant des positions et des op rations de taux d int r t et de change.\nResponsabilit s du poste\nRelevant du gestionnaire de portefeuille principal, Titres de cr ance publics, le titulaire du poste est principalement responsable de la surveillance, de la production de rapports et du rapprochement des risques et des profits du portefeuille. L analyste sera un acteur essentiel dans l laboration de l infrastructure des risques et des profits/pertes et du suivi de pond ration du portefeuille en fonction de diverses limites de risque. De plus, il sera responsable de la surveillance de l exposition au taux de change et au taux d int r t du portefeuille et aura la capacit  de recommander des positions alpha en fonction de la recherche et de la confiance. Les principales responsabilit s comprennent :\n laborer et am liorer des mod les financiers utilis s pour l valuation des produits   revenu fixe et de cr ance\nCalculs des profits et des pertes, du risque et d autres param tres du bureau de n gociation\nAider les gestionnaires de portefeuille dans la conception, la mise en  uvre et la surveillance de portefeuilles existants\nRep rer et analyser de nouvelles occasions de placement qui g n rent de l alpha dans cette cat gorie d actif\nEffectuer de fa on constante l optimisation et la refonte des processus de bureau et des outils strat giques pour accro tre l efficacit  du groupe", "link": "https://www.indeed.ca/viewjob?jk=8fb4be4af59e1e72&from=serp&vjs=3"},
{"title": "MES", "company": "Grantek Systems Integration", "descr": "Job Description\n\nAs a key member of Grantek s Engineering team, you will be focused on the design, implementation and deployment of Manufacturing Execution System (MES) solutions, using a variety of software tools. You will also be a vital link in Grantek s Smart Manufacturing practice, translating user requirements and customer business needs into fully-traceable and scalable MES solutions.\nGrantek will leverage your extensive industry knowledge and deep experience developing MES solutions to provide crucial support to our customers and their project needs, which are often global or continental in scope. Multi-site rollouts are commonplace, as Grantek s clients see us as trusted partners, and we hold these relationships sacred.\nYour in-depth knowledge and experience working within the pharmaceutical, food & beverage, and consumer packaged goods industry verticals, including the unique challenges and regulatory requirements therein, along with your ability to guide and mentor a small team of MES professionals will bolster our ever-growing Engineering team.\nKey-skills and interests: ANSI/ISA-95, ANSI/ISA-88, OEE downtime tracking and production scheduling, traceability and production tracking, statistical process control (SPC), recipe management and batch execution, enterprise resource planning (ERP) integration, high-level programming, information solutions, operational efficiency.\nPrimary Job Responsibilities:\nArchitecting, implementing, and integrating solutions focused around tracking, analyzing, and improving the manufacturing process\nDesigning and implementing data management strategies for the integration of MES solutions with our customers  ERP software and plant automation equipment\nConceptualizing solutions during the design phase of the project life cycle\nManufacturing execution system configuration, programming, debugging, and testing\nCreating documentation, including project engineering notes, project proposals, project design traceability documentation, case studies, and more\nCommissioning innovative solutions for our world-class customer base; finding, sharing and capitalizing on opportunities for improvement\nCreating methodologies and performing complex problem-solving\nLearning new technologies\nMentoring colleagues on your expertise and knowledge base\nHaving fun and being challenged\nTechnologies Used:\nERP Platforms: SAP, Microsoft Dynamics, etc.\nMES Platforms: Sepasoft MES, Werum PAS-X, Rockwell FactoryTalk Application Suites (CPG Suite, PharmaSuite), etc.\nSCADA Platforms: Rockwell, Inductive Automation, Wonderware, GE, Siemens, etc.\nHigh-level Programming: Python, JAVA, .NET, HTML5, SQL, VBA, etc.\nDatabase Platforms: Microsoft, Oracle, etc.\nOperating Systems: Microsoft (current and legacy to NT), Unix, Linux, etc.\nProject Documentation: Microsoft Office", "link": "https://ca.indeed.com/viewjob?jk=fd44a815806ef2e7&from=serp&vjs=3"},
{"title": "Digital Technology Specialist", "company": "Fidelity Investments", "descr": "Job Description\nEmerging Technologies Specialists\nBusiness Overview\nThe Emerging Technologies team is responsible for delivering technology solutions that support our digital customer service channels. We are seeking to revolutionize customers  financial lives. Our passion for placing the customer at the center of everything we do is driving a transformational shift, and the Emerging Technologies team will lead a digital and agile disruption to address customers  financial needs and goals.\n\n\nWe are looking to hire a highly motivated and passionate entrepreneur with a strong belief in transforming the future way of work.\nHow Your Work Impacts the Organization\nAs an Emerging Technologies Specialist, you will be responsible for transforming a traditional asset management model and processes into a beautiful digital experience. You will identify and evaluate new opportunities related to the adoption of new technologies. You will work with internal stakeholders across Fidelity Canada to ensure that technology research and adoption is aligned with the goal of creating amazing customer experiences.\nWhat You Will Do\nParticipate in emerging technology product development activities and provide business support on all Fidelity Canada innovation programs.\nIdentify and evaluate new opportunities related to the adoption of new technologies.\nPerforms research on industry trends, competitors, business and IT products; analyze trends and makes recommendations to business lines about potential opportunities\nBuild relationships with core business line leaders to develop a deep understanding of core business platforms and work collaboratively to define an approach to integrating new offerings that balances speed and scale.\nConduct quarterly meetings with divisional heads to solicit feedback on priority of initiatives and review industry trends\nAct as a brand ambassador for Fidelity Emerging Markets at customer events, conferences, and other forums\nPresent a Technology Overview to other Fidelity technical teams as required.\nThe Expertise You Bring\nMarket Research\nProven ability to identify new markets and new product opportunities\nResearch and analytical skills to evaluate and compare opportunities\nProduct Development\nKnowledge of rapid prototyping techniques, Agile product development, and other product management practices\nExperience in persona development, product positioning, and requirements creation\nRelationship and Influence\nProven experience working in a complex environment where relationship building is critical\nExperience working with external partners, customers and/or vendors to understand business process and flows to deliver solutions that meet business needs\nTechnologies\nRequired Experience\nArtificial Intelligence/Machine Learning/RPA\nUser experience design\nSaaS and cloud based solutions\nAssets to have\nBlockchain/cryptocurrencies\nApplication programming interface (API) and micro services\nProgramming Skills (VBA, R, JAVA, PYTHON)\nOther Key Competencies\nUniversity degree in the field of business, engineering, computer science, or equivalent work experience\n5+ years of technology and design experience in a progressive digital environment\nScrum and/or Agile methodologies experience\nStrong analytical skills with advanced skills in MS Excel\nComfortable dealing with ambiguity while understanding potential risks and threats\nAbility to work in a highly entrepreneurial, fast paced environment\nBy applying to this job, you are consenting to receive an automated acknowledgement of your application. Fidelity Canada welcomes and encourages applications from people with disabilities.\nAccommodations are available on request for candidates taking part in the selection process. If you require an accommodation, please e-mail us at:\nFidelityCanadaStaffing@fidelity.ca\nNo telephone inquiries or agencies please. We thank all applicants for their interest, please be advised that only those selected for an interview will be contacted.\nWhy work at Fidelity?\nWe are proud to the recipient of the following awards:\nCanada s Top Employers (2019)\nCanada s Top Employers for Young People (2019)\nCanada s Top Family Friendly Employers (2018)\n2018 National HR Awards - Queen s University IRC Professional Development Award", "link": "https://ca.indeed.com/viewjob?jk=6edec2b4f659f814&from=serp&vjs=3"},
{"title": "Senior Actuarial Analyst", "company": "RGA", "descr": "Position Overview\nThe Senior Actuarial Analyst will be part of Global Financial Solutions (GFS) which accounts for over 50% of RGA s consolidated income. The Longevity line of business is both new and one of RGA s fastest growing lines of business with benefit obligations in excess of  40 billion. The Sr. Actuarial Analyst will contribute to the development and implementation of ongoing monitoring processes and tools to ensuring that the Longevity line of business is managed to a standard at least as rigorous as that of RGA s other lines of business.\n\nResponsibilities\nConducting user testing of inforce data extracts on experience analysis and valuation platforms\nImplementing and maintaining inforce management and risk management processes, including premium vector maintenance activities\nModeling and analysis to monitor financial performance and risk metrics\nDeveloping, maintaining, reporting, and analysis of collateral models for the block of business\nExperience Analysis\n\nPartner with Operations, Valuation and Pricing to perform user testing of experience data extracts\nPerform mortality experience analysis against various bases using mortality analysis software\nExamines quality of source data and evaluates software output for accuracy and quality, understanding patterns and trends in analyzing the information\nActuarial Adjustments to Premiums (Premium Resets)\nSupport the Longevity team in the identification of data changes in the inforce file, revised premium cashflows and the resulting financial settlement\nReview the proposed data changes to ensure compliance with treaty terms\nReview the calculation of new monthly premium vectors encompassing the remaining life of the deal\nReview the retroactive benefit/cost of the change\nCollateral Monitoring and Management\n\nDevelop transaction specific cash flow models in order to estimate current and ongoing collateral needs\nMaintain and enhance existing models to ensure appropriate model capabilities and controls are in place\nCalculate and validate margin calls associated with collateral movements\nDevelop collateral projections, sensitivities, and management reports\nGain in-depth knowledge of the collateral provisions of each treaty in order to effectively monitor the collateral movement and expectations\nAnalyze collateral impacts resulting from changes in underlying data extracts\nInforce Monitoring and Data Analysis\n\nPartner with peers in Valuation and Operations to support the testing of valuation data extracts\nDevelop and implement system tools to monitor all aspects of the inforce business\nProvide analysis to support communication to executives and senior management groups\nPlan Cycle Support and Earnings Review\n\nSupport development and upload of Plan projections based on given inputs from Corporate Guidance\nDevelop systems and analysis to reveal the root causes of deviations from plan and/or from original pricing\n\nRequirements\nRequired:\n\nPassed 4 exams with the Society of Actuaries\n2+ years relevant experience\nUndergraduate degree in related field\nStrong modeling and technical skills, including database applications (Access, Oracle, SQL or equivalent technology), spreadsheets (VBA), statistical programs (R-code or Python) and actuarial software (MoSes, TAS, AXIS, Prophet, or equivalent)\nStrong analytical and problem solving skills\nEffective project management skills\nKnowledge of life, health, and/or annuity products\nEffective written and verbal communication skills, whereby complex and technical information can be conveyed in a way that is meaningful by all stakeholders\nEffective interpersonal skills, demonstrating the ability to work effectively with different stakeholders and disciplines across the company, including local offices, pricing, finance, valuation, investments, administration as well as external vendors\nAbility to work independently as well as within a team environment\nAbility to anticipate future needs; be proactive and adjust to constant change\nStrong time management skills and ability to manage multiple priorities, while dealing with ambiguity.\nStrong service and results orientation and a drive to make a difference\nPreferred:\n\nASA designation with the Society of Actuaries\nPrevious reinsurance experience\nPrevious experience with pensions\n\nCompany Overview\nReinsurance Group of America, Incorporated (NYSE: RGA) is a leader in the global life reinsurance industry with approximately $2.9 trillion of life reinsurance in force and assets of $44.7 billion. We are one of the largest life reinsurance companies in the world.\n\n#LI-OJ1\nJob Reference: CN00588", "link": "https://www.indeed.ca/viewjob?jk=f9d3734e82329a6f&from=serp&vjs=3"},
{"title": "Senior Pricing Actuary", "company": "Everest Re Group, Ltd.", "descr": "Everest Insurance Company of Canada, a member of the Everest Re Group, Ltd. is currently recruiting for a Senior Pricing Actuary to be located in Toronto. This is an exciting opportunity to play a key frontline role in providing production pricing support for Everest Insurance s Canada operations. Line of businesses include GL, Umbrella, Inland Marine and Property.\n\nResponsibilities will include:\n\nPortfolio price and risk monitoring;Enhancement of rating models and parameters;Planning and portfolio strategy, including account segmentation and property cat management;Involvement in ceded reinsurance submissions, evaluation and strategy;Evaluation of new program opportunities;Large and complex account pricing referrals;Support for supplemental Canadian regulatory filings\nQualifications:\n\n10-15 years of experience in the property-casualty insurance industry with significant commercial lines pricing experienceAnywhere from 5 exams to recent FCIAEnjoys fostering collaborative relationships with underwriting teamsFlexible and responsive to dynamic business needs including tight turnaround times and limited dataComfortable with autonomy, responsibility and visibilityExcel expertise a must.Proficiency in at least one of the following is a plus: SQL or MS Access, Excel VBA, Power BI, R, SAS, Python\nEverest is committed to recruiting and retaining the most talented individuals in the industry. We offer a dynamic work environment and a competitive compensation and benefit package which includes a 401k plan, retirement/savings option, tuition reimbursement, medical, dental, vision, life and group legal plans.\n\nEverest is an equal opportunity employer. All qualified applicants will receive consideration for employment without regard to race, color, religion or creed, sex (including pregnancy), sexual orientation, gender identity or expression, national origin or ancestry, citizenship, genetics, physical or mental disability, age, marital status, civil union status, family or parental status, veteran status, or any other characteristic protected by law.", "link": "https://ca.indeed.com/viewjob?jk=8459a9bd1bc8bfef&from=serp&vjs=3"},
{"title": "Software Engineer II", "company": "LoyaltyOne", "descr": "Description:\n\nWhy Work with Us \nAre you passionate about Data and Reporting?\nAs part of Member Experience Reporting team, the Software Engineer will play a critical role in making Member Experience data available in Data Hub and providing reports and insights that will help drive business decisions.\nWhat you ll do \nCreate pipelines in databricks to transfer data to Data Hub\nSupport other departments by producing self-serve reports / dashboards in Tableau to drive results\nConduct analysis and deliver key insights to address business problems or understand underlying trends to help evolve business strategies or in support of new programs or initiatives\nPrepare high-quality reports and presentations targeted for specific audiences\nProactively highlight opportunities to develop and/or enhance existing tools and processes\nQualification:\nWho you are \nPost-secondary education with 1-2 years IT Application Development Experience\nAdvanced experience using Python, databricks Spark, SQL and Excel\nProficient experience with Word, MS Access (VBA programming), PowerPoint and relational databases (Oracle)\nFamiliarity with data warehouse and AWS (data lake) concepts\nKnowledge of key call center metrics/reporting and call center applications is an asset\nSolid analytical, logical and problem-solving skills\nStrong project management skills, with the ability to organize and prioritize multiple projects, competing requests and multiple tasks in a deadline-driven environment\nStrong written and oral communication skills\nWork independently in a fast-paced dynamic environment\nPossess an excellent work ethic and be self-motivated\nMust be able to travel between offices as necessary\nRequirement to work non-core hours from time-to-time (e.g. during application launch)\nReports are used for decision making purposes, therefore accuracy and the ability to meet timelines is crucial to the business\n\nAbout LoyaltyOne\nLoyaltyOne is part of the successful Alliance Data family of companies that provide the full range of data-driven loyalty, marketing and credit solutions in more than 80 locations across the globe.\nWorking with more than 100 leading brands in the retail, financial services, grocery, petroleum retail, travel and hospitality industries to profitably change customer behavior. Through a team of businesses, including one of the leading coalition loyalty programs in the world, the AIR MILES  Reward Program, LoyaltyOne designs, delivers and manages a suite of services focused on consumer data, customer-centric retail strategies, direct-to-consumer marketing, loyalty consulting and more.\nLoyaltyOne has broadened its horizons geographically by growing Precima in the European market. With the recent acquisition of BrandLoyalty in the Netherlands, LoyaltyOne has gained the expertise of a global leader in short-term loyalty campaigns, along with a client network that extends throughout Europe and Asia.\n\nAbout ADS\nAlliance Data  (NYSE: ADS) is a leading global provider of data-driven marketing and loyalty solutions serving large, consumer-based industries. The Company creates and deploys customized solutions, enhancing the critical customer marketing experience; the result is measurably changing consumer behavior while driving business growth and profitability for some of today's most recognizable brands. Alliance Data helps its clients create and increase customer loyalty through solutions that engage millions of customers each day across multiple touch points using traditional, digital, mobile and emerging technologies. An S&P 500 and Fortune 500 company headquartered in Plano, Texas, Alliance Data consists of three businesses that together employ more than 16,000 associates at approximately 100 locations worldwide. www.alliancedata.com\n\nAlliance Data is an Equal Employment Opportunity employer. Accordingly, we will make reasonable accommodations to respond to the needs of people with disabilities in accordance with legislation.\nAlliance Data participates in E-Verify.\nCheck us out   LoyaltyOne on Stack Overflow | LinkedIn | Glassdoor | Facebook |Twitter | Blog | Instagram", "link": "https://ca.indeed.com/viewjob?jk=868b0b6f130afcd7&tk=1d8uc24lg0j02000&from=serp&vjs=3&advn=7042723621657021&adid=276050144&sjdu=i6xVERweJM_pVUvgf-Mzud6v7vx4W2vba62rTobId37eIK82uw1XRT7m-D8lI0g6"},
{"title": "Senior Specialist, Process Innovation", "company": "Samsung Electronics", "descr": "Position Summary\nThe Senior Specialist in Process Innovation will review all operations and processes related to Retail, sales, Supply Chain Management (SCM), Logistics, Finance and Service to identify areas of improvement, develop action/project plans to address and follow through to implementation. This person will focus on value added projects to optimize the functional processes and the operational systems utilizing data driven analytics. The position will be a key liaison between Sales & Marketing, SCM, Logistics, Business Operations Center (BOC), Information Technology (MIS), Finance and Service and will interact with Samsung Corporate Headquarters(HQ), North American Headquarters (NAHQ), Samsung sister companies such as Samsung SDS, External Customers and 3rd party Vendors on projects they lead.\nRole and Responsibilities\nEssential Duties and Responsibilities:\nResponsible for the development of new Process Innovation Projects related to operation optimization and process efficiency and ensuring successful delivery of projects: Project Plan\nEnsures execution of projects developed\nResponsible to establish timelines, ownership, key milestones and to follow-up with stakeholders on all deliverables\nResponsible to monitor project execution and develops follow-up plan in case change/improvement are required based on the feedback\nResponsible for the adoption and coordination of new operational process or system changes ensuring alignment to HQ guidelines\nResponsible to resolve escalations through interaction with all levels within Sales and Marketing, SCM, Logistics, BOC, Finance and Service to ensure that needs are identified and immediate resolution found for critical SCM operational barriers\nCoordination of required System/process implementation\nTraining for new Process or functional system delivered by project\nImplementing a robust KPI monitoring system at Project end to measure short/long term results\nResponsible to present strategic ideas to executives, tactical plans to managers and operational tasks to employees in addition to gaining consensus from all levels of the organization\nReview and Coordinate the updates of new policies and procedures in GPPM\nKnowledge:\nEducation focused on a technical discipline is an asset (Computer Science, Engineering, etc)\nExpert Knowledge of Business Systems (SAP required, SFDC an asset)\nMS Office suite required, Strong Excel VBA, SQL an asset, R and Python an asset\nAbility to evaluate and analyze complex systems data and determine appropriate actions\nStrong interpersonal skills with the ability to influence without authority\nAdvanced in Microsoft Office (Excel, Access, PowerPoint, Visio, Word, Outlook),\nExperience:\nProject Management experience required (PMP an asset)\nLean Six Sigma experience an Asset\n3-5 years of work related experience supply chain processes and/or retail channel within electronics industry\nCompetencies:\nStrong Data analysis\nThe ability to develop and maintain excellent working relationships with multiple levels within and outside the company. Must be able to influence others in acceptance, approval, and providing project description.\nThe ability to plan, organize, and prioritize multiple assignments and projects.\nThe ability to work in a team environment to identify and achieve team project goals and results, including the completion of assignments within established time frames.\nDemonstrated ability to Interact with all levels within the organization\nStrong interpersonal and analytical skills\nSkills and Qualifications\nSamsung is an equal employment opportunity employer.\nSamsung has an accommodation process in place and provides accommodations for job applicants with disabilities as appropriate. Assessment and selection materials and procedures can be made available in accessible formats and methods as appropriate. If you require a specific accommodation because of disability or medical need, please let us know when selected to take part in our recruitment process so that reasonable arrangements can be made for the appropriate accommodations to be in place as you move through our process.\nWe thank you for your interest in working for Samsung. Only candidates selected for an interview will be contacted.\n#LI-DJ1\n#indhigh\n* Please visit Samsung membership to see Privacy Policy, which defaults according to your location. You can change Country/Language at the bottom of the page. If you are European Economic Resident, please click here .", "link": "https://ca.indeed.com/viewjob?jk=4e4071e6212274dd&tk=1d8uc24le0j02001&from=serp&vjs=3&advn=4239586925542806&adid=192544934&sjdu=SiFHkPhkZXklx1BTeo8ye7P5n_-s08hrxMD-dtpZk1mNTAFRPpsSNCj5n5rye5lRDM3_fIKHIPOT2t6btmZj70bWxM9QQUtCzgscF56GXoaFNI8Kh2pSkVkX1-iPWXIQ8cmXIpoQ7ajHYZVrgXbVJkJ62_NkPPmsqUvzB3Ka2tTbj1wgapo-kDUYNzHRnF1l9owAEa2u-3z1BAnD3hr-jA"},
{"title": "Software Engineer II", "company": "LoyaltyOne", "descr": "Description:\n\nWhy Work with Us \nAre you passionate about Data and Reporting?\nAs part of Member Experience Reporting team, the Software Engineer will play a critical role in making Member Experience data available in Data Hub and providing reports and insights that will help drive business decisions.\nWhat you ll do \nCreate pipelines in databricks to transfer data to Data Hub\nSupport other departments by producing self-serve reports / dashboards in Tableau to drive results\nConduct analysis and deliver key insights to address business problems or understand underlying trends to help evolve business strategies or in support of new programs or initiatives\nPrepare high-quality reports and presentations targeted for specific audiences\nProactively highlight opportunities to develop and/or enhance existing tools and processes\nQualification:\nWho you are \nPost-secondary education with 1-2 years IT Application Development Experience\nAdvanced experience using Python, databricks Spark, SQL and Excel\nProficient experience with Word, MS Access (VBA programming), PowerPoint and relational databases (Oracle)\nFamiliarity with data warehouse and AWS (data lake) concepts\nKnowledge of key call center metrics/reporting and call center applications is an asset\nSolid analytical, logical and problem-solving skills\nStrong project management skills, with the ability to organize and prioritize multiple projects, competing requests and multiple tasks in a deadline-driven environment\nStrong written and oral communication skills\nWork independently in a fast-paced dynamic environment\nPossess an excellent work ethic and be self-motivated\nMust be able to travel between offices as necessary\nRequirement to work non-core hours from time-to-time (e.g. during application launch)\nReports are used for decision making purposes, therefore accuracy and the ability to meet timelines is crucial to the business\n\nAbout LoyaltyOne\nLoyaltyOne is part of the successful Alliance Data family of companies that provide the full range of data-driven loyalty, marketing and credit solutions in more than 80 locations across the globe.\nWorking with more than 100 leading brands in the retail, financial services, grocery, petroleum retail, travel and hospitality industries to profitably change customer behavior. Through a team of businesses, including one of the leading coalition loyalty programs in the world, the AIR MILES  Reward Program, LoyaltyOne designs, delivers and manages a suite of services focused on consumer data, customer-centric retail strategies, direct-to-consumer marketing, loyalty consulting and more.\nLoyaltyOne has broadened its horizons geographically by growing Precima in the European market. With the recent acquisition of BrandLoyalty in the Netherlands, LoyaltyOne has gained the expertise of a global leader in short-term loyalty campaigns, along with a client network that extends throughout Europe and Asia.\n\nAbout ADS\nAlliance Data  (NYSE: ADS) is a leading global provider of data-driven marketing and loyalty solutions serving large, consumer-based industries. The Company creates and deploys customized solutions, enhancing the critical customer marketing experience; the result is measurably changing consumer behavior while driving business growth and profitability for some of today's most recognizable brands. Alliance Data helps its clients create and increase customer loyalty through solutions that engage millions of customers each day across multiple touch points using traditional, digital, mobile and emerging technologies. An S&P 500 and Fortune 500 company headquartered in Plano, Texas, Alliance Data consists of three businesses that together employ more than 16,000 associates at approximately 100 locations worldwide. www.alliancedata.com\n\nAlliance Data is an Equal Employment Opportunity employer. Accordingly, we will make reasonable accommodations to respond to the needs of people with disabilities in accordance with legislation.\nAlliance Data participates in E-Verify.\nCheck us out   LoyaltyOne on Stack Overflow | LinkedIn | Glassdoor | Facebook |Twitter | Blog | Instagram", "link": "https://ca.indeed.com/viewjob?jk=868b0b6f130afcd7&tk=1d8uc24lk0j02001&from=serp&vjs=3&advn=7042723621657021&adid=276050144&sjdu=i6xVERweJM_pVUvgf-Mzud6v7vx4W2vba62rTobId37eIK82uw1XRT7m-D8lI0g6"},
{"title": "Senior Credit Risk Analyst", "company": "Rogers Communications", "descr": "At Rogers, we connect Canadians to a world of possibilities and the memorable moments that matter most in their lives. Every day we wake up with one purpose in mind. To bring loved ones together from across the globe. To connect people to each other and the world around them. To help an entrepreneur realize her dream. A sports fan celebrate a special moment.\n\nBecause we believe connections unite us, possibilities fuels us, and moments define us.\n\nThe Senior Credit Risk Analyst will utilize data mining techniques to optimize risk and reward of Rogers Bank Credit Card products.\n\nResponsibilities will include:\nCredit loss forecasting, planning, and procedures specific to IFRS9 Expected Credit Loss (ECL) methodology\nExecute credit risk account-management programs as required\nCollaborate on the development of credit risk models including validation, documentation, and performance tracking\nIdentify patterns and trends associated with multiple risk lifecycle strategies including origination, account management and collections\nReview and develop existing and new customer risk segments and identify risk factors using statistical modelling techniques\nQuantify impact in key revenue and loss metrics resulting from potential/actual changes to risk strategy and process\nProvide recommendations to improve and optimize portfolio performance from a risk strategy and risk process perspective\nSummarize and communicate results of findings to different audiences with various levels of technical and business background\nMaintain and develop reports to evaluate key metrics\nCollaborate with the design of champion-challenger strategies, test case design, implementation and monitoring\nContribute to execution of strategic cross-functional/organizational (client relationship, marketing, credit risk, operations) initiatives\n\nRequired Qualifications:\nBachelor degree in Mathematics, Statistics, Business, Finance, Economics or equivalent quantitative field\n2-4 years working within the consumer finance / credit card environment is preferred\nIdeal candidate would have experience in IFRS9 principles, and implementation\nData analysis skills must include 3-5 years of experience using statistical programs such as SAS, Knowledge Studio, Enterprise Miner, Python or R\nStrong analytical and statistical knowledge with an ability to combine quantitative and common-sense problem solving skills\nHighly proficient with the use of database querying tools such as SQL\nHighly proficient with Microsoft office applications - advanced Excel (knowledge of macros-VBA and pivot tables)\nEffective communication (written and verbal) and time management required\nSelf-starter, able to manage and prioritize multiple complex tasks with minimum supervision and strong attention to detail\nDesire to learn and succeed in a challenging fast-paced environment\non\nSchedule: Full time\nShift: Day\nLength of Contract: Not Applicable (Regular Position)\nWork Location: 350 Bloor Street East (299), Toronto, ON\nTravel Requirements: None\nPosting Category/Function: Finance & Accounting & Enterprise Risk Management\nRequisition ID: 137542\n\nTogether, we'll make more possible, and these six shared values guide and define our work:\n\nOur people are at the heart of our success\nOur customers come first. They inspire everything we do\nWe do what s right, each and every day\nWe believe in the power of new ideas\nWe work as one team, with one vision\nWe give back to our communities and protect our environment\n\nWhat makes us different makes us stronger. Rogers has a strong commitment to diversity and inclusion. Everyone who applies for a job will be considered. We recognize the business value in creating a workplace where each team member has the tools to reach their full potential. At Rogers, we value the insights and innovation that diverse teams bring to work. We work with our candidates with disabilities throughout the recruitment process to ensure that they have what they need to be at their best. Please reach out to our recruiters and hiring managers to begin a conversation about how we can ensure that you deliver your best work. You can also reach out to our team at RogersRecruiting@rci.rogers.com to begin a conversation about your individual accessibility needs throughout the hiring process.\n\nPosting Notes: [[req_strategyPage]]", "link": "https://ca.indeed.com/viewjob?jk=9d8afe5070e307c8&from=serp&vjs=3"},
{"title": "Senior Specialist, Process Innovation", "company": "Samsung Electronics", "descr": "Position Summary\nThe Senior Specialist in Process Innovation will review all operations and processes related to Retail, sales, Supply Chain Management (SCM), Logistics, Finance and Service to identify areas of improvement, develop action/project plans to address and follow through to implementation. This person will focus on value added projects to optimize the functional processes and the operational systems utilizing data driven analytics. The position will be a key liaison between Sales & Marketing, SCM, Logistics, Business Operations Center (BOC), Information Technology (MIS), Finance and Service and will interact with Samsung Corporate Headquarters(HQ), North American Headquarters (NAHQ), Samsung sister companies such as Samsung SDS, External Customers and 3rd party Vendors on projects they lead.\nRole and Responsibilities\nEssential Duties and Responsibilities:\nResponsible for the development of new Process Innovation Projects related to operation optimization and process efficiency and ensuring successful delivery of projects: Project Plan\nEnsures execution of projects developed\nResponsible to establish timelines, ownership, key milestones and to follow-up with stakeholders on all deliverables\nResponsible to monitor project execution and develops follow-up plan in case change/improvement are required based on the feedback\nResponsible for the adoption and coordination of new operational process or system changes ensuring alignment to HQ guidelines\nResponsible to resolve escalations through interaction with all levels within Sales and Marketing, SCM, Logistics, BOC, Finance and Service to ensure that needs are identified and immediate resolution found for critical SCM operational barriers\nCoordination of required System/process implementation\nTraining for new Process or functional system delivered by project\nImplementing a robust KPI monitoring system at Project end to measure short/long term results\nResponsible to present strategic ideas to executives, tactical plans to managers and operational tasks to employees in addition to gaining consensus from all levels of the organization\nReview and Coordinate the updates of new policies and procedures in GPPM\nKnowledge:\nEducation focused on a technical discipline is an asset (Computer Science, Engineering, etc)\nExpert Knowledge of Business Systems (SAP required, SFDC an asset)\nMS Office suite required, Strong Excel VBA, SQL an asset, R and Python an asset\nAbility to evaluate and analyze complex systems data and determine appropriate actions\nStrong interpersonal skills with the ability to influence without authority\nAdvanced in Microsoft Office (Excel, Access, PowerPoint, Visio, Word, Outlook),\nExperience:\nProject Management experience required (PMP an asset)\nLean Six Sigma experience an Asset\n3-5 years of work related experience supply chain processes and/or retail channel within electronics industry\nCompetencies:\nStrong Data analysis\nThe ability to develop and maintain excellent working relationships with multiple levels within and outside the company. Must be able to influence others in acceptance, approval, and providing project description.\nThe ability to plan, organize, and prioritize multiple assignments and projects.\nThe ability to work in a team environment to identify and achieve team project goals and results, including the completion of assignments within established time frames.\nDemonstrated ability to Interact with all levels within the organization\nStrong interpersonal and analytical skills\nSkills and Qualifications\nSamsung is an equal employment opportunity employer.\nSamsung has an accommodation process in place and provides accommodations for job applicants with disabilities as appropriate. Assessment and selection materials and procedures can be made available in accessible formats and methods as appropriate. If you require a specific accommodation because of disability or medical need, please let us know when selected to take part in our recruitment process so that reasonable arrangements can be made for the appropriate accommodations to be in place as you move through our process.\nWe thank you for your interest in working for Samsung. Only candidates selected for an interview will be contacted.\n#LI-DJ1\n#indhigh\n* Please visit Samsung membership to see Privacy Policy, which defaults according to your location. You can change Country/Language at the bottom of the page. If you are European Economic Resident, please click here .", "link": "https://ca.indeed.com/viewjob?jk=4e4071e6212274dd&from=serp&vjs=3"},
{"title": "Manager, Credit Risk Analytics", "company": "Scotiabank", "descr": "Requisition ID: 58564\nJoin the Global Community of Scotiabankers to help customers become better off.\nThe Manager takes initiatives to evaluate and improve the IFRS 9 Expected Credit Loss (ECL) models and Provision for Credit Loss (PCL) measures. This role primarily involves code development work around the ECL calculation as well as working with different stakeholders to determine new and changing requirements. There is also work associated to validating and analyzing the metrics produced and the cause for the changes.\nKey Accountabilities:\nMaintain and improve upon the IFRS9 ECL ecosystem, including production process, Web UI application, analytics and reporting functions\nWork with the Information Technology & Support (IT&S) team to implement and improve ECL methodology in the production environment and ensure seamless production process each quarter.\nWork with IT&S for automation in the IFRS 9 parallel year, production and strategic states. This includes reporting automation, data flow infrastructure and security controls\nWork with key stakeholders in developing the IFRS 9 end-to-end process, which includes project planning, data reconciliation, model implementation, control process, governance and reporting.\nCollaborate with internal stakeholders such as Internal Ratings Management, Enterprise Stress Testing, Information Technology & Systems (IT&S) business lines, and Enterprise Risk Management for methodology improvement to ECL and capital. Apply specialized knowledge of Expected credit loss methodology, in ECL analytics and implementation. Assist the internal and external ECL reporting and disclosure.\nEnsure compliance with relevant internal policies, procedures and regulatory requirements. Manage timely resolution of audit and regulatory issues.\nEDUCATION/WORK EXPERIENCE/DESIGNATIONS:\nQuantitative educational background: Math, Finance, Physics, or other quantitative areas\nPreferred work experience: 3 years + of relevant analytical work experience; familiar with Git, Bitbucket/GitHub, JIRA; prior experience with Power BI, Tableau etc.\nKnowledge in regulatory capital requirements, credit product knowledge and capital modeling\nTechnical capacity: strong programming skills in SQL, VBA, Python and R.\nComfort and experience working in a project context and juggling multiple competing priorities\nStrong organizational and analytical skills.\nCritical thinking skills and ability to work under tight timelines.\nGood verbal and written communication skills and proven problem solving skills\nLocation(s): Canada : Ontario : Toronto\nAs Canada s International Bank, we are a leader when it comes to inclusion. We are a diverse and global team, speaking more than 100 languages with backgrounds from more than 120 countries. We value the unique skills and experiences each individual brings to the bank, and are committed to creating and maintaining an inclusive and accessible environment for everyone. Candidates selected for an interview will be contacted directly. If you require accommodation during the recruitment and selection process, please let us know. We will work with you to provide as seamless a recruitment experience as possible.", "link": "https://ca.indeed.com/viewjob?jk=278a61358232a4b8&from=serp&vjs=3"},
{"title": "Senior Analyst, Risk", "company": "President's Choice Financial", "descr": "Senior Analyst, Risk\n\n25 York Street, Toronto, Ontario, M5J 2V5\nPresident s Choice Bank is a wholly-owned subsidiary of Loblaw Companies Limited (LCL) and was established to promote President s Choice Financial services offered by strategic partners in all regions of Canada. PCF has grown to over 3 million customers earning millions in better interest rates, free groceries and other rewards. It operates in the following segments:\nMastercard : The President s Choice Financial Mastercard is offered and operated by President s Choice Bank.\nInsurance : Home and auto insurance, travel and pet insurance are offered through affiliates and relationships with several insurance companies.\nPC Services , which includes PC Financial Insurance, The Mobile Shop, Prepaid Cell Phones Express and gift card businesses, is a new business in growth mode.\nPC Optimum : All PCF customers have the opportunity to earn PC Optimum Points that can be earned and redeemed in all LCL stores.\nLoblaws Inc. is a wholly-owned subsidiary of Loblaw Companies Limited (LCL). LCL is Canada s food and pharmacy leader, with a network of corporate and independently- operated stores in communities across the country, employing close to 200,000 Canadians. PCF is an important business unit within LCL that manages and develops products and service programs to improve the customer experience, maximize value, and provide a platform to enhance customer insights and relationships. PCF s vision is to provide superior value financial products to consumers.\nAs the Senior Analyst of Credit Risk, you will be responsible for designing, implementing and monitoring risk strategies related to credit allocations for current and future financial products.\nWhat You'll Do:\nDevelop and maintain customer-centric credit risk strategies across the credit life cycle stages for allocating revolving credit allowances\nCreate incentives to encourage responsible customer use of revolving credit allowances\nProvide risk analytics, P&L summaries and daily/monthly reporting for customer activities\nClosely monitor performance to ensure each strategy is delivering both optimal profitability and is aligned with the credit risk appetite\nLeverage Champion/Challenger capabilities; investigate, test and implement new data analysis and strategy building techniques to continually evolve credit strategies\nWhat You'll Need:\nUniversity degree in a quantitative field, Economics, Business Administration, Statistics, Mathematics, Computer Science or equivalent\n2+ years working in the retail financial industry, credit risk management preferred\n1+ years working experience in credit risk strategy development\n1+ year of experience in a data analysis / financial modeling / data mining role\nKnowledge of credit scoring and risk assessment as well as portfolio management and behaviour\nSubject matter expert on life cycle risk technology & systems: TRIAD, TSYS, Decision Optimizer\nProficient with statistical analysis and data science software (e.g. SAS, SPSS, R, Python, tableau)\nExcellent analytical, storytelling, problem-solving and presentation skills.\nSelf-starter able to work under pressure and tight timelines\nHigh degree of proficiency in MS Office Applications including Excel, Access, PowerPoint, VBA\nExcellent interpersonal skills to work with multiple stakeholders and garner consensus\n#LI-MM2\nCome and join a winning team who demonstrates innovation, energy, creativity and vision. We recognize the importance of a diverse workforce and we therefor encourage applications from Aboriginal Peoples, women, members of a visible minority and persons with a disability. We thank all applicants for their interest, however, only those selected for an interview will be contacted.\nNumber of Openings:\n1\nPC Financial recognizes Canada's diversity as a source of national pride and strength. We have made it a priority to reflect our nation s evolving diversity in the products we sell, the people we hire, and the culture we create in our organization. Accommodation is available upon request for applicants and colleagues with disabilities.\nIn addition, we believe that compliance with laws is about doing the right thing. Upholding the law is part of our Code of Conduct   it reinforces what our customers and stakeholders expect of us.\nPlease Note: If you have Employee Self Service (ESS) on Workday, apply to this job via the Workday application.", "link": "https://ca.indeed.com/viewjob?jk=46888475503d3b9e&from=serp&vjs=3"},
{"title": "Manager, Trade Floor Risk Management", "company": "Scotiabank", "descr": "Requisition ID: 58458\nJoin the Global Community of Scotiabankers to help customers become better off.\nPurpose\nTrade Floor Risk Management (TFRM) is an independent arm of the bank that provides market risk oversight for the bank s trading, balance sheet and liquidity management activities. It ensures that these activities are in line with bank s risk appetite by producing detailed and regular risk reports and analysis, designing and monitoring limits, by maintaining an active dialogue with the business units and, when required, escalating concerns to appropriate levels of management. TFRM is responsible for validating regulatory metrics such as those produced as per the Volcker Rule. It is also responsible for formulating valuation and market risk management policies and is a key stakeholder in monthly/quarterly/yearly valuation processes.\nThe TFRM XVA team within the oversees the XVA desk within Global Banking and Markets (GBM) which includes managing of the Credit Valuation Adjustment (CVA / DVA), Funding Valuation Adjustment (FVA) and Collateral Valuation Adjustment (ColVA). The team also works closely with other relevant teams covering derivatives trading in rates, credit, FX, Energy and Equity asset classes in locations expanding Toronto, London, New York, Singapore and the Pacific Alliance\nThis is an excellent role for a highly motivated individual aspiring to consolidate a career in market risk management. The successful candidate will have opportunity to deepen her understanding of OTC derivative products and related valuation adjustments, and market risk arising from trading the same.\nKey Accountabilities\nMarket Risk   Oversee market risk exposures for the XVA desk and communicate to TFRM management on trading risks, trader sentiment and market conditions. Help ensure adherence with Bank s risk appetite and the business' mandate. Review daily P&L, risk and limit reports, and engage in discussions with the global team and trading management as appropriate.\nDaily oversight of XVA calculation and support of XVA desk, e.g. producing daily CVA summary and analytics, supporting XVA configurations, coordinate one-off investigation and impact analysis.\nPartnership with Trading   Engage trading groups in a proactive manner to promote open communication between risk and trading.\nLimit Adjudication   Review and make recommendations to TFRM management on limit change requests.\nCommunication   Communicate regularly with TFRM management on trading activity, trading risk profile, trader sentiment and market developments in covered businesses. Collaborate with other Bank and GRM stakeholders to achieve common objectives.\nRegulatory & Audit   Participate in external and internal audits and resolution of findings and participate in key regulatory initiatives (e.g. FRTB).\nTechnology   Participate in enhancement / upgrade of production and risk systems as needed (i.e. Qlikview, Tableau etc.)\nSkills\nStrong understanding of market risk principles related to OTC derivative products including credit exposure and mitigants, funding costs.\nStrong analytical and problem solving skills with the proven record of creativity and innovation.\nFamiliarity with risk measurement concepts such as VaR, Stressed VaR, DV01 etc.\nAbility to manage projects independently while collaborating with different stakeholders.\nProficiency at integrating and preparing large varied datasets. Experience in the use of data analysis, reporting and visualization tools, e.g. Tableau.\nExcellent work ethic and communications skills with a focus on collaboration and team work and suited for a fast-paced trade floor environment.\nEducational Requirements\nQuantitative undergraduate degree (e.g. finance, mathematics, statistics, and engineering) plus Masters preferred (e.g. MFE, MMF, or MBA).\nProgress towards or completion of FRM/PRM/CFA an asset.\nProgramming and data visualization experience, e.g. VBA, Python, Tableau.\nLocation(s): Canada : Ontario : Toronto\nAs Canada s International Bank, we are a leader when it comes to inclusion. We are a diverse and global team, speaking more than 100 languages with backgrounds from more than 120 countries. We value the unique skills and experiences each individual brings to the bank, and are committed to creating and maintaining an inclusive and accessible environment for everyone. Candidates selected for an interview will be contacted directly. If you require accommodation during the recruitment and selection process, please let us know. We will work with you to provide as seamless a recruitment experience as possible.", "link": "https://ca.indeed.com/viewjob?jk=ece1716e2955c698&from=serp&vjs=3"},
{"title": "Senior Manager, Treasury Analytics", "company": "Scotiabank", "descr": "Requisition ID: 59470\nJoin the Global Community of Scotiabankers to help customers become better off.\nThe Senior Manager, Treasury Analytics provides analytical support to the International Treasury team to facilitate effective governance and strategy orchestration on key topics such as Interest Rate Risk management, liquidity risk management, investments and FX hedging for treasury locations across Latin America, Central America and the Caribbean locations of the bank.\n\nACCOUNTABILITIES\n1. Work on development and implementation of balance sheet analytics related to,\nModelling non-maturity deposits;\nCalibrating mortgage prepayment rate;\nModelling term deposits with early redemptions\n\n2. Develop tools and work on ad-hoc analysis related to,\nInterest Rate Risk i.e. simulation of balance sheet and interest rate movements;\nLiquidity risk and metrics such as Liquidity Coverage Ratio;\nInvestment portfolio across IB locations;\nFX hedging: recommend hedging strategies along with analytics based on market driven events;\nDevelop tools to analyze impact of key balance sheet changes such as asset composition, funding mix and rate movements;\nManagement reporting: Develop, implement and maintain weekly, monthly, quarterly and ad-hoc reports\n\n3. Ensure alignment of ALM methodology, measurement and policies\nWork closely and coordinate on topics such as balance sheet management, risk limits, key exposures, regulatory initiatives etc.;\nParticipate and work on regulatory initiatives such as IRRBB and FRTB while working with GRM and Treasury;\nReview ALM related policies for different countries and update the International Treasury guidelines.\n\n4. Maintain working relationships with internal stakeholders such as local Treasury teams and the relevant support functions\n\nSKILLS, EXPERIENCES AND FUNCTIONAL COMPETENCIES REQUIRED:\nUndergraduate in Business, Finance or Accounting;\nCFA / FRM designations is desirable\nSolid knowledge of Financial Products including money market and derivative products;\nProficiency with use of Excel, VBA, Bloomberg and programming language(s) such as Python;\nUnderstanding of the Scotiabank operations and Finance systems (INEA);\nFamiliarity with the relevant regulations i.e. IRRBB, FRTB, Basel 3, Volcker;\nExceptional communication skills, both verbal and written;\nSelf-driven, analytical and colloborative;\nAbility to speak Spanish\nLocation(s): Canada : Ontario : Toronto\nAs Canada s International Bank, we are a leader when it comes to inclusion. We are a diverse and global team, speaking more than 100 languages with backgrounds from more than 120 countries. We value the unique skills and experiences each individual brings to the bank, and are committed to creating and maintaining an inclusive and accessible environment for everyone. Candidates selected for an interview will be contacted directly. If you require accommodation during the recruitment and selection process, please let us know. We will work with you to provide as seamless a recruitment experience as possible.\nALL POSTINGS IN ME@SCOTIABANK WILL REMAIN LIVE FOR A MINIMUM OF 5 DAYS.", "link": "https://ca.indeed.com/viewjob?jk=382e57d64f87d11b&from=serp&vjs=3"},
{"title": "Senior Analyst - Fixed Income, Currencies, and Commodities, P & L/PAA", "company": "BMO Financial Group", "descr": "Who We Are\nThe Global Middle Office is the first line of defence, and the go-to team for our Trading Products, Capital Markets business partners. Our broad mandate includes: Profit & Loss and Profit Attribution Reporting & Analysis; Trade Desk Support; Product Control; Collateral Management; Data Governance, Reporting & Analytics; and everything in-between.\nWe are a group of Finance professionals, where our collective experiences are as diverse as our mandate. We work hard, and are always ready to tackle the next opportunity. We do not shy away from challenging the status quo and always promote best practices, often leading the charge across all initiatives.\n\nAbout the Role\nYou will be responsible for the accurate, complete, and timely generation of daily and monthly P&L (Profit & Loss) and PAA (Profit Attribution and Analysis) reporting. The role requires specialized business and valuation skills in order to provide transparency, obtain concurrence, and provide quality analytics of P&L for the Capital Markets and Corporate Treasury trading businesses, while acting as the key escalation point for the P&L reconciliations process. The role requires the application of in-depth product knowledge, trade flow reconciliation, and profit attribution knowledge to ensure consistency and effectiveness of drilling down of the P&L drivers to support Capital Markets and Corporate Treasury trading businesses.\nYou are accountable for developing and executing against department goals and personal objectives while partnering with internal business partners (e.g. Global Middle Office, Market Risk, Finance, Technology, Operations, Pricing, Accounting) to meet service delivery expectations at the operational level.\nYou will provide professional / technical advice as the subject matter expert to internal business partners and Product Operations colleagues on the P&L reporting process. We will rely on you to manage the quality and continuous improvement of existing standards, processes, and policies.\nWho You Are\nYou are an eager self-starter with an impeccable attention to detail who feels a personal sense of responsibility for getting the job done right the first time. You are an active communicator who can clearly and effectively tailor your message for the right audience, while bringing together large groups with a deep understanding of the roles of all involved parties in order to meet a target goal. You excel in an environment where problem-solving becomes second-nature and you can dive into problems to understand their root cause, while offering solutions within the risk appetite of the group. You have a knack for data, and have the ability to tell a story with numbers. You know how to present complex financial information in easily digestible formats.\nWhy Us?\nThe Global Middle Office is a high-demand area as we offer our team members with a collaborative, high-energy work environment that welcomes diverse backgrounds and experiences. You are provided with the autonomy to explore your areas of interest in a meaningful way. The breadth of our mandate and our cultural motivation to spearhead initiatives will get you involved in the processes of numerous areas within the bank, naturally exposing you to differing viewpoints and objectives. We offer numerous areas for growth including a constant supply for your endless thirst for learning, as well as through upward mobility opportunities. We pride ourselves in our work ethic and constant desire to improve, replicate, and iterate.\nIf you want to join this group of extremely talented people, we welcome your application. Though we thank all candidates for their time and consideration, we will only contact those selected for an interview\nQualifications\nKnowledge and Skills:\nAt a minimum, you hold a Bachelor s degree in a related field. You are a product expert in the areas of fixed income, and other interest and credit related hedging instruments including swaps, futures, and options. The  Senior  in your working title brings with you a commensurate amount of experience (3-5 years) from a related field where you demonstrated expertise in the areas of P&L, Risk Reporting, Trade Support, Accounting, Finance, Trading, or other operational areas in support of the trade lifecycle. It also means you have a willingness to take the lead on projects, processes, and people; and are comfortable acting in a leadership capacity. You remain professional under pressure and demonstrate responsible decision-making in ways that create additional value. You build effective relationships and are able to collaborate with peers, management, and business partners. You communicate openly, share ideas, and provide timely feedback.\nOther nice-to-have s include a post-graduate degree in a related discipline (or equivalent work-experience), and programming capabilities (SQL/VBA/Python).\n\n\nWe re here to help\nAt BMO we have a shared purpose; we put the customer at the centre of everything we do   helping people is in our DNA. For 200 years we have thought about the future the future of our customers, our communities and our people. We help our customers and our communities by working together, innovating and pushing boundaries to bring them our very best every day. Together we re changing the\n\nway people think about a bank.\nAs a member of the BMO team you are valued, respected and heard, and you have more ways to grow and make an impact. We strive to help you make an impact from day one   for yourself and our customers. We ll support you with the tools and resources you need to reach new milestones, as you help our customers reach theirs. From in-depth training and coaching, to manager support and network-building opportunities, we ll help you gain valuable experience, and broaden your skillset.\nTo find out more visit us at https://bmocareers.com .\nBMO is committed to an inclusive, equitable and accessible workplace. By learning from each other s differences, we gain strength through our people and our perspectives. Accommodations are available on request for candidates taking part in all aspects of the selection process. To request accommodation, please contact your recruiter.\nJob\n Finance & Accounting\nPrimary Location\n Canada-Ontario-Toronto\nOrganisation\n CIOO CM & US CTOO-X000070\nSchedule\n full-time\nJob Posting\n 04/08/19\nUnposting Date\n 05/01/19", "link": "https://ca.indeed.com/viewjob?jk=8beae170860b6eae&from=serp&vjs=3"},
{"title": "Senior Financial Analyst II", "company": "Staples", "descr": "Description\nAbout Us\nStaples Advantage is the contract business-to-business division of Staples, working with companies of 20 or more employees to develop customized programs with specialized pricing, dedicated account management, and a complete assortment of products and services at a low total delivered cost. In addition to a complete selection of office products, Staples Advantage offers: Business Interiors by Staples, Staples Technology Solutions, Staples Facility Solutions, Staples Print Solutions and Staples Promotional Products.\n\nWe offer competitive wages along with a comprehensive benefits package including medical, dental, vision, vacation, sick pay, company RRSP/DPSP and much more.\n\nTerms of employment: Full-time, Permanent\nLanguage of work: The work will be performed in English\nWork location: 550 Pendant Dr. Mississauga, ON L5T 2W6\nSalary Range: $97 500\n\nPosition Summary:\nThe Senior Financial Analyst for Financial Planning & Analysis will be a key member of the Supply Chain Finance team dedicated to providing analytical support and business insights for the $10B+ in revenue North American Delivery business as well as the US Retail business. This role will work directly with the supply chain leaders across several locations to help drive deeper understandings of logistics trends and performance, as well as, ensure businesses are performing in line with short and long-term objectives. Analyses performed by this role will influence decisions impacting spend and strategy across both NAD & USR business units.\nJob Duties:\nWork with leaders to prepare full year comprehensive budget for supply chain operating expenses and capital.\nReview budget proposals and make forecasts for future budget needs.\nManage weekly/monthly/annual financial processes pertaining to actual results, forecasted and budgeted expectations. Identify and explain variances on a regular basis.\nPerform tracking of routine period end close functionalities including but not limited to P&L consolidation, accrual tracking and reconciliation with general ledger.\nTrack expenses across multiple cost centers and take recommended action to stay within the budget.\nUnderstand risk and opportunities to plans using sensitivity analysis and simulations.\nBe adept at manipulating, analyzing and presenting findings around big, complex data set.\nPartner with leadership to identify key business trends and provide supportive analytics that drive and influence business performance\nLeverage technology-based forecasting techniques to provide expense forecast for the Staples supply chain across U.S. and Canada.\nPrepare robust and scalable models using advanced excel mathematical and financial functions.\nThink analytically, be able to drill into the detail but understand its relevance to the big picture and disseminate key insights.\nTrain and support team members to use data visualization tools such as PowerBI and Tableau\nMaintain databases housed within Microsoft Access and PostgreSQL database used to compile financial data from multiple sources.\n\nQualifications\nEducation/Work Experience Required\nBachelor s degree in Information Technology.\nPost-graduation degree with a specialization in Finance.\nAt least 2 years of full-time/part-time work experience in financial analysis, planning, forecasting and reporting.\nCandidates with CFA certification or pursuing CFA preferred.\n1 or more years  experience synthesizing large amounts of data and providing meaningful, insightful analysis to senior management.\n1 or more years  experience in using SQL.\nCandidates with SQL related certifications preferred.\nAbility to work well both independently and as part of a team.\nOrganized, self-starter who can prioritize and manage multiple tasks to effectively meet deadlines and objectives in a changing environment\nAbility to use data to make recommendations and drive decisions, relying on strong qualitative and quantitative skills\nDriven intellectual curiosity to explore trends and variances to understand root cause\nAdvanced understanding of Microsoft Office products such as Excel and Access and Microsoft Azure.\nAbility to use Microsoft PowerBI, Oracle Essbase and MicroStrategy.\nExcellent oral and written communication skills and must be comfortable interacting with and presenting to senior management\nAbility to actively engage and partner with various leadership team members to drive results and provide needed analysis.\nAbility to write scripts in Python and SQL/PostgreSQL and VBA is a plus.\nStaples is committed to providing accommodation to people with disabilities throughout the job application and interview process to the point of undue hardship. If you require an accommodation during the application or interview process, please contact a Customer Care Representative at 1-866-782-7537.\n\nStaples is an equal opportunity employer and an accommodation will be provided during the hiring process if requested.", "link": "https://ca.indeed.com/viewjob?jk=9909afe6942277af&from=serp&vjs=3"},
{"title": "Senior Financial Analyst, FP&A", "company": "The Finance Department Limited", "descr": "Industry: Retail\nEducation: CPA-CGA, CMA, CA, MBA, CFA or student pursuing designation\nCompensation: $70-80K\nOverview:\nThe Finance Department Limited (TFDL) specializes in the Strategic Placement of Accounting & Finance Professionals on a Contract or Permanent basis. For 20 years, TFDL has been successfully servicing a select group of clients, providing them with the best Intermediate-to-Senior level talent in the industry. (BMH3xU1)\nOur client, a high end Retail organization is seeking a driven Financial Analyst to support their growing, exciting organization. This is an excellent opportunity for both a candidate with a tradition FP&A educational background in accounting and finance or individuals that come from a technical background in programming or engineering. Advancement opportunities are available for individuals that can prove their value to the organization.\nResponsibilities:\nFinancial Planning and Analysis, including budgeting, forecasting and KPIs\nSophisticated financial model construction in Excel\nMonthly and quarterly management reporting, including explaining and communicating business trends to senior management\nBusiness and Cash Forecasting\nVariance and trend analysis, including in support of the Month-End Close process\nAd-hoc analysis\nQualifications:\nCPA - CA, CMA, CGA or CFA, MBA is a plus\nUniversity degree (Business, Economics, Engineering or Computer Science)\n2-5 years of relevant experience\nAccounting experience - familiarity with financial statements, accounting rules, accounting entries, accounting data systems and charts of accounts\nFinance knowledge   Understanding of business concepts related to trends and drivers affecting revenues, profits, and expenses, loans, interest, return on investment, basic\nTreasury analyst experience is an asset\nAdvanced Excel is required which includes macros / VBA. SQL or any programming experience is an strong asset (Python or R)\nMust be able to think through complex problems\nA demonstrated ability to interact with people at all levels within an organization\nA results oriented, team player that can also work independently and take responsibility for own actions\nStrong communication skills (verbal and written)", "link": "https://ca.indeed.com/viewjob?jk=9d96fcaca43a2cbc&from=serp&vjs=3"}
]